sWahlinRhoades/uTaskerModified/Hardware/LPC2XXX/LPC23XX.c
/**********************************************************************
    Mark Butcher    Bsc (Hons) MPhil MIET

    M.J.Butcher Consulting
    Birchstrasse 20f,    CH-5406, Rütihof
    Switzerland

    www.uTasker.com    Skype: M_J_Butcher

    ---------------------------------------------------------------------
    File:        LPC23XX.c
    Project:     Single Chip Embedded Internet
    ---------------------------------------------------------------------
    Copyright (C) M.J.Butcher Consulting 2004..2020
    *********************************************************************

    29.02.2008 Add DISABLE_PLL support to allow running at oscillator speed
    29.03.2008 Add SPI FLASH support
    14.11.2008 Add PHY mask                                              {1}
    01.12.2008 Support Keil                                              {2}
    03.12.2008 Support IAR5                                              {3}
    07.02.2009 Add port interrupt support                                {4}
    01.03.2009 Add timer interrupt support                               {5}
    01.03.2009 Add RTS/CTS support                                       {6}
    04.03.2009 Change use of random number seed                          {7}
    11.06.2009 Add external interrupt support                            {8}
    11.09.2009 Add fnGetMultiDropByte()                                  {9}
    02.10.2009 Use POWER_UP and POWER_DOWN macros                        {10}
    02.11.2009 Use fast IO with LPC2104/5/6 since new revisions have fast ports {11}
    03.11.2009 Correct I2C character counter                             {12}
    07.11.2009 Add periodic timer and PWM                                {13}
    08.11.2009 Modify the LPC21XX vectored interrupt entry routine to support all possible interrupt sources {14}
    14.11.2009 Enable FLASH operations when USE_PARAMETER_AREA is used   {15}
    06.12.2009 Correction to avoid unnecessary FLASH buffer write when no buffer is open {16}
    22.01.2010 Add UART3 configuration on P4 (LPC24XX)                   {17}
    24.01.2010 Set interrupt on frame completion in Ethernet BD          {18}
    24.01.2010 Extend LPC24XX port 2 interrupts to 32                    {19}
    08.02.2010 Correct SUPPORT_EINT2 -> SUPPORT_EINT3                    {20}
    08.02.2010 Add External Interrupt pin select for LPC21XX             {21}
    27.02.2010 Add LPC2148                                               {22}
    06.03.2010 Add SST FLASH                                             {23}
    13.03.2010 Add USB device                                            {24}
    16.03.2010 Remove random seed from stack to a fixed location         {25}
    19.03.2010 Add multicast Ethernet configuration and simulation acceptance {26}
    29.03.2010 Add fnGetLocalFileTime()                                  {27}
    18.04.2010 Add optional USB DMA mode                                 {28}
    23.05.2010 Adapt MANAGED_FILES support to include internal FLASH     {29}
    09.06.2010 Add DP83848 interrupts support                            {30}
    10.06.2010 Full duplex control of MAC only when fixed speeds selected - also set in PHY {31}
    10.06.2010 Disable MII management clock between PHY reads and writes to save power and remove clock (clock output is held low) {32}
    20.06.2010 Change MII management read command order to allow debugger stepping operation {33}
    20.06.2010 Ignore MIND_MII_LINK_FAIL when reading and writing MII management interface {34}
    20.06.2010 Rename fnReadMII() and fnWriteMII() to fnReadMII_PHY() and fnWriteMII_PHY() - generic PHY registers renamed {35}
    20.07.2010 Add fnDelayLoop() for simple us delays                    {36}
    02.08.2010 Add PWM module operation                                  {37}
    11.08.2010 Add ADC                                                   {38}
    14.02.2011 Add MONITOR_PERFORMANCE support                           {39}
    23.02.2011 Allow override of UART clock                              {40}
    04.06.2011 Changes random number fixed location to the end of SRAM minus IAP stack space {41}
    05.06.2011 Add fnUnhaltEndpoint() support                            {42}
    20.10.2011 Add return value to fnConfigureRTC() for compatibility    {43}
    20.10.2011 Add fnStartBreak() and fnStopBreak()                      {44}
    13.11.2011 Correct managed file delete when using SPI Flash          {45}
    18.11.2011 Correct managed file delete size with zero length         {46}
    18.02.2012 Add return value to fnConfigEthernet()                    {47}
    18.02.2012 Rework fnConfigureRTC for compatibility                   {48}
    18.02.2012 Add ETHERNET_RELEASE_AFTER_EVERY_FRAME support            {49}
    12.09.2012 Modify fnGetFlashSectorSize() to fnGetFlashSectorRestSize() {50}
    18.09.2012 Use link-local IPv6 address for multicast configuration   {51}
    18.09.2012 Correct multicast hash acceptance in simulator            {52}
    18.09.2012 Add revised Flash handing as defined by STORAGE_REV_1     {53}
    08.07.2013 Add PHY_POLL_LINK support                                 {54}
    10.07.2013 Add _fnMIIread() and _fnMIIwrite()                        {55}
    10.10.2013 Add _MAGIC_RESET_FRAME support                            {56}
    10.10.2013 Remove EMAC CRC from rx frame length                      {57}
    16.11.2020 I2C simulation extended to support multiple I2C buses      {58}

*/

/* =================================================================== */
/*                           include files                             */
/* =================================================================== */

#ifdef _WINDOWS
    #include "config.h"
    #define INITHW  extern
    void _LowLevelInit( void);
    extern void fnOpenDefaultHostAdapter(void);
#else
    #define OPSYS_CONFIG                                                 // this module owns the operating system configuration
    #define INITHW  static
    #include "config.h"
#endif

#if defined _LPC23XX && !defined _LPC17XX

/* =================================================================== */
/*                          local definitions                          */
/* =================================================================== */

#if defined SPI_SW_UPLOAD || (defined SPI_FILE_SYSTEM && defined FLASH_FILE_SYSTEM)
    #define SPI_FLASH_ENABLED                                            // SPI driver required
#endif

#if defined COMPILE_IAR || defined COMPILE_KEIL	                         // {2}
    #if defined COMPILE_IAR
        #define __interrupt   __irq __arm
    #else
        #define __interrupt   __irq
        #define __root
    #endif
    #ifdef _LPC21XX
        #define acknowledge_irq()   VICVectAddr = 0;
    #else
        #define acknowledge_irq()   VICAddress = 0;                      // IAR enables direct calls to interrupt routine
    #endif
#else
    #define __interrupt
    #define __root
    #define acknowledge_irq()                                            // GNU has a problem doing this so uses a dispatcher in assember which handles the acknowledge
#endif
 


/* =================================================================== */
/*                       local structure definitions                   */
/* =================================================================== */


/* =================================================================== */
/*                global function prototype declarations               */
/* =================================================================== */


/* =================================================================== */
/*                 local function prototype declarations               */
/* =================================================================== */


/* =================================================================== */
/*                             constants                               */
/* =================================================================== */


/* =================================================================== */
/*                      local variable definitions                     */
/* =================================================================== */

#ifdef RANDOM_NUMBER_GENERATOR
    unsigned short *ptrSeed;
#endif
#if defined FLASH_FILE_SYSTEM || defined USE_PARAMETER_AREA              // {15}
    static unsigned long ulFlashRow[FLASH_ROW_SIZE/sizeof(unsigned long)]; // FLASH row backup buffer (on word boundary)
    static unsigned char *ucFlashRow = (unsigned char *)ulFlashRow;      // pointer to array of bytes
#endif
#if defined SPI_FLASH_ENABLED
    #if !defined SPI_FLASH_DEVICE_COUNT
        #define SPI_FLASH_DEVICE_COUNT 1
    #endif
    static int SPI_FLASH_Danger[SPI_FLASH_DEVICE_COUNT] = {0};           // signal that the FLASH status should be checked before using since there is a danger that it is still busy
    static unsigned char ucSPI_FLASH_Type[SPI_FLASH_DEVICE_COUNT];       // list of attached FLASH devices

    #ifdef SPI_FLASH_MULTIPLE_CHIPS
        unsigned long ulChipSelect[SPI_FLASH_DEVICE_COUNT] = {
            CS0_LINE,
            CS1_LINE                                                     // at least 2 expected when multiple devices are defined
        #ifdef CS2_LINE
            ,CS2_LINE
            #ifdef CS3_LINE
            ,CS3_LINE
            #endif
        #endif
        };
        #define EXTENDED_CS , &iChipSelect
        #if defined STORAGE_REV_1                                        // {53}
            #define _EXTENDED_CS  ptrAccessDetails->ucDeviceNumber,
        #else
            #define _EXTENDED_CS  iChipSelect,
        #endif
    #else
        #define EXTENDED_CS
        #define _EXTENDED_CS
    #endif
#endif
#if defined ETH_INTERFACE && defined _WINDOWS
    static unsigned short usPhyMode = 0;
#endif
static int iInterruptLevel = 0;

