sWahlinRhoades/uTaskerModified/Hardware/LPC2XXX/LPC23XX.c
#if defined STORAGE_REV_1 && !defined ONLY_INTERNAL_FLASH_STORAGE        // {53}
    #if defined EXT_FLASH_FILE_SYSTEM                                    // devices without internal flash - if external Flash enabled put default to it
    static const STORAGE_AREA_ENTRY default_flash = {           
        0,                                                               // end of list
        (unsigned char *)(EXTERNAL_FLASH_START_ADDRESS),                 // start address of external flash
        (unsigned char *)(EXTERNAL_FLASH_START_ADDRESS + (SIZE_OF_EXTERNAL_FLASH - 1)), // end of external flash
        _STORAGE_PARALLEL_FLASH,                                         // type
        EXTERNAL_FLASH_DEVICE_COUNT                                      // number of devices
    };
    #else
    static const STORAGE_AREA_ENTRY default_flash = {
        0,                                                               // end of list
        (unsigned char *)(FLASH_START_ADDRESS),                          // start address of internal flash
        (unsigned char *)(FLASH_START_ADDRESS + (SIZE_OF_FLASH - 1)),    // end of internal flash
        _STORAGE_INTERNAL_FLASH,                                         // type
        0                                                                // not multiple devices
    };
    #endif

    STORAGE_AREA_ENTRY *UserStorageListPtr = (STORAGE_AREA_ENTRY *)&default_flash; // default entry
#endif

#if !defined SPI_INTERFACE && (defined SPI_FILE_SYSTEM || defined SPI_SW_UPLOAD)
    static void fnConfigSPIFileSystem(unsigned char ucSpeed);
    #if defined SPI_FLASH_ENABLED
        #if !defined SPI_FLASH_ST && !defined SPI_FLASH_SST25            // {23}
            #define SPI_FLASH_ATMEL                                      // default if not otherwise defined
        #endif
        #define _SPI_DEFINES
            #include "spi_flash_lpc_atmel.h"
            #include "spi_flash_lpc_stmicro.h"
            #include "spi_flash_lpc_sst25.h"                             // {23}
        #undef _SPI_DEFINES
    #endif
#endif

#if (defined ACTIVE_FILE_SYSTEM  || defined USE_PARAMETER_BLOCK || defined INTERNAL_USER_FILES) && defined _WINDOWS
    extern int iFetchingInternalMemory = 0;
#endif

/* =================================================================== */
/*                     global variable definitions                     */
/* =================================================================== */

#ifdef ETH_INTERFACE
    extern ETHERNETQue *eth_tx_control;                                  // ethernet structure pointers for Ethernet Interrupt handling
    #if defined _MAGIC_RESET_FRAME                                       // {56}
        static int MAGIC_RxConsumeIndex = -1;
    #endif
#endif
#if defined I2C_INTERFACE
    extern I2CQue *I2C_rx_control[NUMBER_I2C];
    extern I2CQue *I2C_tx_control[NUMBER_I2C];
#endif

/* =================================================================== */
/*                      local function definitions                     */
/* =================================================================== */

#ifndef _WINDOWS
    static void fnInitHW(void);
#endif


/* =================================================================== */
/*                      global function definitions                    */
/* =================================================================== */

#ifndef _WINDOWS
    extern __interrupt void _start(void);                                // reset vector location
#endif


/* =================================================================== */
/*                      STARTUP CODE                                   */
/* =================================================================== */


// This is the interrupt vector table for the processor including the reset vector (entrypoint)
// It is at a fixed address
//
typedef void (*tIsrFunc)(void);

#ifndef _WINDOWS
    extern void __segment_init(void);
    #if defined COMPILE_IAR
        #if defined COMPILE_IAR5                                         // {3}
            #pragma segment=".data"
            #pragma segment=".bss"
            static unsigned char *ptrTopOfUsedMemory = 0;;
            #define HEAP_START_ADDRESS ptrTopOfUsedMemory                // IAR5 compiler - last location of static variables
        #else
            #pragma segment="DATA_Z"
            #define HEAP_START_ADDRESS __segment_end("DATA_Z")           // IAR compiler - last location of static variables
        #endif
    #elif defined COMPILE_KEIL                                           // {2}
        extern unsigned char Stack_Mem;
        #define HEAP_START_ADDRESS  &Stack_Mem                           // Keil - start of stack
    #else
        extern void __irq_en(void);                                      // enable interrupt in assembler code
        extern void __irq_dis(void);                                     // disable interrupt in assembler code
        extern unsigned char __heap_end__;
        #define HEAP_START_ADDRESS &__heap_end__                         // GNU last location of static variables
    #endif


// Main entry for the target code
//
__root int main(void)                                                    // __root forces the function to be linked in IAR project
{
#ifdef MULTISTART
    MULTISTART_TABLE *prtInfo;
    unsigned char *pucHeapStart = HEAP_START_ADDRESS;
#endif
#ifdef RANDOM_NUMBER_GENERATOR
  //unsigned short usRandomSeed;                                         // {25} we put an uninitialised variable on to the stack for use as a random seed
    ptrSeed = RANDOM_SEED_LOCATION; // &usRandomSeed;                    
#endif

#if defined (_BOOT_PROGRAM) && defined (COMPILE_IAR)
    __segment_init();                                                    // initialisation of local variables
#elif defined COMPILE_IAR5                                               // {3}
    if (__sfe(".bss") > __sfe(".data")) {                                // set last used SRAM address
        ptrTopOfUsedMemory = __sfe(".bss");
    }
    else {
        ptrTopOfUsedMemory = __sfe(".data");
    }
#endif
    fnInitHW();                                                          // perform hardware initialisation (note that we do not have heap yet)
#ifdef MULTISTART
    prtInfo = ptMultiStartTable;                                         // if the user has already set to alternative start configuration
    if (prtInfo == 0) {                                                  // no special start required
_abort_multi:
        fnInitialiseHeap(ctOurHeap, HEAP_START_ADDRESS);                 // initialise heap
        uTaskerStart((UTASKTABLEINIT *)ctTaskTable, ctNodes, PHYSICAL_QUEUES); // start the operating system
        while ((prtInfo = (MULTISTART_TABLE*)uTaskerSchedule()) == 0) {} // schedule uTasker
    }

    do {
        pucHeapStart = HEAP_START_ADDRESS;
        if (prtInfo->new_hw_init) {                                      // info to next task configuration available
            pucHeapStart = prtInfo->new_hw_init(JumpTable);              // get heap details from next configuration
            if (!pucHeapStart) {
                goto _abort_multi;                                       // this can happen if the jump table version doesn't match - prefer to stay in boot mode than start an application which will crash
            }
        }

        fnInitialiseHeap(prtInfo->ptHeapNeed, pucHeapStart);             // initialise the new heap
                                                                         // start the operating system with next configuration
        uTaskerStart((UTASKTABLEINIT *)prtInfo->ptTaskTable, prtInfo->ptNodesTable, PHYSICAL_QUEUES);

        while ((prtInfo = (MULTISTART_TABLE*)uTaskerSchedule()) == 0) {} // schedule uTasker

    } while (1);
#else
    fnInitialiseHeap(ctOurHeap, HEAP_START_ADDRESS);                     // initialise heap
    uTaskerStart((UTASKTABLEINIT *)ctTaskTable, ctNodes, PHYSICAL_QUEUES); // start the operating system

    while (1) {
        uTaskerSchedule();                                               // schedule uTasker
    }
#endif
    return 0;                                                            // we never return....
}
#endif                                                                   // end if not _WINDOWS


#ifdef RANDOM_NUMBER_GENERATOR
// How the random number seed is set depends on the hardware possibilities available.
//
extern void fnInitialiseRND(unsigned short *usSeedValue)                 // {7}
{
    if ((*usSeedValue = *ptrSeed) == 0) {                                // we hope that the content of the random seed is random after a power up
        *usSeedValue = 0x127b;                                           // we must not set a zero - so we set a fixed value
    }                                                                    // after a reset it should be well random since it will contain the value at the reset time
    *ptrSeed = fnRandom();                                               // ensure that the seed value is modified between resets
}
#endif


// Basic hardware initialisation of specific hardware
//
INITHW void fnInitHW(void)                                               //perform hardware initialisation
{
#ifdef _WINDOWS
    unsigned long ulPortPullups[] = {
        PORT0_DEFAULT_INPUT,                                             // set the port states out of reset in the project file app_hw_lpc23xx.h
        PORT1_DEFAULT_INPUT,
        PORT2_DEFAULT_INPUT,
        PORT3_DEFAULT_INPUT,
        PORT4_DEFAULT_INPUT
    };
    #ifdef RANDOM_NUMBER_GENERATOR
    static unsigned short usRandomSeed = 0;                              // {25} note that the target works differently
    ptrSeed = &usRandomSeed;
    #endif
    fnInitialiseDevice(ulPortPullups);
    _LowLevelInit();
#endif
#ifdef _WINDOWS
    fnSimPorts(-1);                                                      // ensure port states are recognised
#endif
    INIT_WATCHDOG_LED();                                                 // allow user configuration of a blink LED
#ifndef _DEBUG_CODE_
    INIT_WATCHDOG_DISABLE();
    if (!WATCHDOG_DISABLE()) {
        ACTIVATE_WATCHDOG();                                             // allow user configuration of internal watch dog timer
    }
#endif
#if !defined SPI_INTERFACE && (defined SPI_FILE_SYSTEM || defined SPI_SW_UPLOAD)
    #if defined SPI_FLASH_ENABLED
    fnConfigSPIFileSystem(MAX_SPI);                                      // configure SPI interface for maximum speed
    #define _CHECK_SPI_CHIPS                                             // insert manufacturer dependent code
        #include "spi_flash_lpc_atmel.h"
        #include "spi_flash_lpc_stmicro.h"
        #include "spi_flash_lpc_sst25.h"                                 // {23}
    #undef _CHECK_SPI_CHIPS
    #else
    fnConfigSPIFileSystem(SPI_2MEG);                                     // configure SPI interface for SPI file system and 2M speed
    #endif
#endif
#if defined FLASH_FILE_SYSTEM || defined USE_PARAMETER_AREA              // {15}
    uMemset(ucFlashRow, 0xff, FLASH_ROW_SIZE);                           // flush the FLASH ROW backup buffer when starting
#endif
    fnUserHWInit();                                                      // allow the user to initialise hardware specific things
#ifdef _WINDOWS
    fnSimPorts(-1);                                                      // ensure port states are recognised
#endif
}


// Support watchdog re-triggering of specific hardware
//
void fnRetriggerWatchdog(void)
{
#ifndef _DEBUG_CODE_
    #ifdef _WINDOWS
    if (WDFEED == 0) return;                                             // during commanded reset with watchdog
    #endif
    uDisable_Interrupt();                                                // protect the feed sequence from interrupts
    WDFEED = 0xaa;                                                       // watchdog feed sequence
    WDFEED = 0x55;
    uEnable_Interrupt();                                                 // flash an LED for visualisation
#endif
    TOGGLE_WATCHDOG_LED();
}

// Routine to disable interrupts during critical region
//
extern void uDisable_Interrupt(void)
{
#ifndef _WINDOWS
    #if defined (COMPILE_IAR)
    __disable_interrupt();                                               // IAR intrinsic routine
    #elif defined COMPILE_KEIL                                           // {2}
    __disable_irq();                                                     // Keil intrinsic routine
    #elif defined (_GNU)
    __irq_dis();
    #endif
#endif
    iInterruptLevel++;                                                   // monitor the level of disable nesting
}

