sWahlinRhoades/uTaskerModified/Hardware/LPC2XXX/LPC23XX.c
// Routine to re-enable interrupts on leaving a critical region (IAR uses intrinsic function)
//
extern void uEnable_Interrupt(void)
{
#ifdef _WINDOWS
    if (!iInterruptLevel) {
        *(int *)0 = 0;                                                   // basic error - cause simulator exception
    }                                                                    // a routine is enabling interrupt although they are presently off. This may not be a serious error but it is unexpected so best check why...
#endif
    if (!(--iInterruptLevel)) {                                          // only when no more interrupt nesting,
    #if defined (COMPILE_IAR)
        __enable_interrupt();                                            // IAR intrinsic routine
    #elif defined COMPILE_KEIL                                           // {2}
        __enable_irq();                                                  // Keil intrinsic routine
    #elif defined (_GNU)
        __irq_en();
    #endif
    }
}


extern void fnDelayLoop(unsigned long ulDelay_us)                        // {36}
{
    #define LOOP_FACTOR 10000000                                         // tuned by trial and error - may be compiler dependent!
    volatile unsigned long ulDelay = ((CCLK/LOOP_FACTOR) * ulDelay_us);
    while (ulDelay--) {}                                                 // simple loop tuned to perform us timing
}

// Enter a vector in the vector table in SRAM
//
#ifdef _LPC21XX                                                          // {14}
// The LPC21XX support 16 vectored IRQs with priorities from 0 to 15 (0 is highest). These are called slots in this realisation.
//
static void fnSetIntHandler(unsigned long ulInterrupt, unsigned char ucPriority,  unsigned long interrupt_handler)
{
    unsigned long *ptrVectAdd  = (VICVECT_ADD + ucPriority);
    unsigned long ulCount = ulInterrupt;
    unsigned char ucSlot = 0;
    while (1) {
        ulCount >>= 1;
        if (ulCount == 0) {
            break;
        }
        ucSlot++;
    }
    *ptrVectAdd = interrupt_handler;                                     // enter the handling interrupt routine in the vector table
    ptrVectAdd += (VICPRIORITY_ADD - VICVECT_ADD);                       // move to control register corresponding to the priority of the vectored interrupts
    *ptrVectAdd = (VECTOR_IRQ_ENABLE | ucSlot);
    #ifdef _WINDOWS
    VICIntEnable |= ulInterrupt;                                         // enable interrupt in interrupt controller
    #else
    VICIntEnable = ulInterrupt;                                          // enable interrupt in interrupt controller
    #endif
}
#else
static void fnSetIntHandler(unsigned long ulInterrupt, unsigned char ucPriority,  unsigned long interrupt_handler)
{
    unsigned long *ptrVectAdd  = VICVECT_ADD;
    unsigned long ulCount = ulInterrupt;
    while (1) {
        ulCount >>= 1;
        if (ulCount == 0) {
            break;
        }
        ptrVectAdd++;
    }
    *ptrVectAdd = interrupt_handler;                                     // enter the handling interrupt routine in the vector table
    ptrVectAdd += (VICPRIORITY_ADD - VICVECT_ADD);                       // move to priority register
    *ptrVectAdd = ucPriority;                                            // assign interrupt priority
    #ifdef _WINDOWS
    VICIntEnable |= ulInterrupt;                                         // enable interrupt in interrupt controller
    #else
    VICIntEnable = ulInterrupt;                                          // enable interrupt in interrupt controller
    #endif
}
#endif

/**************************** Real Time Clock interrupt ******************************************/


static __interrupt void RealTimeInterrupt(void)
{
    TICK_IR = MR0_INTERRUPT;                                             // clear interrupt
    fnRtmkSystemTick();                                                  // operating system tick
    acknowledge_irq();                                                   // required on exit of all irqs
}

// Routine to initialise the Tick interrupt
//
#define REQUIRED_MS ((1000/TICK_RESOLUTION))                             // the TICK frequency we require in kHz
#ifdef _LPC21XX
    #if defined TICK_TIM_PRESCALE
        #define TICK_DIVIDE (((PCLK/4 + REQUIRED_MS/2)/REQUIRED_MS)/TICK_TIM_PRESCALE)
    #elif (defined _LPC213X || defined _LPC214X)
        #define TICK_DIVIDE ((PCLK + REQUIRED_MS/2)/REQUIRED_MS)         // the divide ratio required (APBDIV configured to respect USB requirements)
    #else
        #define TICK_DIVIDE ((PCLK/4 + REQUIRED_MS/2)/REQUIRED_MS)       // the divide ratio required (APBDIV default / 4)
    #endif
#else
    #define TICK_DIVIDE ((PCLK/8 + REQUIRED_MS/2)/REQUIRED_MS)           // the divide ratio required (Timer clock / 8)
#endif

// The TICK is driven from one of the timers, which can be defined by the application configuration
//
extern void fnStartTick(void)
{
#ifndef _LPC21XX
    TICK_PCLKSEL |= TICK_CLK_SPEED;                                      // clock the timer with PCLK/8 for lowest power
#endif
    POWER_UP(TICK_TIMER_POWER);                                          // {10} power up timer

    TICK_TCR = COUNTER_RESET;                                            // ensure timer stopped
    #ifdef TICK_TIM_PRESCALE
    TICK_PR  = TICK_TIM_PRESCALE;
    #else
    TICK_PR  = 0;                                                        // no prescaler
    #endif
    TICK_MCR = (MR0I | MR0R);                                            // reset and interrupt on match
    TICK_MR0 = TICK_DIVIDE;                                              // match value

    TICK_IR = 0xff;                                                      // reset any waiting interrupt (useful after new start without a real reset)
    fnSetIntHandler(TICK_TIMER_INT, TICK_INTERRUPT_PRIORITY, (unsigned long)RealTimeInterrupt); // configure and enter the handling interrupt routine in the vector table
    TICK_TCR = COUNTER_ENABLE;                                           // enable timer operation

    #if defined (COMPILE_IAR)
    __enable_interrupt();                                                // IAR intrinsic routine
    #elif defined COMPILE_KEIL                                           // {2}
    __enable_irq();                                                      // Keil intrinsic routine
    #endif
    #ifdef MONITOR_PERFORMANCE                                           // {39} configure a timer that will be used to measure the duration of task operation
    INITIALISE_MONITOR_TIMER();
    #endif
}



#ifdef ETH_INTERFACE
/* =================================================================== */
/*                          Ethernet Interface                         */
/* =================================================================== */

#if !defined ETHERNET_RELEASE_AFTER_EVERY_FRAME                          // {49}
    static const unsigned char EMAC_RX_int_message[HEADER_LENGTH] = {0, 0 , TASK_ETHERNET, INTERRUPT_EVENT, EMAC_RX_INTERRUPT}; // define fixed interrupt event
#endif

extern signed char fnEthernetEvent(unsigned char *ucEvent, ETHERNET_FRAME *rx_frame)
{
    #ifdef LAN_REPORT_ACTIVITY
    static const unsigned char EMAC_rx_int_message[HEADER_LENGTH] = {0, 0, INTERRUPT_TASK_LAN_EXCEPTIONS, INTERRUPT_EVENT, EMAC_RX_INTERRUPT};
    #endif
    if (EMAC_RX_INTERRUPT == *ucEvent) {
        LPC23XX_RX_STATUS *ptrRxStatus = (LPC23XX_RX_STATUS *)EMAC_RxStatus;
        ptrRxStatus += EMAC_RxConsumeIndex;                              // set present buffer status register

        if (!(ptrRxStatus->ulStatusInfo & RX_LAN_SIZE_MASK)) {
            return -1;                                                   // no complete frame ready
        }
        else {
            rx_frame->frame_size = (unsigned short)((ptrRxStatus->ulStatusInfo & RX_LAN_SIZE_MASK) - 3); // {57} remove CRC-32
            ptrRxStatus->ulStatusInfo &= ~RX_LAN_SIZE_MASK;
    #ifdef LAN_REPORT_ACTIVITY
            fnWrite(INTERNAL_ROUTE, (unsigned char*)EMAC_rx_int_message, HEADER_LENGTH);
    #endif
            if (ptrRxStatus->ulStatusInfo & (RX_LAN_OVERRUN | RX_NO_DESCRIPTOR | ALIGNMENT_ERROR)) {
    #ifdef USE_IP_STATS
                if (ptrRxStatus->ulStatusInfo & (RX_LAN_OVERRUN | RX_NO_DESCRIPTOR)) {
                    fnIncrementEthernetStats(TOTAL_LOST_RX_FRAMES);
                }
                else {
                    fnIncrementEthernetStats(TOTAL_OTHER_EVENTS);        // count other unexpected events
                }
    #endif
                fnFreeEthernetBuffer((int)EMAC_RxConsumeIndex);
                return -1;                                               // bad frame
            }
            else {
                LPC23XX_RX_BD *ptrRxBd = (LPC23XX_RX_BD *)EMAC_RxDescriptor;
                ptrRxBd += EMAC_RxConsumeIndex;                          // set present rx consumer buffer descriptor
                rx_frame->ptEth = (ETHERNET_FRAME_CONTENT *)ptrRxBd->ptrBlock; // return pointer to the fixed linear input buffer
            }
        }
        return (unsigned char)EMAC_RxConsumeIndex;                       // buffer index received from
    }
    #if defined USE_IP_STATS && !defined ETHERNET_RELEASE_AFTER_EVERY_FRAME
    else {
        fnIncrementEthernetStats(TOTAL_OTHER_EVENTS);                    // count other unexpected events
    }
    #endif
    return -1;                                                           // invalid channel
}

#if defined _MAGIC_RESET_FRAME                                           // {56}
extern void fnEnableMagicFrames(int iOnOff)
{
    uDisable_Interrupt();                                                // protect from ethernet reception interrupts
    if (iOnOff == 0) {
        MAGIC_RxConsumeIndex = -1;                                       // disable
    }
    else {
        MAGIC_RxConsumeIndex = (int)EMAC_RxProduceIndex;                 // enabled by synchronising the magic frame buffer with the receiver
    }
    uEnable_Interrupt();                                                 // allow further interrupt processing
}
#endif

// EMAC interrupt dispatcher
//
static __interrupt void EMAC_Interrupt(void)
{
    while (EMAC_IntStatus & (EMAC_RxOverrunInt | EMAC_RxErrorInt | EMAC_RxFinishedInt | EMAC_RxDoneInt)) { // read the interrupt status register
        if (EMAC_IntStatus & (EMAC_RxFinishedInt | EMAC_RxDoneInt)) {    // ethernet frame reception
            EMAC_IntClear = (EMAC_RxOverrunInt | EMAC_RxErrorInt | EMAC_RxFinishedInt | EMAC_RxDoneInt);
    #if defined _MAGIC_RESET_FRAME                                       // {56}
            if (MAGIC_RxConsumeIndex >= 0) {                             // if magic frame recognition is enabled
                LPC23XX_RX_STATUS *ptrRxStatus = (LPC23XX_RX_STATUS *)EMAC_RxStatus;
                ptrRxStatus += MAGIC_RxConsumeIndex;                     // set present buffer status register
                if (ptrRxStatus->ulStatusInfo & RX_LAN_SIZE_MASK) {      // if complete frame ready
                    if (!(ptrRxStatus->ulStatusInfo & (RX_LAN_OVERRUN | RX_NO_DESCRIPTOR | ALIGNMENT_ERROR))) { // as long as there are no errors
                        unsigned short usLength = (unsigned short)((ptrRxStatus->ulStatusInfo & RX_LAN_SIZE_MASK) - 3);
                        if (usLength == 93) {                            // payload length must be 93 bytes in length
                            int i;
                            unsigned char *ptrData;
                            LPC23XX_RX_BD *ptrRxBd = (LPC23XX_RX_BD *)EMAC_RxDescriptor;
                            ptrRxBd += MAGIC_RxConsumeIndex;             // set present rx consumer buffer descriptor
                            ptrData = &((ETHERNET_FRAME_CONTENT *)ptrRxBd->ptrBlock)->ethernet_frame_type[0]; // return pointer to the fixed linear input buffer

