sWahlinRhoades/uTaskerModified/Hardware/LPC2XXX/LPC23XX.c
                            for (i = 0; i < 24; i++) {                   // remaining header must be (unsigned short)_MAGIC_RESET_FRAME repeated 24 times
                                if (*ptrData++ != (unsigned char)(_MAGIC_RESET_FRAME >> 8)) {
                                    goto _not_magic_frame;
                                }
                                if (*ptrData++ != (unsigned char)(_MAGIC_RESET_FRAME)) {
                                    goto _not_magic_frame;
                                }
                            }
                            // A magic frame has been received - the 61st byte is used to signal the type and 32 bytes of optional data are passed
                            //
                            fnMagicFrame(*ptrData, (ptrData + 1));       // allow the user to handle the magic frame
                        }
                    }
                }
_not_magic_frame:
                if (MAGIC_RxConsumeIndex >= (int)EMAC_RxDescriptorNumber) {
                    MAGIC_RxConsumeIndex = 0;
                }
                else {
                    MAGIC_RxConsumeIndex++;
                }
            }
    #endif
    #if defined ETHERNET_RELEASE_AFTER_EVERY_FRAME                       // {49}
            uTaskerStateChange(TASK_ETHERNET, UTASKER_ACTIVATE);         // schedule the Ethernet task
    #else
            iInterruptLevel = 1;                                         // ensure interrupts remain blocked when putting message to queue
            fnWrite(INTERNAL_ROUTE, (unsigned char*)EMAC_RX_int_message, HEADER_LENGTH); // inform the Ethernet task
            iInterruptLevel = 0;
    #endif
        }
        else {
            EMAC_IntClear = (EMAC_RxOverrunInt | EMAC_RxErrorInt | EMAC_RxFinishedInt | EMAC_RxDoneInt); // clear the interrupt status bit
        }
    #ifdef _WINDOWS
        EMAC_IntStatus &= ~(EMAC_RxOverrunInt | EMAC_RxErrorInt | EMAC_RxFinishedInt | EMAC_RxDoneInt); // clear interrupt flag when simulating
    #endif
    }
    acknowledge_irq();                                                   // required on exit of all irqs
}


#if defined _LAN8700
    #define READ_INTERRUPT_FLAGS   LAN8700_INTERRUPT_FLAG
    #define READ_STATE             KS8721_100BASETX_PHY_CONTROL_REGISTER
    #define LINK_UP_FLAG           PHY_LAN8700_AUTO_NEG_COMPLETE
    #define LINK_DOWN_FLAG         PHY_LAN8700_LINK_DOWN
    #define SPEED_100M             PHY_OP_MODE_100_BASE_T_HALF_DUPLEX
    #define FULL_DUPLEX_FLAG       PHY_OP_MODE_FULL_DUPLEX
#elif defined _DP83848                                                   // {30}
    #define READ_INTERRUPT_FLAGS   DP83848_MII_INTERRUPT_STATUS_REGISTER
    #define READ_STATE             DP83848_PHY_STATUS_REGISTER
    #define LINK_UP_FLAG           PHY_LINK_IS_UP
    #define LINK_DOWN_FLAG         PHY_LAN8700_LINK_DOWN
    #define SPEED_100M             SPEED_STATUS_10M
    #define FULL_DUPLEX_FLAG       DUPLEX_STATUS_FULL_DUPLEX
#else
    #define READ_INTERRUPT_FLAGS   KS8721_INTERRUPT_CONTROL_STATUS_REGISTER
    #define READ_STATE             KS8721_100BASETX_PHY_CONTROL_REGISTER
    #define LINK_UP_FLAG           PHY_LINK_UP_INT
    #define LINK_DOWN_FLAG         PHY_LINK_DOWN_INT
    #define SPEED_100M             PHY_OP_MODE_100_BASE_T_HALF_DUPLEX
    #define FULL_DUPLEX_FLAG       PHY_OP_MODE_FULL_DUPLEX
#endif

// Read a PHY register
//
static unsigned short fnReadMII_PHY(unsigned char ucRegAdr)              // {35}
{
    unsigned short usReadValue;
    MCFG = HOST_CLK_DIV_28;                                              // {32} configure 2.5MHz MDIO clock - enable
    MADR = (unsigned long)(ucRegAdr | PHY_ADDRESS_);                     // define address
    MCMD = MCMD_READ;                                                    // {33} start read after address has been defined

    #ifdef _WINDOWS
    if (GENERIC_PHY_IDENTIFIER_1 == ucRegAdr) {                          // simulate reads from identifier register
        MRDD = (PHY_IDENTIFIER >> 16);
    }
    else if (GENERIC_PHY_IDENTIFIER_2 == ucRegAdr) {
        MRDD = (PHY_IDENTIFIER & 0x0000ffff);
    }
        #ifdef _DP83848
    else if (GENERIC_BASIC_STATUS_REGISTER == ucRegAdr) {
        MRDD = (PHY_LINK_IS_UP | PHY_AUTO_NEGOTIATION_COMPLETE);
    }
        #endif
    else if (READ_INTERRUPT_FLAGS == ucRegAdr) {
        #ifdef PHY_INTERRUPT
        unsigned char ucBit = 31;
        unsigned long ulBit = PHY_INT_PIN;
        while (ulBit > 1) {
            ulBit >>= 1;
            ucBit--;
        }
        fnSimulateInputChange(PHY_INT_PORT, ucBit, SET_INPUT);           // remove IRQ when this register is read
        #endif
        #if defined _LAN8700
        MRDD = PHY_LAN8700_AUTO_NEG_COMPLETE;
        #elif defined _DP83848
        MRDD =  (DP83848_LINK_INT | DP83848_ANC_INT);                    // link up and autonegotiation complete
        #else
        MRDD = PHY_LINK_UP_INT;
        #endif
    }
    else if (READ_STATE == ucRegAdr) {
        #ifdef _DP83848
        MRDD = DUPLEX_STATUS_FULL_DUPLEX;                                // 100M full-duplex
        #else
        MRDD = PHY_OP_MODE_100_BASE_T_FULL_DUPLEX;
        #endif
    }
    #endif

    while (MIND & MIND_BUSY) {                                           // wait for read to be executed
//      if (MIND & MIND_MII_LINK_FAIL) {                                 // {34}
//          MCFG = (RESET_MMI_MGMT | HOST_CLK_DIV_28);
//          return 0;
//      }
    }
    MCMD = 0;
    usReadValue = (unsigned short)MRDD;                                  // read the value
    MCFG = (RESET_MMI_MGMT | HOST_CLK_DIV_28);                           // {32} reset the MII management interface to disable clock
    return usReadValue;                                                  // return the read value
}

// Write a PHY register
//
static int fnWriteMII_PHY(unsigned char ucRegAdr, unsigned short usData) // {35}
{
    MCFG = HOST_CLK_DIV_28;                                              // {32} configure 2.5MHz MDIO clock - enable
    MCMD = 0;                                                            // write access
    MADR = (unsigned long)(ucRegAdr | PHY_ADDRESS_);                     // define address
    MWTD = usData;                                                       // write the data

    #ifdef _WINDOWS
    if (GENERIC_BASIC_CONTROL_REGISTER == ucRegAdr) {
        usPhyMode = usData;
    }
    #endif

    while (MIND & MIND_BUSY) {                                           // wait for read to be executed
//      if (MIND & MIND_MII_LINK_FAIL) {                                 // {34}
//          MCFG = (RESET_MMI_MGMT | HOST_CLK_DIV_28);
//          return -1;
//      }
    }
    MCFG = (RESET_MMI_MGMT | HOST_CLK_DIV_28);                           // {32} reset the MII management interface to disable clock
    return 0;
}

