sWahlinRhoades/uTaskerModified/Hardware/LPC2XXX/LPC23XX.c
#if defined PHY_MULTI_PORT                                               // {55}
extern unsigned short _fnMIIread(unsigned char ucPort, unsigned char _mradr)
{
    return (fnReadMII_PHY(ucPort, _mradr));
}

extern void fnWriteMII_PHY(unsigned char ucPort, unsigned char _mradr, unsigned short _mwdata)
{
    fnWriteMII_PHY(ucPort, _mradr, _mwdata);
}
#else
extern unsigned short _fnMIIread(unsigned char _mradr)
{
    return (fnReadMII_PHY(_mradr));
}

extern void _fnMIIwrite(unsigned char _mradr, unsigned short _mwdata)
{
    fnWriteMII_PHY(_mradr, _mwdata);
}
#endif

#if defined PHY_POLL_LINK || defined PHY_INTERRUPT                       // {54}

extern void fnCheckEthLinkState(void)
{
    #ifdef INTERRUPT_TASK_PHY
    unsigned char int_phy_message[HEADER_LENGTH] = {0, 0, INTERRUPT_TASK_PHY, INTERRUPT_EVENT, UNKNOWN_INTERRUPT}; // define standard interrupt event
    #endif

    unsigned short usInterrupt = fnReadMII_PHY(READ_INTERRUPT_FLAGS);    // read the cause(s) of the interrupt, which resets the bits
    #if defined _DP83848
    if (usInterrupt & (DP83848_LINK_INT | DP83848_ANC_INT)) {            // change of link state detected or auto-negotiation complete
        usInterrupt = fnReadMII_PHY(GENERIC_BASIC_STATUS_REGISTER);      // read whether the link is up or not
    }
    else {
        return;                                                          // {54} no change so ignore (this only occurs when polling)
    }
    if (usInterrupt & PHY_AUTO_NEGOTIATION_COMPLETE) {                   // since auto-negotiation has just completed ensure that MAC settings are synchronised
        usInterrupt = fnReadMII_PHY(READ_STATE);                         // check the  details of link
        usInterrupt ^= SPEED_100M;                                       // invert the flag for compatibility
        if (usInterrupt & SPEED_100M) {                                  // if at least 100 half duplex it indicates a 100MHz link
            SUPP = SUPP_SPEED;                                           // ensure EMAC is set to 100MHz mode
        #ifdef INTERRUPT_TASK_PHY
            int_phy_message[MSG_INTERRUPT_EVENT] = LAN_LINK_UP_100;
        #endif
        }
        else {
            SUPP = 0;                                                    // ensure EMAC is set to 10MHz mode
        #ifdef INTERRUPT_TASK_PHY
            int_phy_message[MSG_INTERRUPT_EVENT] = LAN_LINK_UP_10;
        #endif
        }
        if (usInterrupt & FULL_DUPLEX_FLAG) {                            // {31}
            IPGT  = FULL_DUPLEX_IPG_TIME;
            MAC2 |= MAC2_FULL_DUPLEX;
            EMAC_COMMAND |= EMAC_FULL_DUPLEX;
        #ifdef INTERRUPT_TASK_PHY
            int_phy_message[MSG_INTERRUPT_EVENT]++;                      // {54} set full-duplex event
        #endif
        }
        else {
            IPGT  = HALF_DUPLEX_IPG_TIME;
            MAC2 &= ~MAC2_FULL_DUPLEX;
            EMAC_COMMAND &= ~EMAC_FULL_DUPLEX;
        }
    }
        #if defined INTERRUPT_TASK_PHY
    else if (LINK_UP_FLAG & usInterrupt) {                               // link up but not auto-negotiation complete
        usInterrupt = fnReadMII_PHY(READ_STATE);                         // check the  details of link in order to signal the speed
        usInterrupt ^= SPEED_100M;                                       // invert the flag for compatibility
        if (usInterrupt & SPEED_100M) {                                  // if at least 100 half duplex it indicates a 100MHz link
            int_phy_message[MSG_INTERRUPT_EVENT] = LAN_LINK_UP_100;
        }
        else {
            int_phy_message[MSG_INTERRUPT_EVENT] = LAN_LINK_UP_10;
        }
        if (usInterrupt & FULL_DUPLEX_FLAG) {
            int_phy_message[MSG_INTERRUPT_EVENT]++;                      // {54} set full-duplex event
        }
    }
    else {                                                               // link down    
        int_phy_message[MSG_INTERRUPT_EVENT] = LAN_LINK_DOWN;
    }
    fnWrite(INTERNAL_ROUTE, (unsigned char*)int_phy_message, HEADER_LENGTH); // inform the corresponding task on new link state
        #endif
    #elif defined _LAN8700
    if (usInterrupt & PHY_LAN8700_AUTO_NEG_COMPLETE) {                   // since auto-negotiation has just completed ensure that MAC settings are synchronised
        usInterrupt = fnReadMII_PHY(READ_STATE);                         // check the  details of link
        if (usInterrupt & SPEED_100M) {                                  // if at least 100 half duplex it indicates a 100MHz link
            SUPP = SUPP_SPEED;                                           // ensure EMAC is set to 100MHz mode
        #ifdef INTERRUPT_TASK_PHY
            int_phy_message[MSG_INTERRUPT_EVENT] = LAN_LINK_UP_100;
        #endif
        }
        else {
            SUPP = 0;                                                    // ensure EMAC is set to 10MHz mode
        #ifdef INTERRUPT_TASK_PHY
            int_phy_message[MSG_INTERRUPT_EVENT] = LAN_LINK_UP_10;
        #endif
        }
        if (usInterrupt & FULL_DUPLEX_FLAG) {                            // {31}
            IPGT  = FULL_DUPLEX_IPG_TIME;
            MAC2 |= MAC2_FULL_DUPLEX;
            EMAC_COMMAND |= EMAC_FULL_DUPLEX;
        #ifdef INTERRUPT_TASK_PHY
            int_phy_message[MSG_INTERRUPT_EVENT]++;                      // {54} set full-duplex event
        #endif
        }
        else {
            IPGT  = HALF_DUPLEX_IPG_TIME;
            MAC2 &= ~MAC2_FULL_DUPLEX;
            EMAC_COMMAND &= ~EMAC_FULL_DUPLEX;
        }
    }
        #if defined INTERRUPT_TASK_PHY                                   // PHY doesn't have a link up interrupt, apart from auto-neg
//  else if (LINK_UP_FLAG & usInterrupt) {                               // link up but not auto-negotiation complete
//      usInterrupt = fnReadMII_PHY(READ_STATE);                         // check the  details of link in order to signal the speed
//      if (usInterrupt & SPEED_100M) {                                  // if at least 100 half duplex it indicates a 100MHz link
//          int_phy_message[MSG_INTERRUPT_EVENT] = LAN_LINK_UP_100;
//      }
//      else {
//          int_phy_message[MSG_INTERRUPT_EVENT] = LAN_LINK_UP_10;
//      }
//  }
    else if (LINK_DOWN_FLAG & usInterrupt) {                             // link down
        int_phy_message[MSG_INTERRUPT_EVENT] = LAN_LINK_DOWN;
    }
    fnWrite(INTERNAL_ROUTE, (unsigned char*)int_phy_message, HEADER_LENGTH); // inform the corresponding task on new link state
        #endif
    #else
    if (LINK_UP_FLAG & usInterrupt) {                                    // link is now up
        usInterrupt = fnReadMII_PHY(READ_STATE);                         // check the  details of link
        if (usInterrupt & SPEED_100M) {                                  // if at least 100 half duplex it indicates a 100MHz link
            SUPP = SUPP_SPEED;                                           // ensure EMAC is set to 100MHz mode
        #ifdef INTERRUPT_TASK_PHY
            int_phy_message[MSG_INTERRUPT_EVENT] = LAN_LINK_UP_100;
        #endif
        }
        else {
            SUPP = 0;                                                    // ensure EMAC is set to 10MHz mode
        #ifdef INTERRUPT_TASK_PHY
            int_phy_message[MSG_INTERRUPT_EVENT] = LAN_LINK_UP_10;
        #endif
        }
        if (usInterrupt & FULL_DUPLEX_FLAG) {                            // {31}
            IPGT  = FULL_DUPLEX_IPG_TIME;
            MAC2 |= MAC2_FULL_DUPLEX;
            EMAC_COMMAND |= EMAC_FULL_DUPLEX;
        #ifdef INTERRUPT_TASK_PHY
            int_phy_message[MSG_INTERRUPT_EVENT]++;                      // {54} set full-duplex event
        #endif
        }
        else {
            IPGT  = HALF_DUPLEX_IPG_TIME;
            MAC2 &= ~MAC2_FULL_DUPLEX;
            EMAC_COMMAND &= ~EMAC_FULL_DUPLEX;
        }
    }
        #if defined INTERRUPT_TASK_PHY
    else {                                                               // link is now down
        int_phy_message[MSG_INTERRUPT_EVENT] = LAN_LINK_DOWN;
    }
    fnWrite(INTERNAL_ROUTE, (unsigned char*)int_phy_message, HEADER_LENGTH); // inform the corresponding task on new link state
        #endif
    #endif
}
#endif

#ifdef PHY_INTERRUPT
    #if PHY_INT_PORT == PORT_0                                           // it is assumed that the PHY input is only on port 0 or port 2 since these have interrupt capabilities
        #define PHY_INT_INPUT_PORT   FIO0PIN
    #else
        #define PHY_INT_INPUT_PORT   FIO2PIN
    #endif
static void fnPhyInterrupt(void)
{
    while (!(PHY_INT_INPUT_PORT & PHY_INT_PIN)) {                        // while the interrupt line remains low
        fnCheckEthLinkState();
    }
}
#endif

#ifdef USE_IPV6
// Configure a multicast address for IPV6 use
//
extern void fnConfigureMulticastIPV6(void)                               // {26}
{
    #define CRC_POLY 0xedb88320                                          // CRC-32 polynomial in reverse direction
    unsigned long ulCRC32 = 0xffffffff;                                  // set hash according to the multicast address 0x33 0x33 0xff XX XX XX (where XX XX XX are the last three bytes of the IPV6 IP address) as used by ND (neighbor discovery)
    int i, bit;
    unsigned char ucByte;
	for (i = 0; i < MAC_LENGTH; i++) {
        switch (i) {
        case 0:
        case 1:
            ucByte = 0x33;
            break;
        case 2:
            ucByte = 0xff;
            break;
        default:
            ucByte = ucLinkLocalIPv6Address[i + (IPV6_LENGTH - MAC_LENGTH)]; // {51}
		  //ucByte = network[DEFAULT_NETWORK].ucOurIPV6[i + (IPV6_LENGTH - MAC_LENGTH)];
            break;
        }
        for (bit = 0; bit < 8; bit++) {
            if ((ulCRC32 ^ ucByte) & 1) {
                ulCRC32 = (ulCRC32 >> 1) ^ CRC_POLY;
            }
            else {
                ulCRC32 >>= 1;
            }
            ucByte >>= 1;
        }
	}
    ulCRC32 >>= 26;                                                      // the upper 6 bits of the CRC32 detemine the hash entry location

