sWahlinRhoades/uTaskerModified/Hardware/LPC2XXX/LPC23XX.c
    if (ulCRC32 < 32) {
        EMAC_HashFilterL = (0x00000001 << ulCRC32);                      // enter single group hash entry
    }
    else {
        ulCRC32 -= 32;
        EMAC_HashFilterH = (0x00000001 << ulCRC32);
    }

}
#endif


// Memory allocation and alignment in LAN RAM block
//
static void *uMallocLAN_Align(unsigned short __size, unsigned char ucAlign)
{
    #ifdef _WINDOWS
    static unsigned char ucLAN_Memory[ETHERNET_RAM_SIZE];
    static unsigned char *pucBottomOfHeap = ucLAN_Memory;
    static unsigned char *pucTopOfHeap = (ucLAN_Memory + ETHERNET_RAM_SIZE);
    #else
    static unsigned char *pucBottomOfHeap = (unsigned char *)(ETHERNET_RAM_START_ADDRESS);
    static unsigned char *pucTopOfHeap = (unsigned char *)(ETHERNET_RAM_START_ADDRESS + ETHERNET_RAM_SIZE);
    #endif
    static unsigned short present_HeapSize = 0;

    unsigned char *ptr = pucBottomOfHeap + present_HeapSize;
    if ((unsigned long)ptr & (ucAlign-1)) {                              // ensure all memory is aligned on specified byte boundary
        ptr = (unsigned char *)((unsigned long)ptr & ~(ucAlign-1));
        ptr += ucAlign;
    }

    if ((ptr + __size) >= pucTopOfHeap) {
    #ifdef _WINDOWS
        *(int *)0 = 0;                                                   // generate exception so that the problem can be immediately seen an dcured
    #endif
        return 0;                                                        // no more room in Ethernet RAM space
    }

    uMemset(ptr, 0, __size);                                             // ensure new memory chunk is always zeroed

    present_HeapSize = (ptr - pucBottomOfHeap) + __size;
    return ((void *)ptr);
}


// Ethernet configuration routine
//
extern int fnConfigEthernet(ETHTABLE *pars)                              // {47}
{
#ifdef PHY_INTERRUPT
    INTERRUPT_SETUP interrupt_setup;                                     // interrupt configuration parameters
#endif
    unsigned long ulPhyIdentifier;
    unsigned short usMIIData;
    volatile int i;
    LPC23XX_RX_BD *ptrBd;
    unsigned char *ptrBuffer;

/********************************* Check and configure PHY **********************************************/
#ifdef RESET_PHY
    DEASSERT_PHY_RST();                                                  // allow PHY to run and latch in its boot strap options
#endif

    POWER_UP(PCENET);                                                    // {10} enable power to Ethernet controller
    MCFG = (RESET_MMI_MGMT | HOST_CLK_DIV_28);                           // {32} reset the MII management interface to disable clock
#ifdef _LPC24XX
    PINSEL2 |= (PINSEL2_P1_0_ENET_TXD0 | PINSEL2_P1_1_ENET_TXD0 | PINSEL2_P1_4_ENET_TX_EN | PINSEL2_P1_8_ENET_CRS | PINSEL2_P1_9_ENET_RXD0 | PINSEL2_P1_10_ENET_RXD1 | PINSEL2_P1_14_ENET_RX_ER | PINSEL2_P1_15_ENET_REF_CLK);
#else
    if (EMAC_MODULE_ID == OLD_MAC_MODULE_ID) {                           // if original silicon the RMII mode must be set with ETH_TX:CLK
        PINSEL2 |= (PINSEL2_P1_6_ENET_TX_CLK | PINSEL2_P1_0_ENET_TXD0 | PINSEL2_P1_1_ENET_TXD0 | PINSEL2_P1_4_ENET_TX_EN | PINSEL2_P1_8_ENET_CRS | PINSEL2_P1_9_ENET_RXD0 | PINSEL2_P1_10_ENET_RXD1 | PINSEL2_P1_14_ENET_RX_ER | PINSEL2_P1_15_ENET_REF_CLK);
    }
    else {                                                               // if newer silicon it may NOT be set
        PINSEL2 &= ~(PINSEL2_P1_6_ENET_TX_CLK);                          // ensure disabled
        PINSEL2 |= (PINSEL2_P1_0_ENET_TXD0 | PINSEL2_P1_1_ENET_TXD0 | PINSEL2_P1_4_ENET_TX_EN | PINSEL2_P1_8_ENET_CRS | PINSEL2_P1_9_ENET_RXD0 | PINSEL2_P1_10_ENET_RXD1 | PINSEL2_P1_14_ENET_RX_ER | PINSEL2_P1_15_ENET_REF_CLK);
    }
#endif
    PINSEL3 |= (PINSEL3_P1_16_ENET_MDC | PINSEL3_P1_17_ENET_MDIO);       // configure RMII pins

    MAC1     = (SOFT_RESET | SIMULATION_RESET | RESET_TX | RESET_MCS_TX | RESET_RX | RESET_MCS_RX);
    i = 10;
    while (i--) {}                                                       // short delay for reset to complete
    MAC1     = PASS_ALL_RECEIVE_FRAMES;                                  // remove  soft resets
    MAC2     = (CRC_ENABLE | PAD_CRC_ENABLE);
    MAXF     = 1536;                                                     // maximum Ethernet frame length
    IPGT     = IPGR_TIME;
    CLRT     = DEFAULT_CLRT;
    SUPP     = RESET_RMII;                                               // reset RMII logic
    SUPP     = SUPP_SPEED;                                               // set RMII speed for 100MHz operation
  //MCFG     = HOST_CLK_DIV_28;                                          // {32} configure 2.5MHz MDIO clock
    EMAC_COMMAND = (EMAC_RMII | EMAC_PASS_RUNT_FRAME);                   // enable RMII

    fnWriteMII_PHY(GENERIC_BASIC_CONTROL_REGISTER, PHY_SOFTWARE_RESET);  // command a software reset of PHY
    i = 1000000;
    while (fnReadMII_PHY(GENERIC_BASIC_CONTROL_REGISTER) & PHY_SOFTWARE_RESET) {// wait until reset completed
        if (--i == 0) {                                                  // quit if no response
            return -1;
        }
    }

    ulPhyIdentifier = fnReadMII_PHY(GENERIC_PHY_IDENTIFIER_1);           // check that the PHY is working correctly by reading its identifier
    ulPhyIdentifier <<= 16;
    ulPhyIdentifier |= fnReadMII_PHY(GENERIC_PHY_IDENTIFIER_2);          // check that the PHY is working correctly by reading its identifier

    if ((ulPhyIdentifier & PHY_MASK) != (PHY_IDENTIFIER & PHY_MASK)) {   // {1}
        return -1;                                                       // if the identifier is incorrect the phy isn't responding correctly
    }

    usMIIData = 0;                                                       // configure the mode which we could like to use
    if (pars->usMode & (LAN_10M | LAN_100M)) {                           // fixed speed setting
        if (pars->usMode & LAN_100M)  {
            usMIIData |= PHY_SELECT_100M_SPEED;
        }
        else {
            SUPP = 0;                                                    // 10MHz
        }
        if (pars->usMode & FULL_DUPLEX) {                                // {31}
            usMIIData |= PHY_FULL_DUPLEX_MODE;
            IPGT = FULL_DUPLEX_IPG_TIME;
            MAC2 |= MAC2_FULL_DUPLEX;
            EMAC_COMMAND |= EMAC_FULL_DUPLEX;
        }
        else {
            IPGT = HALF_DUPLEX_IPG_TIME;
        }
    }
    else {
        usMIIData |= (PHY_ENABLE_AUTO_NEGOTIATION | PHY_RESTART_AUTO_NEGOTIATION);
    }

    if (pars->usMode & LOOPBACK) {
        usMIIData |= PHY_LOOP_BACK;                                      // test loop back at PHY
      //MAC1 |= (MAC1_LOOPBACK);                                         // test loop back at MII
    }

    fnWriteMII_PHY(GENERIC_BASIC_CONTROL_REGISTER, usMIIData);           // write the PHY operating mode

    /******************************* MAC buffer descriptor configuration ****************************************/

    i = LAN_RX_BUF_COUNT;                                                // set up receiver buffer memory
    EMAC_RxDescriptorNumber = (LAN_RX_BUF_COUNT - 1);
    ptrBuffer = uMallocLAN_Align((unsigned short)(LAN_RX_BUF_COUNT * pars->usSizeRx), 4); // allocate a receive buffer pool in the LAN RAM
    EMAC_RxStatus = (unsigned long)uMallocLAN_Align((unsigned short)(sizeof(LPC23XX_RX_STATUS)*i), 8); // create a smaller pool of buffer descriptors
    ptrBd = uMallocLAN_Align((MAX_MALLOC)(sizeof(LPC23XX_RX_BD)*i), 4);  // create a smaller pool of buffer descriptors
    EMAC_RxDescriptor = (unsigned long)ptrBd;                            // address of the first descriptor
    while (i--) {                                                        // initialise the buffer descriptors
        ptrBd->ptrBlock = ptrBuffer;
        ptrBd->bd_details = (RX_LAN_INTERRUPT_ON_DONE | (pars->usSizeRx - 1));
        ptrBuffer += pars->usSizeRx;
        ptrBd++;
    }
    EMAC_RxConsumeIndex = EMAC_RxProduceIndex;

    i = LAN_TX_BUF_COUNT;                                                // set up transmitter buffer memory
    EMAC_TxDescriptorNumber = (LAN_TX_BUF_COUNT - 1);
    ptrBuffer = uMallocLAN_Align((unsigned short)(LAN_TX_BUF_COUNT * pars->usSizeTx), 4);// allocate a transmitter buffer pool
    EMAC_TxStatus = (unsigned long)uMallocLAN_Align((unsigned short)(sizeof(LPC23XX_TX_STATUS)*i), 4);    // create a smaller pool of buffer descriptors
    ptrBd = uMallocLAN_Align((unsigned short)(sizeof(LPC23XX_RX_BD)*i), 4);// create a smaller pool of buffer descriptors

    EMAC_TxDescriptor = (unsigned long)ptrBd;                            // inform the MAC where the first transmit buffer is located
    while (i--) {                                                        // initialise the buffer descriptors
        ptrBd->ptrBlock = ptrBuffer;                                     // initialise the buffer descriptors
        ptrBuffer += pars->usSizeTx;
        ptrBd++;
    }
    EMAC_TxProduceIndex = EMAC_TxConsumeIndex;

#if defined USE_IPV6                                                     // {26}
    SA0 = ((network[DEFAULT_NETWORK].ucOurMAC[5] << 8) | network[DEFAULT_NETWORK].ucOurMAC[4]); // set the unicast MAC address
    SA1 = ((network[DEFAULT_NETWORK].ucOurMAC[3] << 8) | network[DEFAULT_NETWORK].ucOurMAC[2]);
    SA2 = ((network[DEFAULT_NETWORK].ucOurMAC[1] << 8) | network[DEFAULT_NETWORK].ucOurMAC[0]);
#else
    SA0 = ((pars->ucMAC[5] << 8) | pars->ucMAC[4]);                      // set the MAC address
    SA1 = ((pars->ucMAC[3] << 8) | pars->ucMAC[2]);
    SA2 = ((pars->ucMAC[1] << 8) | pars->ucMAC[0]);
#endif

    if (pars->usMode & PROMISCUOUS) {
        EMAC_RxFilterControl = (ENABLE_ACCEPT_UNICAST | ENABLE_ACCEPT_BROADCAST | ENABLE_ACCEPT_MULTICAST);
    }
    else {
        if (pars->usMode & NO_BROADCAST) {
            EMAC_RxFilterControl = (ENABLE_ACCEPT_PERFECT);              // do not accept broadcast frames
        }
        else {
            EMAC_RxFilterControl = (ENABLE_ACCEPT_PERFECT | ENABLE_ACCEPT_BROADCAST);
        }
#ifdef USE_IPV6
        if (pars->usMode & CON_MULTICAST) {                              // {26} if multicast reception is to be configured
            fnConfigureMulticastIPV6();                                  // set IPV6 multicast address
            EMAC_RxFilterControl |= ENABLE_ACCEPT_MULTICAST_HASH;        // enable multicast hash acceptance
        }
#endif
    }

