sWahlinRhoades/uTaskerModified/Hardware/LPC2XXX/LPC23XX.c
    EMAC_IntClear = 0xffffffff;                                          // clear all possibly waiting interrupts
    fnSetIntHandler(INTERRUPT_ETHERNET, ETHERNET_INTERRUPT_PRIORITY, (unsigned long)EMAC_Interrupt); // configure and enter the handling interrupt routine in the vector table
    EMAC_IntEnable = (EMAC_RxOverrunInt | EMAC_RxErrorInt | EMAC_RxFinishedInt | EMAC_RxDoneInt);    // enable interrupts to be handled
    EMAC_COMMAND |= (EMAC_RX_ENABLE | EMAC_TX_ENABLE);                   // enable transmit and receive DMA engines in RMII mode
    MAC1 |= (RECEIVE_ENABLE);                                            // enable receiver data path

#ifdef PHY_INTERRUPT                                                     // if PHY interrupt line is connected use it to detect link state changes and control auto-negotiated speed
    interrupt_setup.int_type = PORT_INTERRUPT;                           // identifier when configuring
    interrupt_setup.int_handler = fnPhyInterrupt;                        // handling function
    interrupt_setup.int_port = PHY_INT_PORT;                             // the port used
    interrupt_setup.int_priority = PHY_INT_PRIORITY;                     // port interrupt priority
    interrupt_setup.int_port_bits = PHY_INT_PIN;                         // the input connected
    interrupt_setup.int_port_sense = (IRQ_FALLING_EDGE);                 // interrupt on this edge
    fnConfigureInterrupt(&interrupt_setup);                              // configure test interrupt

    #if defined _LAN8700
    fnWriteMII_PHY(LAN8700_INTERRUPT_MASK, (PHY_LAN8700_LINK_DOWN | PHY_LAN8700_AUTO_NEG_COMPLETE)); // enable interrupts on link state changes
    #elif defined _DP83848                                               // {30}
    fnWriteMII_PHY(DP83848_MII_INTERRUPT_STATUS_REGISTER,  (DP83848_LINK_INT_EN | DP83848_ANC_INT_EN)); // enable link status change and auto-negotiation complete interrupts
    fnWriteMII_PHY(DP83848_MII_INTERRUPT_CONTROL_REGISTER, (DP83848_INT_OE | DP83848_INT_EN)); // enable interrupt output to trigger processor interrupt input
    #else
    fnWriteMII_PHY(KS8721_INTERRUPT_CONTROL_STATUS_REGISTER,             // enable various PHY interrupts
//             PHY_REMOTE_FAULT_INT_ENABLE
//             PHY_LINK_PARTNER_ACK_INT_ENABLE
//             PHY_PARALLEL_DETECT_FAULT_INT_ENABLE
//             PHY_PAGE_RECEIVED_INT_ENABLE
//             PHY_RECEIVE_ERROR_INT_ENABLE
//             PHY_JABBER_INT_ENABLE
              (PHY_LINK_UP_INT_ENABLE | PHY_LINK_DOWN_INT_ENABLE)
    );
    #endif
#endif
#ifdef _WINDOWS
    fnOpenDefaultHostAdapter();
#endif
    return 0;
}

#ifdef _WINDOWS

    #ifdef USE_IPV6
static int fnIsHashMulticast(unsigned char *ucData)                      // {26}
{
    unsigned long ulCRC32 = 0xffffffff;                                  // set hash according to the multicast address 0x33 0x33 0xff XX XX XX (where XX XX XX are the last three bytes of the IPV6 IP address) as used by ND (neighbor discovery)
    int i, bit;
    unsigned char ucByte;
    if (!(EMAC_RxFilterControl & ENABLE_ACCEPT_MULTICAST_HASH)) {        // {52} multicast hash not enabled
        return 0;
    }
    if (!(*ucData & 0x01)) {                                             // if not multicast, don't check
        return 0;
    }
	for (i = 0; i < MAC_LENGTH; i++) {
        ucByte = *ucData++;;
        for (bit = 0; bit < 8; bit++) {
            if ((ulCRC32 ^ ucByte) & 1) {
                ulCRC32 = (ulCRC32 >> 1) ^ CRC_POLY;
            }
            else {
                ulCRC32 >>= 1;
            }
            ucByte >>= 1;
        }
	}
    ulCRC32 >>= 26;                                                      // the upper 6 bits of the CRC32 detemine the hash entry location

    if (ulCRC32 < 32) {
        if (EMAC_HashFilterL & (0x00000001 << ulCRC32)) {
            return 1;                                                    // multicast hash match
        }
    }
    else {
        ulCRC32 -= 32;
        if (EMAC_HashFilterH & (0x00000001 << ulCRC32)) {
            return 1;                                                    // multicast hash match
        }
    }
    return 0;                                                            // not a match
}
    #endif

    // This routine is supplied to aid the simulator. It checks whether Ethereal frames should be accepted based
    // on the programmed MAC address and the Ethernet operating mode
    //
    extern int fnCheckEthernetMode(unsigned char *ucData, unsigned short usLen)
    {
        unsigned char ucProgrammedMAC[MAC_LENGTH];

        if (!(MAC1 & RECEIVE_ENABLE) || (!(EMAC_COMMAND & EMAC_RX_ENABLE))) {
            return 0;                                                    // Ethernet interface not receiving
        }
      
        if (usLen < (2*MAC_LENGTH + 2)) {
            return 0;                                                    // too short to be a valid Ethernet frame
        }

        if ((EMAC_RxFilterControl & ENABLE_ACCEPT_BROADCAST) && (!(uMemcmp(ucData, cucBroadcast, MAC_LENGTH)))) {
            return 1;                                                    // broadcast
        }

        ucProgrammedMAC[0] = (unsigned char)(SA2);
        ucProgrammedMAC[1] = (unsigned char)(SA2 >> 8);
        ucProgrammedMAC[2] = (unsigned char)(SA1);
        ucProgrammedMAC[3] = (unsigned char)(SA1 >> 8);
        ucProgrammedMAC[4] = (unsigned char)(SA0);
        ucProgrammedMAC[5] = (unsigned char)(SA0 >> 8);

        if ((EMAC_RxFilterControl & ENABLE_ACCEPT_PERFECT) && (!(uMemcmp(ucData, ucProgrammedMAC, MAC_LENGTH)))) {
            return 2;                                                    // our MAC
        }

        if (!uMemcmp(&ucData[MAC_LENGTH], ucProgrammedMAC, MAC_LENGTH)) {
            return 0;                                                    // we never accept echos of our own transmissions
        }

        if ((EMAC_RxFilterControl & (ENABLE_ACCEPT_UNICAST | ENABLE_ACCEPT_BROADCAST | ENABLE_ACCEPT_MULTICAST)) == (ENABLE_ACCEPT_UNICAST | ENABLE_ACCEPT_BROADCAST | ENABLE_ACCEPT_MULTICAST)) {
            return 3;                                                    // in promiscuous mode we accept everything
        }
    #ifdef USE_IPV6                                                      // {26}
        if (fnIsHashMulticast(&ucData[0])) {
            return 4;                                                    // multicast hash match
        }
    #endif
        return 0;                                                        // no match so reject
    }
#endif

// This can be called by the Ethernet driver to wait a short time for the transmit buffer to become free
//
extern int fnWaitTxFree(void)
{
    unsigned long ulConsumeCheck;
    unsigned long ulConsumeIndex = EMAC_TxConsumeIndex;                  // snap shot of consume index
    if (ulConsumeIndex == 0) {
        ulConsumeCheck = EMAC_TxDescriptorNumber;
    }
    else {
        ulConsumeCheck = (ulConsumeIndex - 1);
    }

