sWahlinRhoades/uTaskerModified/Hardware/LPC2XXX/LPC23XX.c
    if (EMAC_TxProduceIndex == ulConsumeCheck) {
        volatile int iMaxWait = 1500;
        while (EMAC_TxConsumeIndex == ulConsumeIndex) {
            if (!(--iMaxWait)) {
                return 1;                                                // abort because we have waited too long
            }
        }
    }
    return 0;                                                            // OK - buffer free
}

// This can be called by the ethernet driver to find out how many receive buffers the Ethernet Controller has
//
extern int fnGetQuantityRxBuf(void)
{
    return 1;          // LAN_RX_BUF_COUNT;       // the LPC23XX driver doesn't need to know
}

// This can be called by the ethernet driver to get the address of the corresponding Ethernet receive buffer
//
extern unsigned char *fnGetRxBufferAdd(int iBufNr)
{
    return 0;                                                            // for compatibility - the LPC23XX uses buffer descriptors for tracking buffers
}

// This can be called by the ethernet driver to get the address of the corresponding Ethernet transmit buffer
//
extern unsigned char *fnGetTxBufferAdd(int iBufNr)
{
    LPC23XX_RX_BD *ptrBd = (LPC23XX_RX_BD *)EMAC_TxDescriptor;
    ptrBd += EMAC_TxProduceIndex;

    return (unsigned char *)ptrBd->ptrBlock;                             // return pointer to bd which is to be used next
}

// This can be called by the ethernet driver to free an Ethernet receive buffer after it has been used
//
extern void fnFreeEthernetBuffer(int iBufNr)
{
    register unsigned long ulConsume = EMAC_RxConsumeIndex;
    if (ulConsume >= EMAC_RxDescriptorNumber) {
        ulConsume = 0;
    }
    else {
        ulConsume++;
    }
    EMAC_RxConsumeIndex = ulConsume;
}

// Data has been prepared, now send it over the ETHERNET interface
//
extern QUEUE_TRANSFER fnStartEthTx(QUEUE_TRANSFER DataLen, unsigned char *ptr_put)
{
    #ifdef LAN_REPORT_ACTIVITY
    const unsigned char tx_act_message[ HEADER_LENGTH ] = { 0, 0, INTERRUPT_TASK_LAN_EXCEPTIONS, INTERRUPT_EVENT, EMAC_TX_INTERRUPT };
    #endif
    LPC23XX_RX_BD *ptrBd = (LPC23XX_RX_BD *)EMAC_TxDescriptor;
    ptrBd += EMAC_TxProduceIndex;
    ptrBd->bd_details = (TX_LAN_INTERRUPT_ON_DONE | TX_LAST_FRAG | TX_APPEND_CRC | TX_PAD_FRAME | (DataLen - 1)); // {18}

    #ifdef _WINDOWS                                                      // LPC23XX performs zero automatic zero padding due to flag above
    while (DataLen < 60) {                                               // when simulating,
        *ptr_put++ = 0x00;                                               // pad with zeros if smaller than 60 [chip must send at least 60]
        DataLen++;
    }

    fnSimulateEthTx((QUEUE_TRANSFER)((ptrBd->bd_details & RX_LAN_SIZE_MASK) + 1));

    if (usPhyMode & PHY_LOOP_BACK) {                                     // if the PHY is in loop back mode, simulate reception of sent frame
        fnSimulateEthernetIn((ptr_put - DataLen), DataLen, 1);
    }
    if (EMAC_TxConsumeIndex >= EMAC_TxDescriptorNumber) {
        EMAC_TxConsumeIndex = 0;
    }
    else {
        ++(EMAC_TxConsumeIndex);
    }
    #endif
    if (EMAC_TxProduceIndex >= EMAC_TxDescriptorNumber) {                // hand over descriptor to hardware by incrementing the produce index
        EMAC_TxProduceIndex = 0;
    }
    else {
        ++(EMAC_TxProduceIndex);
    }
    eth_tx_control->ETH_queue.chars = 0;                                 // reset the transmission buffer for next use
    eth_tx_control->ETH_queue.put = eth_tx_control->ETH_queue.QUEbuffer;
    #ifdef LAN_REPORT_ACTIVITY
    fnWrite(INTERNAL_ROUTE, (unsigned char*)tx_act_message, HEADER_LENGTH); // inform the task of event
    #endif
    return (DataLen);
}

#endif                                                                   // endif ETH_INTERFACE



#ifdef SERIAL_INTERFACE
/* =================================================================== */
/*                    Serial Interface - UART                          */
/* =================================================================== */
    #ifdef _WINDOWS
    extern unsigned char ucTxLast[NUMBER_SERIAL] = {0};
    #endif


// Collect a pointer to defined UART control block
//
static LPC23XX_UART_CONTROL *fnSelectChannel(QUEUE_HANDLE Channel)
{
    switch (Channel) {
    case 0:
        return (LPC23XX_UART_CONTROL *)UART_BLOCK_0;
    case 1:
        return (LPC23XX_UART_CONTROL *)UART_BLOCK_1;
    #ifndef _LPC21XX
    case 2:
        return (LPC23XX_UART_CONTROL *)UART_BLOCK_2;
    case 3:
        return (LPC23XX_UART_CONTROL *)UART_BLOCK_3;
    #endif
    }
    return 0;                                                            // invalid
}


// Configure the SCI hardware
//
// NOTE: the default UART clock is PCLK/4. This doesn't always allow accurate 115k Baud to be achieved.
// The following is an example of a modification to allow higher accuracy using PCLK/1. The define
// #define UART_CLOCK       (PCLK/4) need to be changed to
// #define UART_CLOCK       (PCLK/1)
/*
    switch (Channel) {
    case 0:
        PCLKSEL0 |= PCLK_UART0_CCLK_1;  // set UART0 clock to PCLK rather than PCLK/4
        ...
        break;
    case 1:
        PCLKSEL0 |= PCLK_UART1_CCLK_1;  // set UART1 clock to PCLK rather than PCLK/4
        ...
        break;
    case 2:
        PCLKSEL1 |= PCLK_UART2_CCLK_1;  // set UART2 clock to PCLK rather than PCLK/4
        ...
        break;
    case 3:
        PCLKSEL1 |= PCLK_UART3_CCLK_1;  // set UART3 clock to PCLK rather than PCLK/4
        ...
        break;
*/

extern void fnConfigSCI(QUEUE_HANDLE Channel, TTYTABLE *pars)
{
    LPC23XX_UART_CONTROL *uart_reg = fnSelectChannel(Channel);
    unsigned short usDivider;

    switch (Channel) {
    case 0:
        POWER_UP(PCUART0);                                               // {10} power up the UART
    #ifdef UART_CLOCK_SET                                                // {40} if the user wishes to override the clock
        #if UART_CLOCK_SET == PCLK
        PCLKSEL0 |= PCLK_UART0_CCLK_1;                                   // set the alternative rate
        #undef UART_CLOCK
            #define UART_CLOCK UART_CLOCK_SET                            // new define for baud rate calculation
        #endif
    #endif
    #ifdef _LPC21XX
        PINSEL0 |= (PINSEL0_P0_0_TXD0 | PINSEL0_P0_1_RXD0);              // TXD0 and RXD0 on P0.0 and P0.1
    #else
        PINSEL0 |= (PINSEL0_P0_2_TXD0 | PINSEL0_P0_3_RXD0);              // TXD0 and RXD0 on P0.2 and P0.3
    #endif
        break;
    case 1:
        POWER_UP(PCUART1);                                               // {10} power up the UART
    #ifdef _LPC21XX
        PINSEL0 |= (PINSEL0_P0_8_TXD1 | PINSEL0_P0_9_RXD1);              // TXD1 and RXD1 on P0.8 and P0.9
    #else
        #ifdef UART1_PORT2
        PINSEL4 |= (PINSEL4_P2_0_TXD1 | PINSEL4_P2_1_RXD1);              // TXD1 and RXD1 on P2.0 and P2.1
        #else
        PINSEL0 |= (PINSEL0_P0_15_TXD1);                                 // TXD1 on P0.15
        PINSEL1 |= (PINSEL1_P0_16_RXD1);                                 // RXD1 on P0.16
        #endif
    #endif
        break;
    #ifndef _LPC21XX
    case 2:
        POWER_UP(PCUART2);                                               // {10} power up the UART
        #ifdef UART2_PORT2
        PINSEL4 |= (PINSEL4_P2_8_TXD2 | PINSEL4_P2_9_RXD2);              // TXD2 and RXD2 on P2.8 and P2.9
        #else
        PINSEL0 |= (PINSEL0_P0_10_TXD2 | PINSEL0_P0_11_RXD2);            // TXD2 and RXD2 on P0.10 and P0.11
        #endif
        break;
    case 3:
        POWER_UP(PCUART3);                                               // {10} power up the UART
        #if defined UART3_PORT0_HIGH
        PINSEL1 |= (PINSEL1_P0_25_TXD3 | PINSEL1_P0_26_RXD3);            // TXD3 and RXD3 on P0.25 and P0.26
        #elif defined _LPC24XX && defined UART3_PORT4                    // {17}
        PINSEL9 |= (PINSEL9_P4_28_TXD3 | PINSEL9_P4_29_RXD3);            // TXD2 and RXD2 on P4.28 and P4.29
        #else
        PINSEL0 |= (PINSEL0_P0_0_TXD3 | PINSEL0_P0_1_RXD3);              // TXD3 and RXD3 on P0.0 and P0.1
        #endif
        break;
    #endif
    default:
        return;
    }

    #ifdef SUPPORT_HW_FLOW                                               // {6}
    if (pars->Config & RTS_CTS) {                                      // HW flow control defined so configure RTS/CTS pins
        fnControlLine(Channel, (CONFIG_RTS_PIN | CONFIG_CTS_PIN), 0);
    }
    #endif

