sWahlinRhoades/uTaskerModified/Hardware/LPC2XXX/LPC23XX.c
    uart_reg->IIR_FCR = FIFO_ENABLE;                                     // set the FIFO enable bit in the FCR register. This bit must be set for proper UART operation
    uart_reg->IIR_FCR = (FIFO_ENABLE | RX_FIFO_RESET | TX_FIFO_RESET | RX_TRIGGER_1_CHAR); // ensure FIFOs reset when starting
    uart_reg->LCR = DLAB;                                                // set access to divisor latch registers

    switch (pars->ucSpeed) {
    case SERIAL_BAUD_300:
        usDivider = ((UART_CLOCK/16 + 300/2)/300);                       // set 300
        break;
    case SERIAL_BAUD_600:
        usDivider = ((UART_CLOCK/16 + 600/2)/600);                       // set 600
        break;
    case SERIAL_BAUD_1200:
        usDivider = ((UART_CLOCK/4 + 1200/2)/1200);                      // set 1200
        break;
    case SERIAL_BAUD_2400:
        usDivider = ((UART_CLOCK/16 + 2400/2)/2400);                     // set 2400
        break;
    case SERIAL_BAUD_4800:
        usDivider = ((UART_CLOCK/16 + 4800/2)/4800);                     // set 4800
        break;
    case SERIAL_BAUD_9600:
        usDivider = ((UART_CLOCK/16 + 9600/2)/9600);                     // set 9600
        break;
    case SERIAL_BAUD_14400:
        usDivider = ((UART_CLOCK/16 + 14400/2)/14400);                   // set 14400
        break;
    default:                                                             // if not valid value set this speed
    case SERIAL_BAUD_19200:
        usDivider = ((UART_CLOCK/16 + 19200/2)/19200);                   // set 19200
        break;
    case SERIAL_BAUD_38400:
        usDivider = ((UART_CLOCK/16 + 38400/2)/38400);                   // set 38400
        break;
    case SERIAL_BAUD_57600:
        usDivider = ((UART_CLOCK/16 + 57600/2)/57600);                   // set 57600
        break;
    case SERIAL_BAUD_115200:
        usDivider = ((UART_CLOCK/16 + 115200/2)/115200);                 // set 115200
        break;
    case SERIAL_BAUD_230400:
        usDivider = ((UART_CLOCK/16 + 230400/2)/230400);                 // set 230400
        break;
    }
    uart_reg->RBR_THR_DLL = (unsigned char)usDivider;                    // program speed to divisor latch registers
    uart_reg->DLM_IER = (unsigned char)(usDivider >> 8);

    if (pars->Config & (RS232_ODD_PARITY | RS232_EVEN_PARITY)) {
        if (pars->Config & RS232_ODD_PARITY) {
            uart_reg->LCR = (UART_PARITY_ENABLE | UART_PARITY_ODD);      // program odd parity
        }
        else {
            uart_reg->LCR = (UART_PARITY_ENABLE | UART_PARITY_EVEN);     // program even parity
        }
    }
    else {
        uart_reg->LCR = UART_PARITY_DISABLED;                            // no parity
    }

    if (pars->Config & TWO_STOPS) {
        uart_reg->LCR |= UART_2_STOP_BITS;                               // set 2 stop bits rather than 1 stop bit
    }

    if (pars->Config & CHAR_7) {
        uart_reg->LCR |= UART_7_BIT_CHAR;                                // set 7 bit characters
    }
    else {
        uart_reg->LCR |= UART_8_BIT_CHAR;                                // set 8 bit characters
    }

    #ifdef _WINDOWS
    uart_reg->IIR_FCR &= ~(TX_FIFO_RESET | RX_FIFO_RESET);
    fnConfigSimSCI(Channel, UART_CLOCK/((unsigned short)((uart_reg->DLM_IER << 8) | uart_reg->RBR_THR_DLL)*16), pars); // open a serial port on PC if desired
    #endif
}

/**************************** SCI0 interrupt ******************************************/

static __interrupt void SCI0_Interrupt(void)
{
    volatile unsigned long ulStatus;

    iInterruptLevel = 1;                                                 // ensure interrupts remain blocked when putting message to queue

    while (((ulStatus = U0IIR) & UART_NO_INT_PENDING) == 0) {            // while interrupts pending
        switch (ulStatus & UART_INT_MASK) {                              // get the interrupt type
        case UART_RLS_INT_PENDING:                                       // line stats change or error
            ulStatus = U0LSR;                                            // read the status - clearing interrupt source
            if (ulStatus & (UART_OE | UART_PE | UART_FE)) {              // error
                break;
            }
            if (ulStatus & UART_BI) {
                // break condition change active
            }
            else {
                // break condition changed inactive
            }
            break;

        case UART_RDA_INT_PENDING:                                       // reception
        case UART_CTI_INT_PENDING:                                       // reception with timeout due to no read
            fnSciRxByte((unsigned char)U0RBR_THR, 0);                    // receive data interrupt - read the byte (clearing the interrupt)
            break;

        case UART_THRE_INT_PENDING:                                      // transmission interrupt (read of IIR will have cleared the interrupt)
    #ifdef _WINDOWS
            U0LSR |= UART_THRE;                                          // mark transmitter empty again
    #endif
            fnSciTxByte(0);                                              // transmit data empty interrupt - write next byte
            break;
        }
    #ifdef _WINDOWS
        U0IIR &= ~(UART_INT_MASK);
        U0IIR |= UART_NO_INT_PENDING;
        U0LSR &= ~(UART_RDR | UART_OE | UART_PE | UART_FE | UART_BI | UART_RXFE);
    #endif
    }
    iInterruptLevel = 0;                                                 // release
    acknowledge_irq();                                                   // required on exit of all irqs
}

/**************************** SCI1 interrupt ******************************************/

static __interrupt void SCI1_Interrupt(void)
{
    volatile unsigned long ulStatus;

    iInterruptLevel = 1;                                                 // ensure interrupts remain blocked when putting message to queue

    while (((ulStatus = U1IIR) & UART_NO_INT_PENDING) == 0) {            // while interrupts pending
        switch (ulStatus & UART_INT_MASK) {                              // get the interrupt type
        case UART_RLS_INT_PENDING:                                       // line stats change or error
            ulStatus = U1LSR;                                            // read the status - clearing interrupt source
            if (ulStatus & (UART_OE | UART_PE | UART_FE)) {              // error
                break;
            }
            if (ulStatus & UART_BI) {
                // break condition change active
            }
            else {
                // break condition changed inactive
            }
            break;

        case UART_RDA_INT_PENDING:                                       // reception
        case UART_CTI_INT_PENDING:                                       // reception with timeout due to no read
            fnSciRxByte((unsigned char)U1RBR_THR, 1);                    // receive data interrupt - read the byte (clearing the interrupt)
            break;

        case UART_THRE_INT_PENDING:                                      // transmission interrupt (read of IIR will have cleared the interrupt)
    #ifdef _WINDOWS
            U1LSR |= UART_THRE;                                          // mark transmitter empty again
    #endif
            fnSciTxByte(1);                                              // transmit data empty interrupt - write next byte
            break;
        }
    #ifdef _WINDOWS
        U1IIR &= ~(UART_INT_MASK);
        U1IIR |= UART_NO_INT_PENDING;
        U1LSR &= ~(UART_RDR | UART_OE | UART_PE | UART_FE | UART_BI | UART_RXFE);
    #endif
    }
    iInterruptLevel = 0;                                                 // release
    acknowledge_irq();                                                   // required on exit of all irqs
}


