sWahlinRhoades/uTaskerModified/Hardware/LPC2XXX/LPC23XX.c
    #ifndef _LPC21XX
/**************************** SCI2 interrupt ******************************************/

static __interrupt void SCI2_Interrupt(void)
{
    volatile unsigned long ulStatus;

    iInterruptLevel = 1;                                                 // ensure interrupts remain blocked when putting message to queue

    while (((ulStatus = U2IIR) & UART_NO_INT_PENDING) == 0) {            // while interrupts pending
        switch (ulStatus & UART_INT_MASK) {                              // get the interrupt type
        case UART_RLS_INT_PENDING:                                       // line stats change or error
            ulStatus = U2LSR;                                            // read the status - clearing interrupt source
            if (ulStatus & (UART_OE | UART_PE | UART_FE)) {              // error
                break;
            }
            if (ulStatus & UART_BI) {
                // break condition change active
            }
            else {
                // break condition changed inactive
            }
            break;

        case UART_RDA_INT_PENDING:                                       // reception
        case UART_CTI_INT_PENDING:                                       // reception with timeout due to no read
            fnSciRxByte((unsigned char)U2RBR_THR, 2);                    // receive data interrupt - read the byte (clearing the interrupt)
            break;

        case UART_THRE_INT_PENDING:                                      // transmission interrupt (read of IIR will have cleared the interrupt)
        #ifdef _WINDOWS
            U2LSR |= UART_THRE;                                          // mark transmitter empty again
        #endif
            fnSciTxByte(2);                                              // transmit data empty interrupt - write next byte
            break;
        }
        #ifdef _WINDOWS
        U2IIR &= ~(UART_INT_MASK);
        U2IIR |= UART_NO_INT_PENDING;
        U2LSR &= ~(UART_RDR | UART_OE | UART_PE | UART_FE | UART_BI | UART_RXFE);
        #endif
    }
    iInterruptLevel = 0;                                                 // release
    acknowledge_irq();                                                   // required on exit of all irqs
}

/**************************** SCI3 interrupt ******************************************/

static __interrupt void SCI3_Interrupt(void)
{
    volatile unsigned long ulStatus;

    iInterruptLevel = 1;                                                 // ensure interrupts remain blocked when putting message to queue

    while (((ulStatus = U3IIR) & UART_NO_INT_PENDING) == 0) {            // while interrupts pending
        switch (ulStatus & UART_INT_MASK) {                              // get the interrupt type
        case UART_RLS_INT_PENDING:                                       // line stats change or error
            ulStatus = U3LSR;                                            // read the status - clearing interrupt source
            if (ulStatus & (UART_OE | UART_PE | UART_FE)) {              // error
                break;
            }
            if (ulStatus & UART_BI) {
                // break condition change active
            }
            else {
                // break condition changed inactive
            }
            break;

        case UART_RDA_INT_PENDING:                                       // reception
        case UART_CTI_INT_PENDING:                                       // reception with timeout due to no read
            fnSciRxByte((unsigned char)U3RBR_THR, 3);                    // receive data interrupt - read the byte (clearing the interrupt)
            break;

        case UART_THRE_INT_PENDING:                                      // transmission interrupt (read of IIR will have cleared the interrupt)
        #ifdef _WINDOWS
            U3LSR |= UART_THRE;                                          // mark transmitter empty again
        #endif
            fnSciTxByte(3);                                              // transmit data empty interrupt - write next byte
            break;
        }
        #ifdef _WINDOWS
        U3IIR &= ~(UART_INT_MASK);
        U3IIR |= UART_NO_INT_PENDING;
        U3LSR &= ~(UART_RDR | UART_OE | UART_PE | UART_FE | UART_BI | UART_RXFE);
        #endif
    }
    iInterruptLevel = 0;                                                 // release
    acknowledge_irq();                                                   // required on exit of all irqs
}
    #endif                                                               // end not if _LPC21XX


#ifdef UART_EXTENDED_MODE
extern unsigned char fnGetMultiDropByte(QUEUE_HANDLE channel)            // {9} dummy
{
    return 0;
}
#endif

static void fnConfigUARTInterrupt(QUEUE_HANDLE Channel)
{
    switch (Channel) {                                                   // enter the interrupt handler
    case 0:
        fnSetIntHandler(INTERRUPT_UART0, UART0_INTERRUPT_PRIORITY, (unsigned long)SCI0_Interrupt); // configure and enter the handling interrupt routine in the vector table
        break;
    case 1:
        fnSetIntHandler(INTERRUPT_UART1, UART1_INTERRUPT_PRIORITY, (unsigned long)SCI1_Interrupt); // configure and enter the handling interrupt routine in the vector table
        break;
    #ifndef _LPC21XX
    case 2:
        fnSetIntHandler(INTERRUPT_UART2, UART2_INTERRUPT_PRIORITY, (unsigned long)SCI2_Interrupt); // configure and enter the handling interrupt routine in the vector table
        break;
    case 3:
        fnSetIntHandler(INTERRUPT_UART3, UART3_INTERRUPT_PRIORITY, (unsigned long)SCI3_Interrupt); // configure and enter the handling interrupt routine in the vector table
        break;
    #endif
    }
}

// Enable reception on the defined channel
//
extern void fnRxOn(QUEUE_HANDLE Channel)
{
    LPC23XX_UART_CONTROL *uart_reg = fnSelectChannel(Channel);

    uart_reg->IIR_FCR = (FIFO_ENABLE | RX_FIFO_RESET | RX_TRIGGER_1_CHAR); // ensure rx FIFOs reset before enabling receive interrupts
    fnConfigUARTInterrupt(Channel);
    uart_reg->DLM_IER |= UART_RDA_INT;                                   // enable reception interrupt
    #ifdef _WINDOWS
    uart_reg->IIR_FCR &= ~(TX_FIFO_RESET | RX_FIFO_RESET);
    #endif
}

// Disable reception on the defined channel
//
extern void fnRxOff(QUEUE_HANDLE Channel)
{
    LPC23XX_UART_CONTROL *uart_reg = fnSelectChannel(Channel);
    uart_reg->DLM_IER &= ~UART_RDA_INT;                                  // disable reception interrupt
}

// Enable transmission on the defined channel
//
extern void fnTxOn(QUEUE_HANDLE Channel)
{
    LPC23XX_UART_CONTROL *uart_reg = fnSelectChannel(Channel);

    uart_reg->IIR_FCR = (FIFO_ENABLE | TX_FIFO_RESET | RX_TRIGGER_1_CHAR); // ensure tx FIFOs reset before enabling receive interrupts
    fnConfigUARTInterrupt(Channel);
    uart_reg->DLM_IER |= UART_THRE_INT;                                  // enable transmission interrupt
    #ifdef _WINDOWS
    uart_reg->IIR_FCR &= ~(TX_FIFO_RESET | RX_FIFO_RESET);
    #endif
}

// Disable transmission on the defined channel
//
extern void fnTxOff(QUEUE_HANDLE Channel)
{
    LPC23XX_UART_CONTROL *uart_reg = fnSelectChannel(Channel);
    uart_reg->DLM_IER &= ~UART_THRE_INT;                                 // disable transmission interrupt
}

// The TTY driver uses this call to disable the transmit interrupt of the serial port
//
extern void fnClearTxInt(QUEUE_HANDLE channel)
{
    // the LPC23xx doesn't need to disable transmit interrupts during idle periods so this function is left empty
}

// The TTY driver uses this call to send a byte of data over the serial port
//
extern int fnTxByte(QUEUE_HANDLE channel, unsigned char ucTxByte)
{
    LPC23XX_UART_CONTROL *uart_reg = fnSelectChannel(channel);

    if (!(uart_reg->LSR & UART_THRE)) {                                  // transmitter is presently active
        return 1;                                                        // can't at the moment send so inform this
    }
    uart_reg->RBR_THR_DLL = ucTxByte;                                    // send the character
    #ifdef _WINDOWS
    ucTxLast[channel] = (unsigned char)uart_reg->RBR_THR_DLL;            // back up the data written so that it can't get lost when rx data uses the simulated register
    uart_reg->LSR &= ~(UART_THRE);                                       // mark transmitter presently not empty
    switch (channel) {                                                   // activate first interrupt
    case 0:
        iInts |= CHANNEL_0_SERIAL_INT;
        break;
    case 1:
        iInts |= CHANNEL_1_SERIAL_INT;
        break;
    case 2:
        iInts |= CHANNEL_2_SERIAL_INT;
        break;
    case 3:
        iInts |= CHANNEL_3_SERIAL_INT;
        break;
    }
    #endif
    return 0;                                                            // transmission started
}


    #ifdef SUPPORT_HW_FLOW

static void fnSetRTS(QUEUE_HANDLE channel, int iState)                   // {6}
{
    switch (channel) {
    #if defined RTS_0_PIN
    case 0:
        if (iState != 0) {
            RTS_0_PORT_CLR = RTS_0_PIN;                                  // assert RTS
        }
        else {
            RTS_0_PORT_SET = RTS_0_PIN;                                  // negate RTS
        }
        break;
    #endif
    #if CHIP_HAS_UARTS > 1 && defined RTS_1_PIN                          // only if second UART is available
    case 1:
        if (iState != 0) {
            RTS_1_PORT_CLR = RTS_1_PIN;                                  // assert RTS
        }
        else {
            RTS_1_PORT_SET = RTS_1_PIN;                                  // negate RTS
        }
        break;
    #endif
    #if CHIP_HAS_UARTS > 2 && defined RTS_2_PIN                          // only if third UART is available
    case 2:
        if (iState != 0) {
            RTS_2_PORT_CLR = RTS_2_PIN;                                  // assert RTS
        }
        else {
            RTS_2_PORT_SET = RTS_2_PIN;                                  // negate RTS
        }
        break;
    #endif
    #if CHIP_HAS_UARTS > 3 && defined RTS_3_PIN                          // only if fourth UART is available
    case 3:
        if (iState != 0) {
            RTS_3_PORT_CLR = RTS_3_PIN;                                  // assert RTS
        }
        else {
            RTS_3_PORT_SET = RTS_3_PIN;                                  // negate RTS
        }
        break;
    #endif
    }
}
extern void fnControlLine(QUEUE_HANDLE channel, unsigned short usModifications, UART_MODE_CONFIG OperatingMode)
{
    if (usModifications & (CONFIG_RTS_PIN | CONFIG_CTS_PIN)) {           // {6}
        if (usModifications & CONFIG_RTS_PIN) {
            switch (channel) {
        #if defined RTS_0_PIN
            case 0:
                RTS_0_PORT_DDR |= RTS_0_PIN;                             // configure as digital output
                break;
        #endif
        #if CHIP_HAS_UARTS > 1 && defined RTS_1_PIN                      // only if second UART is available
            case 1:
                RTS_1_PORT_DDR |= RTS_1_PIN;                             // configure as digital output
                break;
        #endif
        #if CHIP_HAS_UARTS > 2 && defined RTS_2_PIN                      // only if third UART is available
            case 2:
                RTS_2_PORT_DDR |= RTS_2_PIN;                             // configure as digital output
                break;
        #endif
        #if CHIP_HAS_UARTS > 3 && defined RTS_3_PIN                      // only if fourth UART is available
            case 3:
                RTS_3_PORT_DDR |= RTS_3_PIN;                             // configure as digital output
                break;
        #endif
            }
            fnSetRTS(channel, 0);                                        // drive the RTS line in negated state
        }
        if (usModifications & CONFIG_CTS_PIN) {
            switch (channel) {
        #if defined CTS_0_PIN
            case 0:
                CTS_0_PORT_DDR &= ~CTS_0_PIN;                            // configure as digital input
                break;
        #endif
        #if CHIP_HAS_UARTS > 1 && defined CTS_1_PIN                      // only if second UART is available
            case 1:
                CTS_1_PORT_DDR &= ~CTS_1_PIN;                            // configure as digital input
                break;
        #endif
        #if CHIP_HAS_UARTS > 2 && defined CTS_2_PIN                      // only if third UART is available
            case 2:
                CTS_2_PORT_DDR &= ~CTS_2_PIN;                            // configure as digital input
                break;
        #endif
        #if CHIP_HAS_UARTS > 3 && defined CTS_3_PIN                      // only if fourth UART is available
            case 3:
                CTS_3_PORT_DDR &= ~CTS_3_PIN;                            // configure as digital input
                break;
        #endif
            }
        }
    }

    if (usModifications & (SET_RTS | SET_CTS)) {                         // SET_CTS may be used in DCE mode and results in the same action as SET_RTS
        fnSetRTS(channel, 1);                                            // drive asserted RTS
    }
    else if (usModifications & (CLEAR_RTS | CLEAR_CTS)) {                // deactivate RTS
        fnSetRTS(channel, 0);                                            // drive negated RTS
    }
}


static void cts0_change(void)
{
    #if defined CTS_0_PIN
    fnRTS_change(0, ((CTS_0_STATE & CTS_0_PIN) == 0));                   // control transmission according to state
    #endif
}

