sWahlinRhoades/uTaskerModified/Hardware/LPC2XXX/LPC23XX.c
#if CHIP_HAS_UARTS > 1
static void cts1_change(void)
{
    #if defined CTS_1_PIN
    fnRTS_change(1, ((CTS_1_STATE & CTS_1_PIN) == 0));                   // control transmission according to state
    #endif
}
#endif
#if CHIP_HAS_UARTS > 2
static void cts2_change(void)
{
    #if defined CTS_2_PIN
    fnRTS_change(2, ((CTS_2_STATE & CTS_2_PIN) == 0));                   // control transmission according to state
    #endif
}
#endif
#if CHIP_HAS_UARTS > 3
static void cts3_change(void)
{
    #if defined CTS_3_PIN
    fnRTS_change(3, ((CTS_3_STATE & CTS_3_PIN) == 0));                   // control transmission according to state
    #endif
}
#endif

static void ( *cts_change[CHIP_HAS_UARTS] )( void ) = {
    cts0_change,
#if CHIP_HAS_UARTS > 1
    cts1_change,
#endif
#if CHIP_HAS_UARTS > 2
    cts2_change,
#endif
#if CHIP_HAS_UARTS > 3
    cts3_change,
#endif
};

static const unsigned char cts_irq_priority[CHIP_HAS_UARTS] = {
#if defined CTS_0_PIN
    CTS_0_INT_PRIORITY,
#else
    0,
#endif
#if CHIP_HAS_UARTS > 1
    #if defined CTS_0_PIN
    CTS_1_INT_PRIORITY,
    #else
    0,
    #endif
#endif
#if CHIP_HAS_UARTS > 2
    #if defined CTS_0_PIN
    CTS_2_INT_PRIORITY,
    #else
    0,
    #endif
#endif
#if CHIP_HAS_UARTS > 3
    #if defined CTS_3_PIN
    CTS_3_INT_PRIORITY,
    #else
    0,
    #endif
#endif
};

static const unsigned char cts_port[CHIP_HAS_UARTS] = {
#if defined CTS_0_PIN
    CTS_0_PORT,
#else
    0,
#endif
#if CHIP_HAS_UARTS > 1
    #if defined CTS_1_PIN
    CTS_1_PORT,
    #else
    0,
    #endif
#endif
#if CHIP_HAS_UARTS > 2
    #if defined CTS_2_PIN
    CTS_2_PORT,
    #else
    0,
    #endif
#endif
#if CHIP_HAS_UARTS > 3
    #if defined CTS_3_PIN
    CTS_3_PORT,
    #else
    0,
    #endif
#endif
};

static const unsigned long cts_port_bit[CHIP_HAS_UARTS] = {
#if defined CTS_0_PIN
    CTS_0_PIN,
#else
    0,
#endif
#if CHIP_HAS_UARTS > 1
    #if defined CTS_1_PIN
    CTS_1_PIN,
    #else
    0,
    #endif
#endif
#if CHIP_HAS_UARTS > 2
    #if defined CTS_2_PIN
    CTS_2_PIN,
    #else
    0,
    #endif
#endif
};


extern QUEUE_TRANSFER fnControlLineInterrupt(QUEUE_HANDLE channel, unsigned short usModifications, UART_MODE_CONFIG OperatingMode)
{
    QUEUE_TRANSFER ControlLines = 0;
    if (usModifications & (ENABLE_CTS_CHANGE | DISABLE_CTS_CHANGE)) {
        INTERRUPT_SETUP interrupt_setup;                                 // interrupt configuration parameters
        interrupt_setup.int_type = PORT_INTERRUPT;                       // identifier when configuring
        if (usModifications & ENABLE_CTS_CHANGE) {
            interrupt_setup.int_handler = cts_change[channel];           // handling function
        }
        else {
            interrupt_setup.int_handler = 0;                             // disable interrupts
        }
        interrupt_setup.int_port = cts_port[channel];                    // the port used
        interrupt_setup.int_priority = cts_irq_priority[channel];        // port interrupt priority
        interrupt_setup.int_port_bits = cts_port_bit[channel];           // the input connected
        interrupt_setup.int_port_sense = IRQ_BOTH_EDGES;                 // interrupt on both edges
        fnConfigureInterrupt(&interrupt_setup);                          // configure test interrupt
    }
    switch (channel) {
#if defined CTS_0_PIN
    case 0:
        if ((CTS_0_STATE & CTS_0_PIN) == 0) {
            ControlLines |= SET_CTS;                                     // CTS line is active
        }
        break;
#endif
#if CHIP_HAS_UARTS > 1 && defined CTS_1_PIN
    case 1:
        if ((CTS_1_STATE & CTS_1_PIN) == 0) {
            ControlLines |= SET_CTS;                                     // CTS line is active
        }
        break;
#endif
#if CHIP_HAS_UARTS > 2 && defined CTS_2_PIN
    case 2:
        if ((CTS_2_STATE & CTS_2_PIN) == 0) {
            ControlLines |= SET_CTS;                                     // CTS line is active
        }
        break;
#endif
#if CHIP_HAS_UARTS > 3 && defined CTS_3_PIN
    case 3:
        if ((CTS_3_STATE & CTS_3_PIN) == 0) {
            ControlLines |= SET_CTS;                                     // CTS line is active
        }
        break;
#endif
    }
    return ControlLines;
}
    #endif


    #ifdef UART_BREAK_SUPPORT
extern void fnStartBreak(QUEUE_HANDLE Channel)                           // {44}
{
    LPC23XX_UART_CONTROL *uart_reg = fnSelectChannel(Channel);
    uart_reg->LCR |= BREAK_CONTROL;
}


extern void fnStopBreak(QUEUE_HANDLE Channel)                            // {44}
{
    LPC23XX_UART_CONTROL *uart_reg = fnSelectChannel(Channel);
    uart_reg->LCR &= ~BREAK_CONTROL;
}
    #endif
#endif                                                                   // end if SERIAL_INTERFACE




/* =================================================================== */
/*                           FLASH driver                              */
/* =================================================================== */

#if defined SPI_FILE_SYSTEM && defined FLASH_FILE_SYSTEM

// Configure the SPI interface for file system use - SSP used
//
static void fnConfigSPIFileSystem(unsigned char ucSpeed)
{
    POWER_UP(PCSSP_X);                                                   // {10} power up the SSP used
    CONFIGURE_SPI_PINS();
    CONFIGURE_CS_LINES();

    SSPCR1_X = 0;                                                        // ensure disabled (master mode)
    SSPCPSR_X = 2;                                                       // set clock prescaler (even prescale 2..254)

    switch (ucSpeed) {
    case MAX_SPI:                                                        // set maximum possible SPI speed
        SSPCR0_X = (FRS_FREESCALE_SPI | DSS_8_BIT | (0 << SSP_SCR_SHIFT)); // set exact frequency and mode
	    break;

    case SPI_2MEG:
        SSPCR0_X = (FRS_FREESCALE_SPI | DSS_8_BIT | ((((SSP_CLOCK/2 + 2000000/2)/2000000) - 1) << SSP_SCR_SHIFT)); // set exact frequency and mode
	    break;

    case SPI_SLAVE:
	    return;
    }
    SSPCR1_X = SSP_SSE;                                                  // enable
}
#endif



#if defined FLASH_FILE_SYSTEM || defined USE_PARAMETER_AREA              // {15} internal flash driver required
static unsigned long fnGetFlashSector(unsigned long FlashAddress)
{
    #if defined _LPC21XX && !defined _LPC214X                            // {22}
    return (FlashAddress/FLASH_GRANULARITY_LARGE);
    #else
    FlashAddress -= FLASH_START_ADDRESS;
    if (FlashAddress < FLASH_SECTOR_8_OFFSET) {                          // one of the first small sectors
        return (FlashAddress/FLASH_GRANULARITY_SMALL);
    }
    else if (FlashAddress < FLASH_SECTOR_22_OFFSET) {                    // one of the middle large sectors
        FlashAddress -= FLASH_SECTOR_8_OFFSET;
        return ((FlashAddress/FLASH_GRANULARITY_LARGE) + 8);
    }
    else {                                                               // one of the last small sectors
        FlashAddress -= FLASH_SECTOR_22_OFFSET;
        return ((FlashAddress/FLASH_GRANULARITY_SMALL) + 22);
    }
    #endif
}

