sWahlinRhoades/uTaskerModified/Hardware/LPC2XXX/LPC23XX.c
// The LPC23XX can not change lines of less that quadword length (16 bytes)
//
unsigned char fnGetValidPars(unsigned char ucValid)
{
    unsigned long ulValidUse[(2 * FLASH_LINE_SIZE)/sizeof(unsigned long)];
    unsigned long ulCompare;

    // The first 2 long word locations of the first two FLASH lines defines the validity of the block. 0x55555555 0x55555555 means it is fully valid. 0xffffffff 0x55555555 means it contains temporary unvalidated data
    //
    fnGetParsFile(PARAMETER_BLOCK_1, (unsigned char*)ulValidUse, sizeof(ulValidUse));

    if (PRESENT_TEMP_BLOCK != ucValid) {
        ulCompare = 0x55555555;                                          // we are looking for validated pattern
    }
    else {
        ulCompare = 0xffffffff;                                          // we are looking for temporary pattern
    }

    if ((ulValidUse[0] == 0x55555555) && (ulValidUse[FLASH_LINE_SIZE/sizeof(unsigned long)] == ulCompare)) {
        return 1;                                                        // first block matched request
    }
    #ifdef USE_PAR_SWAP_BLOCK
    else {
        fnGetParsFile(PARAMETER_BLOCK_2, (unsigned char*)ulValidUse, sizeof(ulValidUse));
        if ((ulValidUse[0] == 0x55555555) && (ulValidUse[FLASH_LINE_SIZE/sizeof(unsigned long)] == ulCompare)) {
            return 2;                                                    // second block matched request
        }
    }
    #endif
    return 0;                                                            // all other cases indicate the searched block doesn't exist
}

static int fnDeleteParBlock(unsigned char *ptrAddInPar)
{
    #ifdef FLASH_FILE_SYSTEM
    return (fnFlashCommand(DELETE_FLASH, ptrAddInPar, PARAMETER_BLOCK_SIZE));
    #else
    return 0;
    #endif
}

// Due to the fact that individual bytes in quadwords (16 bytes) can not be modified more that once, one quadword is used for each byte to be stored.
// This allows the parameter system to fulfil its function but is not very efficient due to the high overhead.
//
extern int fnGetParameters(unsigned char ucValidBlock, unsigned short usParameterReference, unsigned char *ucValue, unsigned short usLength)
{
    unsigned char *ptrPar = PARAMETER_BLOCK_1;

    #ifdef USE_PAR_SWAP_BLOCK
    if (ucValidBlock == 2) {
        ptrPar += (PARAMETER_BLOCK_2 - PARAMETER_BLOCK_1);
    }
    #endif
    ptrPar += (usParameterReference * FLASH_LINE_SIZE);
    ptrPar += (2 * FLASH_LINE_SIZE);                                     // first parameter starts after validation information

    while (usLength--) {
        fnGetParsFile(ptrPar, ucValue++, 1);
        ptrPar += FLASH_LINE_SIZE;
    }
    return 0;
}

extern int fnSetParameters(unsigned char ucValidBlock, unsigned short usParameterReference, unsigned char *ucValue, unsigned short usLength)
{
    unsigned char *ptrPar = PARAMETER_BLOCK_1, *ptrStart;
    unsigned long ulValid = 0x55555555;
    unsigned long ulValidCheck;
    unsigned char ucCheck[FLASH_LINE_SIZE];
    int iBlockUse = 0;
    int iCommitNewStatus = 0;
    #ifdef _WINDOWS                                                      // when simulating use a recognisable pattern
    uMemset(ucCheck, 0x33, FLASH_LINE_SIZE);
    #else
    uMemset(ucCheck, 0xff, FLASH_LINE_SIZE);
    #endif

    if (TEMP_PARS & ucValidBlock) {
        ucValidBlock &= ~TEMP_PARS;
        iBlockUse = 1;
    }

    if (ucValidBlock & BLOCK_INVALID) {                                  // no valid parameter blocks have been found so we can use the first for saving the data
        fnDeleteParBlock(PARAMETER_BLOCK_1);                             // we delete it to be absolutely sure it is fresh
    #ifdef USE_PAR_SWAP_BLOCK
        fnDeleteParBlock(PARAMETER_BLOCK_2);
    #endif
        ucValidBlock = 1;
    }

    #ifdef USE_PAR_SWAP_BLOCK
    if (ucValidBlock == 2) {
        ptrPar += (PARAMETER_BLOCK_2 - PARAMETER_BLOCK_1);
    }
    #endif
    ptrStart = ptrPar;
    ptrPar += (usParameterReference * FLASH_LINE_SIZE);
    ptrPar += (2*FLASH_LINE_SIZE);                                       // first parameter starts after validation information (each occupying one quadword line)

    if (!usLength) {
        if (iBlockUse) {                                                 // if we have a new set waiting, set it to use state
            iBlockUse = 0;
    #ifdef USE_PAR_SWAP_BLOCK
            if (ptrStart == PARAMETER_BLOCK_1) {
                ptrPar = PARAMETER_BLOCK_2;
            }
            else {
                ptrPar = PARAMETER_BLOCK_1;
            }
            fnDeleteParBlock(ptrPar);
    #endif
        }
        else {                                                           // we must delete the block
            fnDeleteParBlock(ptrStart);
            if (usParameterReference) {
                return 0;                                                // we don't validate it again
            }
        }
    }
    else {
        while (usLength--) {
            ucCheck[0] = *ucValue;
            fnWriteBytesFlash(ptrPar, ucCheck, FLASH_LINE_SIZE);         // write each parameter to FLASH
            ucValue++;
            ptrPar += FLASH_LINE_SIZE;
        }
        if (((CAST_POINTER_ARITHMETIC)ptrPar & (FLASH_ROW_SIZE-1)) != 0) {
            if (ptrPar > (ptrStart + FLASH_ROW_SIZE)) {
                fnWriteBytesFlash(0, 0, 0);                              // commit any open FLASH row buffer
            }
        }
    }
                                                                         // now we must validate the parameter block which we have just written to
    fnGetParsFile(ptrStart, (unsigned char *)&ulValidCheck, sizeof(ulValidCheck));
    if (ulValidCheck != ulValid) {
        fnWriteBytesFlash(ptrStart, (unsigned char *)&ulValid, sizeof(ulValid)); // validate data
        iCommitNewStatus = 1;
    }
    if (!iBlockUse) {
        fnGetParsFile((ptrStart + FLASH_LINE_SIZE), (unsigned char *)&ulValidCheck, sizeof(ulValidCheck));
        if (ulValidCheck != ulValid) {
            fnWriteBytesFlash((ptrStart + FLASH_LINE_SIZE), (unsigned char *)&ulValid, sizeof(ulValid)); // use data
            iCommitNewStatus = 1;
        }
    }
    if (iCommitNewStatus != 0) {
        fnWriteBytesFlash(0, 0, 0);                                      // commit the parameter block status
    }
    return 0;
}
#endif




#ifdef CAN_INTERFACE

// CAN interface queues
//
typedef struct stCANQue
{
    unsigned long  ulPartnerID;                                          // default transmission ID (msb signifies extended)
    QUEUE_HANDLE   DriverID;                                             // handle this buffer belongs to
    unsigned char  ucMode;
    unsigned char  ucErrors;                                             // tx error counter per buffer
    UTASK_TASK     TaskToWake;                                           // task responsible for processing rx frames, errors or tx frame complete
} CANQUE;

#define NUMBER_CAN_MESSAGE_BUFFERS 3
static CANQUE can_queue[NUMBER_CAN_MESSAGE_BUFFERS] = {{0}};


