sWahlinRhoades/uTaskerModified/Hardware/LPC2XXX/LPC23XX.c
/**************************** CAN interrupt ******************************************/

static __interrupt void CAN_Interrupt(void)
{
    unsigned char can_int_message[HEADER_LENGTH] = {INTERNAL_ROUTE, INTERNAL_ROUTE, 0, INTERRUPT_EVENT, 0};
    CANQUE *ptrCanQue = &can_queue[0];
    can_int_message[MSG_DESTINATION_TASK] = ptrCanQue->TaskToWake;

//	portBASE_TYPE xHigherPriorityTaskWoken = pdFALSE;

	CAN1SR;
	CAN1GSR;
	CAN1ICR;
	CAN1EWL;
//	CAN_RX_SR;
//	_SR = CAN1SR;
//	_GSR = CAN1GSR;
//	_ICR  = CAN1ICR;
//	_EWL = CAN1EWL;
	//CANStatus = CAN_RX_SR;

        //if ( CANStatus & (1 << 8) )
	if( 1 == (CAN1SR & 0x1) )
	{
//		CAN1RxCount++;  note that the uTasker receiver signals that there is a message waiting but doesn't read it directly
        /*
	    unsigned long * pDest;

	    // initialize destination pointer
	    pDest = (unsigned long *)&MsgBuf_RX1;
	    *pDest = CAN1RFS;  // Frame

	    pDest++;
	    *pDest = CAN1RID; // ID		//change by gongjun

	    pDest++;
	    *pDest = CAN1RDA; // Data A

	    pDest++;
	    *pDest = CAN1RDB; // Data B

	    //CAN1RxDone = 1;
        CAN1CMR = 0x04; // release receive buffer
*/
	    //if((MsgBuf_RX1.Frame&0xc0000000) == 0x80000000)   // data frame, external frame
	    //xQueueSendFromISR(can_rx_queue, (void *)(&MsgBuf_RX1), _pxHigherPriorityTaskWoken);
        can_int_message[MSG_INTERRUPT_EVENT] = CAN_RX_MSG;               // rx message received
        iInterruptLevel = 1;                                             // ensure interrupts remain blocked when putting message to queue
        fnWrite(INTERNAL_ROUTE, (unsigned char *)can_int_message, HEADER_LENGTH); // inform the handling task of event
        iInterruptLevel = 0;
	    return;
	}

        /*
	if ( CANStatus & (1 << 9) )
	{
		CAN2RxCount++;
                // CAN_ISR_Rx2();
	}*/

	if ( CAN1GSR & (1 << 6 ) )
	{
		/* The error count includes both TX and RX */
//		CAN1ErrCount = (CAN1GSR >> 16 );
	}

        /*
	if ( CAN2GSR & (1 << 6 ) )
	{
		// The error count includes both TX and RX 
		CAN2ErrCount = (CAN2GSR >> 16 );
	} */

	//VICVectAddr = 0;
	//if(xHigherPriorityTaskWoken)
	//{
	//	portYIELD_FROM_ISR();
	//}
    acknowledge_irq();                                                   // required on exit of all irqs
}

// Hardware configuration of CAN controller (called for each configuration)
//
void fnConfigCAN(QUEUE_HANDLE DriverID, CANTABLE *pars)
{
}


// Hardware initialisation of CAN controller (called only once)
//
extern void fnInitCAN(CANTABLE *pars)
{//unsigned long regaddr;
	extern void can_isr_handler( void );
    unsigned long btr = 0;  // thsi needs to be defined from speed and settings

    if (pars->Channel > 0) {
	  //PCONP |= PCPCAN2;
    }
    else {
	    PCONP |= PCPCAN1;
        CAN1MOD = 1;
        //CAN1IER = 1;
        CAN1GSR = 0;
        CAN1BTR = btr;
        //CAN_SetACCF(ACCF_BYPASS);
        AFMR = AFMR_AccBP;
	        //CAN1IER = 0x7ff;
        CAN1IER = 0x1; //interrupt on receive
        CAN1MOD = 0x0;
        CAN1SR;
        CAN1GSR;
        CAN1ICR;
        CAN1EWL;

#ifdef MCB2300
        //This routing correspondes to MCB2300
        PINSEL0 &= 0xFFFFFFF0;                       /* Reset CAN1 bits */
        PINSEL0 |= 0x00000005;                       /* Set CAN1 bits to b0101 */
#else
        //CAN be routed to different pins on the chip
        //This routing of RD1,TD1 can pins corresponds to the Greensmith board
        PINSEL1 |= (1L<<10) | (1L<<11) | (1L<<12) | (1L<<13);
#endif
    }
#define CAN_INTERRUPT_PRIORITY 8
    fnSetIntHandler(INTERRUPT_CAN, CAN_INTERRUPT_PRIORITY, (unsigned long)CAN_Interrupt);
    //can_rx_queue = xQueueCreate(8, sizeof(CAN_MSG));
}

// The CAN driver has called this to collect a received message
//
extern unsigned char fnCAN_get_rx(QUEUE_HANDLE DriverID, unsigned char *ptBuffer, QUEUE_TRANSFER Counter)
{
    //CAN1RxCount++;

	    *ptBuffer++ = (unsigned char)CAN1RFS;  // Frame

	    *ptBuffer++ = (unsigned char)CAN1RID; // ID

	    *ptBuffer++ = (unsigned char)(CAN1RDA); // Data A
        *ptBuffer++ = (unsigned char)(CAN1RDA >> 8);
        *ptBuffer++ = (unsigned char)(CAN1RDA >> 16);
        *ptBuffer++ = (unsigned char)(CAN1RDA >> 24);

	    *ptBuffer++ = (unsigned char)(CAN1RDB); // Data B
        *ptBuffer++ = (unsigned char)(CAN1RDB >> 8);
        *ptBuffer++ = (unsigned char)(CAN1RDB >> 16);
        *ptBuffer++ = (unsigned char)(CAN1RDB >> 24);


	    //CAN1RxDone = 1;
        CAN1CMR = 0x04; // release receive buffer
    return 0;                                                            // no data was found...
}

// The CAN driver has called this to send a message
//
extern unsigned char fnCAN_tx(QUEUE_HANDLE DriverID, unsigned char *ptBuffer, QUEUE_TRANSFER Counter)
{
	unsigned long CANStatus;

	//Sanjay - what does this do?
	//Need to add more comments
	if(CAN1GSR&(1L<<6))
	{
		CAN1MOD = 1;
		CAN1GSR &= 0x00ff;
		CAN1MOD = 0;
	}
	CANStatus = CAN1SR;
	if ( CANStatus & 0x00000004 )
	{		
                //CAN1TFI1 = pTxBuf->Frame & 0x80020000; // 8 for 29 bit addressing, 2 is message length
        CAN1TFI1 = *ptBuffer++;//pTxBuf->Frame;
		CAN1TID1 = *ptBuffer++;//pTxBuf->MsgID;
		CAN1TDA1 = (*ptBuffer++ | (*ptBuffer++ << 8) | (*ptBuffer++ << 16) | (*ptBuffer++ << 24));//pTxBuf->DataA;
		CAN1TDB1 = (*ptBuffer++ | (*ptBuffer++ << 8) | (*ptBuffer++ << 16) | (*ptBuffer++ << 24));//pTxBuf->DataB; 

             /*   CAN1TFI1 = 0x800F0000;
		CAN1TID1 = 0x15555555;
		CAN1TDA1 = 0x55555555;
		CAN1TDB1 = 0x55555555;*/

		CAN1CMR = 0x21;
                //CAN1CMR = 0x22; //abort send
		return ( 1 );
	}
	else if ( CANStatus & 0x00000400 )
	{
		CAN1TFI2 = *ptBuffer++; // pTxBuf->Frame & 0xC00F0000;
		CAN1TID2 = *ptBuffer++;//pTxBuf->MsgID;
		CAN1TDA2 = (*ptBuffer++ | (*ptBuffer++ << 8) | (*ptBuffer++ << 16) | (*ptBuffer++ << 24));//pTxBuf->DataA;
		CAN1TDB2 = (*ptBuffer++ | (*ptBuffer++ << 8) | (*ptBuffer++ << 16) | (*ptBuffer++ << 24));//pTxBuf->DataB;
		CAN1CMR = 0x41;
		return ( 1 );
	}
	else if ( CANStatus & 0x00040000 )
	{
		CAN1TFI3 = *ptBuffer++; // pTxBuf->Frame & 0xC00F0000;
		CAN1TID3 = *ptBuffer++;//pTxBuf->MsgID;
		CAN1TDA3 = (*ptBuffer++ | (*ptBuffer++ << 8) | (*ptBuffer++ << 16) | (*ptBuffer++ << 24));//pTxBuf->DataA;
		CAN1TDB3 = (*ptBuffer++ | (*ptBuffer++ << 8) | (*ptBuffer++ << 16) | (*ptBuffer++ << 24));//pTxBuf->DataB;
		CAN1CMR = 0x81;
		return ( 1 );
	}
    return 0;                                                            // no free buffer was found...
}

#endif

#if defined I2C_INTERFACE
// Collect a pointer to defined I2C control block
//
static LPCXXX_I2C_CONTROL *fnSelectI2CChannel(QUEUE_HANDLE Channel)
{
    switch (Channel) {
    case 0:
        return (LPCXXX_I2C_CONTROL *)I2C_BLOCK_0;
#if !defined LPC2104 && !defined LPC2105 && !defined LPC2106
    case 1:
        return (LPCXXX_I2C_CONTROL *)I2C_BLOCK_1;
#endif
#ifndef _LPC21XX
    case 2:
        return (LPCXXX_I2C_CONTROL *)I2C_BLOCK_2;
#endif
    }
    return 0;                                                            // invalid
}

// I2C interrupt handler
//
static void fnI2CInt(QUEUE_HANDLE Channel, LPCXXX_I2C_CONTROL *iic, I2CQue *ptI2CQue)
{
    unsigned long ulState = iic->I2CSTAT;
    switch (ulState) {
    case MASTER_REPEATED_START_SENT:                                     // (0x10) repeated start has been sent
    case MASTER_START_SENT:                                              // (0x08) start bit sent, now send address
        {
            unsigned long ulAddress = *ptI2CQue->I2C_queue.get++;        // the address
            iic->I2CDAT = ulAddress;                                     // send the address of slave to write
            iic->I2CCONCLR = (IIC_STAC | IIC_SIC);                       // clear start bit and pending interrupt, which released transmission of address
            if (ptI2CQue->I2C_queue.get >= ptI2CQue->I2C_queue.buffer_end) {
                ptI2CQue->I2C_queue.get = ptI2CQue->I2C_queue.QUEbuffer; // handle circular buffer
            }
            if (ulAddress & 0x00000001) {                                // reading
                ptI2CQue->ucState = (RX_ACTIVE | TX_ACTIVE);
                ptI2CQue->I2C_queue.chars -= 3;                          // remove header (complete transmission message)
                I2C_rx_control[Channel]->wake_task = *ptI2CQue->I2C_queue.get++; // enter task to be woken when reception has completed
                if (ptI2CQue->I2C_queue.get >= ptI2CQue->I2C_queue.buffer_end) {
                    ptI2CQue->I2C_queue.get = ptI2CQue->I2C_queue.QUEbuffer; // handle circular buffer
                }
        #if defined _WINDOWS
                fnSimI2C_devices(Channel, I2C_ADDRESS, (unsigned char)iic->I2CDAT); // {58}
                iic->I2CSTAT = MASTER_RX_ADDRESS_ACKED;
                iInts |= (I2C_INT0 << Channel);
        #endif
            }
            else {
                ptI2CQue->I2C_queue.chars--;                             // {12} decrement the total length
        #if defined _WINDOWS
                fnSimI2C_devices(Channel, I2C_ADDRESS, (unsigned char)iic->I2CDAT); // {58}
                iic->I2CSTAT = MASTER_TX_ADDRESS_ACKED;                  // next interrupt state
                iInts |= (I2C_INT0 << Channel);
        #endif
            }
        }
        break;

    case MASTER_TX_ADDRESS_NOT_ACKED:                                    // (0x20) the slave address has been sent but no ack was received
    case MASTER_TX_DATA_NOT_ACKED:                                       // (0x30) a byte of data has been sent but was not acked
    case MASTER_TX_DATA_ACKED:                                           // (0x28) a byte of data has been sent and acked
    case MASTER_TX_ADDRESS_ACKED:                                        // (0x18) the slave address was sent and we have received an ack - continue with the TX data
        if (ptI2CQue->ucPresentLen != 0) {
            iic->I2CDAT = *ptI2CQue->I2C_queue.get++;                    // send first data byte
            iic->I2CCONCLR = IIC_SIC;                                    // clear pending interrupt
            ptI2CQue->ucPresentLen--;
            if (ptI2CQue->I2C_queue.get >= ptI2CQue->I2C_queue.buffer_end) {
                ptI2CQue->I2C_queue.get = ptI2CQue->I2C_queue.QUEbuffer; // handle circular buffer
            }
            ptI2CQue->I2C_queue.chars--;                                 // {12} decrement the total length
    #if defined _WINDOWS
            fnSimI2C_devices(Channel, I2C_TX_DATA, (unsigned char)iic->I2CDAT); // {58}
            iic->I2CSTAT = MASTER_TX_DATA_ACKED;
            iInts |= (I2C_INT0 << Channel);
    #endif
        }
        else {
            iic->I2CCONSET = IIC_STO;                                    // set stop bit
            if (!(ptI2CQue->I2C_queue.chars)) {                          // all transmission complete
                ptI2CQue->ucState = 0;
                if ( ptI2CQue->wake_task ) {
                   uTaskerStateChange( ptI2CQue->wake_task, UTASKER_ACTIVATE);// wake up owner task since the transmission has terminated
                }
    #ifdef _WINDOWS
                iic->I2CSTAT = I2C_IDLE_STATE;
    #endif
            }
            else {
                fnTxI2C(ptI2CQue, Channel);                              // we have another message to send so we can send a repeated start condition
            }
            iic->I2CCONCLR = IIC_SIC;                                    // clear pending interrupt
        }
        break;
    case MASTER_RX_ADDRESS_NOT_ACKED:                                    // (0x48) address has been sent but no ack received
    case MASTER_RX_ADDRESS_ACKED:                                        // (0x40) address has been sent and an ack received
        if (ptI2CQue->ucPresentLen == 1) {
            iic->I2CCONCLR = (IIC_AAC);                                  // don't ack the single byte
    #ifdef _WINDOWS
            iic->I2CSTAT = MASTER_RX_DATA_NOT_ACKED;
    #endif
        }
        else {
            iic->I2CCONSET = IIC_AA;                                     // ensure reception is acknowledged
    #ifdef _WINDOWS
            iic->I2CSTAT = MASTER_RX_DATA_ACKED;
    #endif
        }
        iic->I2CCONCLR = IIC_SIC;                                        // clear pending interrupt and start read of first byte
    #ifdef _WINDOWS
        iic->I2CDAT = fnSimI2C_devices(Channel, I2C_RX_DATA, (unsigned char)iic->I2CDAT); // {58} simulate the interrupt directly
        iInts |= (I2C_INT0 << Channel);
    #endif
        break;
    case MASTER_RX_DATA_ACKED:                                           // (0x50) data byte with ack has been received
    case MASTER_RX_DATA_NOT_ACKED:                                       // (0x58) data byte without ack has been received
        if (ptI2CQue->ucPresentLen) {
            ptI2CQue->ucPresentLen--;
            if (ptI2CQue->ucPresentLen == 0) {
                iic->I2CCONCLR = (IIC_AAC);                              // don't ack last byte
     #ifdef _WINDOWS
                iic->I2CSTAT = MASTER_RX_DATA_NOT_ACKED;
     #endif
            }
            else {
                iic->I2CCONSET = IIC_AA;                                 // ensure reception is acknowledged
     #ifdef _WINDOWS
                iic->I2CSTAT = MASTER_RX_DATA_ACKED;
     #endif
            }
            *I2C_rx_control[Channel]->I2C_queue.put++ = (unsigned char)iic->I2CDAT;// read the byte
            iic->I2CCONCLR = IIC_SIC;                                    // clear pending interrupt and start next transfer
            I2C_rx_control[Channel]->I2C_queue.chars++;                  // and put it into the rx buffer
            if (I2C_rx_control[Channel]->I2C_queue.put >= I2C_rx_control[Channel]->I2C_queue.buffer_end) {
                I2C_rx_control[Channel]->I2C_queue.put = I2C_rx_control[Channel]->I2C_queue.QUEbuffer;
            }
     #ifdef _WINDOWS
            if (ptI2CQue->ucPresentLen != 0) {
                iic->I2CDAT = fnSimI2C_devices0, (I2C_RX_DATA, (unsigned char)iic->I2CDAT);// simulate the interrupt directly
            }
            iInts |= (I2C_INT0 << Channel);
     #endif
        }
        else {
            iic->I2CCONSET = IIC_STO;                                    // send stop
            iic->I2CCONCLR = IIC_SIC;                                    // clear pending interrupt
     #ifdef _WINDOWS
            iic->I2CSTAT = I2C_IDLE_STATE;
     #endif
            ptI2CQue->ucState = 0;
            I2C_rx_control[Channel]->msgs++;
            if ( I2C_rx_control[Channel]->wake_task ) {                  // wake up the receiver task if desired
               uTaskerStateChange(I2C_rx_control[Channel]->wake_task, UTASKER_ACTIVATE); // wake up owner task
            }
        }
        break;

    default:                                                             // no other states are expected
        iic->I2CCONSET = IIC_STO;                                        // send stop
        iic->I2CCONCLR = IIC_SIC;                                        // clear pending interrupt
        break;
    }
}

static __interrupt void I2C_Interrupt_0(void)
{
    fnI2CInt(0, (LPCXXX_I2C_CONTROL *)I2C_BLOCK_0, I2C_tx_control[0]);
    acknowledge_irq();                                                   // required on exit of all irqs
}

#if !defined LPC2104 && !defined LPC2105 && !defined LPC2106
static __interrupt void I2C_Interrupt_1(void)
{
    fnI2CInt(1, (LPCXXX_I2C_CONTROL *)I2C_BLOCK_1, I2C_tx_control[1]);
    acknowledge_irq();                                                   // required on exit of all irqs
}
#endif

#if !defined _LPC21XX
static __interrupt void I2C_Interrupt_2(void)
{
    fnI2CInt(2, (LPCXXX_I2C_CONTROL *)I2C_BLOCK_2, I2C_tx_control[2]);
    acknowledge_irq();                                                   // required on exit of all irqs
}
#endif

// Configure the I2C hardware
//
extern void fnConfigI2C(I2CTABLE *pars)
{
    LPCXXX_I2C_CONTROL *iic = fnSelectI2CChannel(pars->Channel);
    switch (pars->Channel) {
    case 0:
        POWER_UP(PCI2C0);                                                // {10} power up the I2C module
        PCLKSEL0 |= PCLK_I2C0_CCLK_8;                                    // apply clock to it
#if defined _LPC21XX
        PINSEL0 |= (PINSEL0_P0_3_SDA0 | PINSEL0_P0_2_SCL0);              // SDA0 and SCL0 on P0.3 and P0.2
#else                                                                    // LPC2378
        PINSEL1 |= (PINSEL1_P0_27_SDA0 | PINSEL1_P0_28_SCL0);            // SDA0 and SCL0 on P0.27 and P0.28
#endif
        fnSetIntHandler(INTERRUPT_I2C0, IIC0_INTERRUPT_PRIORITY, (unsigned long)I2C_Interrupt_0); // configure and enter the handling interrupt routine in the vector table
        break;
#if !defined LPC2104 && !defined LPC2105 && !defined LPC2106
    case 1:
        POWER_UP(PCI2C1);                                                // {10} power up the I2C module
        PCLKSEL1 |= PCLK_I2C1_CCLK_8;                                    // apply clock to it
    #if defined LPC2101 || defined LPC2102 || defined LPC2103
        PINSEL1 |= (PINSEL1_P0_18_SDA1 | PINSEL1_P0_17_SCL1);            // SDA1 and SCL1 on P0.18 and P0.17
    #elif defined _LPC214X                                               // {22}
        PINSEL0 |= (PINSEL0_P0_14_SDA1 | PINSEL0_P0_11_SCL1);
    #else
        #ifdef I2C1_PORT0_HIGH
        PINSEL1 |= (PINSEL1_P0_19_SDA1 | PINSEL1_P0_20_SCL1);            // SDA1 and SCL1 on P0.19 and P0.20
        #else
        PINSEL0 |= (PINSEL0_P0_0_SDA1 | PINSEL0_P0_1_SCL1);              // SDA1 and SCL1 on P0.0 and P0.1
        #endif
    #endif
        fnSetIntHandler(INTERRUPT_I2C1, IIC1_INTERRUPT_PRIORITY, (unsigned long)I2C_Interrupt_1); // configure and enter the handling interrupt routine in the vector table
        break;
#endif
#ifndef _LPC21XX
    case 2:
        POWER_UP(PCI2C2);                                                // {10} power up the I2C module
        PCLKSEL1 |= PCLK_I2C2_CCLK_8;                                    // apply clock to it
        PINSEL0 |= (PINSEL0_P0_10_SDA2 | PINSEL0_P0_11_SCL2);            // SDA2 and SCL2 on P0.10 and P0.11
        fnSetIntHandler(INTERRUPT_I2C2, IIC2_INTERRUPT_PRIORITY, (unsigned long)IIC_Interrupt_2); // configure and enter the handling interrupt routine in the vector table
        break;
#endif
    default:
        return;                                                          // invalid channel
    }

    switch (pars->usSpeed) {
    case 400:                                                            // high speed IIC
        iic->I2CSCLL = (IIC_CLOCK*6/(400000*10));
        iic->I2CSCLH = (IIC_CLOCK*4/(400000*10));
        break;
    case 100:
    default:                                                             // default to 100kHz
        iic->I2CSCLL = (IIC_CLOCK*6/(100000*10));
        iic->I2CSCLH = (IIC_CLOCK*4/(100000*10));
        break;
    case 50:
        iic->I2CSCLL = (IIC_CLOCK*6/(50000*10));
        iic->I2CSCLH = (IIC_CLOCK*4/(50000*10));
        break;
    }
#if defined _WINDOWS
    fnConfigSimI2C(pars->Channel, (pars->usSpeed * 1000));
#endif
}

// Start transmission to IIC bus
//
extern void fnTxI2C(I2CQue *ptI2CQue, QUEUE_HANDLE Channel)
{
    LPCXXX_I2C_CONTROL *iic = fnSelectI2CChannel(Channel);
    iic->I2CCONSET = (IIC_I2EN + IIC_STA);                               // enable function and send start bit
    ptI2CQue->ucPresentLen = *ptI2CQue->I2C_queue.get++;                 // get present message length from the header
    if (ptI2CQue->I2C_queue.get >= ptI2CQue->I2C_queue.buffer_end) {
        ptI2CQue->I2C_queue.get = ptI2CQue->I2C_queue.QUEbuffer;         // handle circular buffer
    }
    ptI2CQue->ucState = (TX_ACTIVE);
    #if defined _WINDOWS
    iic->I2CSTAT = MASTER_START_SENT;
    iInts |= (I2C_INT0 << Channel);
#endif
}

#endif

#if (defined USB_RAM_START) && ((defined SD_CONTROLLER_DMA) || (defined USB_INTERFACE && (defined USB_DMA_RX || defined USB_DMA_TX))) // {28}
    #ifdef _WINDOWS
static unsigned char ucUSB_Memory[USB_RAM_SIZE];
extern unsigned char *fnGetUSB_mem(void)
{
    return ucUSB_Memory;
}
#define NOT_USB_RAM(x) ((x < ucUSB_Memory) || ( x > &ucUSB_Memory[USB_RAM_SIZE]))
    #else
#define NOT_USB_RAM(x) (x < (unsigned char *)USB_RAM_START)
    #endif

// Memory allocation and long-word alignment in USB RAM block
//
extern void *uMallocUSB(unsigned short __size)
{
    #ifdef _WINDOWS
    static unsigned char *pucBottomOfHeap = ucUSB_Memory;
    static unsigned char *pucTopOfHeap = (ucUSB_Memory + USB_RAM_SIZE);
    #else
    static unsigned char *pucBottomOfHeap = (unsigned char *)(USB_RAM_START);
    static unsigned char *pucTopOfHeap = (unsigned char *)(USB_RAM_START + USB_RAM_SIZE);
    #endif
    static unsigned short present_HeapSize = 0;

