sWahlinRhoades/uTaskerModified/Hardware/LPC2XXX/LPC23XX.c
    unsigned char *ptr = (pucBottomOfHeap + present_HeapSize);
    if ((CAST_POINTER_ARITHMETIC)ptr & 3) {                              // ensure all memory is aligned on long-word boundary
        ptr = (unsigned char *)((CAST_POINTER_ARITHMETIC)ptr & ~3);
        ptr += 4;
    }
    if ((ptr + __size) >= pucTopOfHeap) {
    #ifdef _WINDOWS
        *(int *)0 = 0;                                                   // generate exception so that the problem can be immediately seen an dcured
    #endif
        return 0;                                                        // no more room in USB ram space
    }

    uMemset(ptr, 0, __size);                                             // ensure new memory chunk is always zeroed

    present_HeapSize = (ptr - pucBottomOfHeap) + __size;
    return ((void *)ptr);
}

    #ifdef _WINDOWS
static unsigned char *_putUSB_RAM(unsigned char *ptrUSB_RAM)
{
    return &ucUSB_Memory[ptrUSB_RAM - (unsigned char *)USB_RAM_START];
}
static unsigned char *_getUSB_RAM(unsigned char *ptrUSB_RAM)
{
    return ((unsigned char *)USB_RAM_START + (ptrUSB_RAM - ucUSB_Memory));
}
    #else
    #define _putUSB_RAM(x) x
    #define _getUSB_RAM(x) x
    #endif
#endif


#ifdef USB_INTERFACE                                                     // {24}

static unsigned long ulEndpointPriorities = 0;

// This routine is called from the USB driver with interrupts blocked for deferred read of a reception buffer
//
extern int fnConsumeUSB_out(unsigned char ucEndpointRef)
{
    ulEndpointPriorities &= ~(0x00000001 << (ucEndpointRef * 2));
    USBEpIntPri = ulEndpointPriorities;                                  // move endpoint's interrupt back to slow priority so that it is handled
    return USB_BUFFER_NO_DATA;                                           // report no more data so that the driver doesn't call again. The interrupt routine will handle all waiting buffers itself.
}



// USB Macros
//
#define _USBMaxPSize(endpoint, size) USBDevIntClr = DEVICE_STATUS_EP_RLZED; USBEpInd = endpoint; USBMaxPSize = size; fnSetEndpointSize(); while (!(USBDevIntSt & DEVICE_STATUS_EP_RLZED)) {}// select the endpoint index and set its size
#define _USB_CMD_DATA(data, data_phase) ((data << 16) | data_phase)

#ifdef _WINDOWS
    extern unsigned long fnUSB_command_interpreter(unsigned long ulCommand, unsigned long ulData);
    extern unsigned long fnUSB_command_command(unsigned long ulCommand, unsigned long ulData);
    extern unsigned long fnGetUSB_from_FIFO(void);
#else
    #define fnGetUSB_from_FIFO() USBRxData
#endif

#ifdef _WINDOWS
static unsigned short usEndpointSizes[NUMBER_OF_USB_ENDPOINTS * 2] = {8, 8, 0}; // control endpoints default to 8

static void fnSetEndpointSize(void)
{
    usEndpointSizes[USBEpInd & 0x1f] = (unsigned short)USBMaxPSize;      // set the endpoint size and recalculate the internal RAM buffer address
    USBDevIntSt |= DEVICE_STATUS_EP_RLZED;                               // once the process has completed the realised flag will be set
}
#else
    #define fnSetEndpointSize()
#endif


#if (defined USB_DMA_RX || defined USB_DMA_TX) && defined USB_RAM_START
// Allocate USB buffer in USB memory
//
extern int fnAllocateUSBBuffer(QUEUE_HANDLE DriverID, USB_ENDPOINT *usb_endpoint_queue, QUEUE_DIMENSIONS *ptrQueueDimensions)
{
    unsigned char *new_memory;
    IDINFO *ptQueID = &que_ids[DriverID - 1];
    #if defined USB_DMA_RX && defined USB_RAM_START
    if ((ptrQueueDimensions->RxQueueSize != 0) && (ptQueID->input_buffer_control != 0)) {
        DMA_DESCRIPTOR_ISO *buffer_descriptor;
        unsigned long *ptrDMA_desc = (unsigned long *)USB_RAM_START;

        if (NO_MEMORY == (new_memory = (unsigned char *)uMallocUSB(ptrQueueDimensions->RxQueueSize))) {
            return (NO_MEMORY);
        }        

        ptQueID->input_buffer_control->buffer_end = ptQueID->input_buffer_control->QUEbuffer = (unsigned char *)new_memory;
        ptQueID->input_buffer_control->get = new_memory;
        ptQueID->input_buffer_control->put = new_memory;
      //ptQueID->input_buffer_control->chars = 0;
        ptQueID->input_buffer_control->buffer_end += ptrQueueDimensions->RxQueueSize;
        ptQueID->input_buffer_control->buf_length = ptrQueueDimensions->RxQueueSize;

        ptrDMA_desc += (usb_endpoint_queue->ucEndpointNumber * 2);
        buffer_descriptor = (DMA_DESCRIPTOR_ISO *)uMallocUSB(sizeof(DMA_DESCRIPTOR_ISO)); // allocate a single descriptor for this endpoint
        *(CAST_POINTER_ARITHMETIC *)_putUSB_RAM((unsigned char *)ptrDMA_desc) = (CAST_POINTER_ARITHMETIC)buffer_descriptor;
        buffer_descriptor->dma_mode_status = ((usb_endpoint_queue->usMax_frame_length << 5) | (ptrQueueDimensions->RxQueueSize << 16));
        buffer_descriptor->buffer_start_address = buffer_descriptor->ptrBufferStart = new_memory;
        buffer_descriptor->ptrBufferEnd = (new_memory + ptrQueueDimensions->RxQueueSize);
    }
    #endif
    #if defined USB_DMA_TX && defined USB_RAM_START
    if ((ptrQueueDimensions->TxQueueSize != 0) && (ptQueID->output_buffer_control != 0)) {
        DMA_DESCRIPTOR_ISO *buffer_descriptor;
        unsigned long *ptrDMA_desc = (unsigned long *)USB_RAM_START;
        if (NO_MEMORY == (new_memory = (unsigned char *)uMallocUSB(ptrQueueDimensions->TxQueueSize))) {
            return (NO_MEMORY);
        }

        ptQueID->output_buffer_control->buffer_end = ptQueID->output_buffer_control->QUEbuffer = (unsigned char *)new_memory;
        ptQueID->output_buffer_control->get = new_memory;
        ptQueID->output_buffer_control->put = new_memory;
      //ptQueID->output_buffer_control->chars = 0;
        ptQueID->output_buffer_control->buffer_end += ptrQueueDimensions->TxQueueSize;
        ptQueID->output_buffer_control->buf_length = ptrQueueDimensions->TxQueueSize;

        if (usb_endpoint_queue->ucPaired_IN != 0) {
            ptrDMA_desc += ((usb_endpoint_queue->ucPaired_IN * 2) + 1);
        }
        else {
            ptrDMA_desc += ((usb_endpoint_queue->ucEndpointNumber * 2) + 1);
        }
        buffer_descriptor = (DMA_DESCRIPTOR_ISO *)uMallocUSB(sizeof(DMA_DESCRIPTOR_ISO)); // allocate a first descriptor for this endpoint
        *(CAST_POINTER_ARITHMETIC *)_putUSB_RAM((unsigned char *)ptrDMA_desc) = (CAST_POINTER_ARITHMETIC)buffer_descriptor;
        buffer_descriptor->dma_mode_status = (usb_endpoint_queue->usMax_frame_length << 5);
        buffer_descriptor->ptrBufferStart = new_memory;
        buffer_descriptor->ptrBufferEnd = (new_memory + ptrQueueDimensions->TxQueueSize);
        buffer_descriptor->next_dd_pointer = (unsigned long)uMallocUSB(sizeof(DMA_DESCRIPTOR_ISO)); // allocate a second descriptor for this endpoint to allow warapping from circular buffer
        buffer_descriptor = (DMA_DESCRIPTOR_ISO *)buffer_descriptor->next_dd_pointer;
        buffer_descriptor->dma_mode_status = (usb_endpoint_queue->usMax_frame_length << 5);
        buffer_descriptor->buffer_start_address = buffer_descriptor->ptrBufferStart = new_memory;
        buffer_descriptor->ptrBufferEnd = (new_memory + ptrQueueDimensions->TxQueueSize);
    }
    #endif
    return 1;
}


    #if defined USB_DMA_TX && defined USB_RAM_START
// Start DMA transmission from USB buffer - called with disabled interrupts
//
extern QUEUE_TRANSFER fnPrepareUSBOutData(USBQUE *ptrQueue, unsigned short usLength, int iEndpoint, USB_HW *ptrUSB_HW)
{
    DMA_DESCRIPTOR_ISO *buffer_descriptor;
    unsigned long ulEndpointFlag = (0x00000001 << ((iEndpoint * 2) + 1));
    unsigned long *ptrDMA_desc = (unsigned long *)USB_RAM_START;
    ptrDMA_desc += ((iEndpoint * 2) + 1);
    buffer_descriptor = (DMA_DESCRIPTOR_ISO *)*(unsigned long *)_putUSB_RAM((unsigned char *)ptrDMA_desc);
    buffer_descriptor->dd_mode_status = 0;
    USBNDDRIntClr = ulEndpointFlag;
    buffer_descriptor->buffer_start_address = ptrQueue->USB_queue.get;
    buffer_descriptor->dma_mode_status &= ~(DD_PRESENT_DMA_COUNT | NEXT_DD_VALID);
    if ((ptrQueue->USB_queue.get + usLength) <= ptrQueue->USB_queue.buffer_end) { // single DMA descriptor can be used
        buffer_descriptor->dma_mode_status |= (usLength << 16);
    }
    else {
        ((DMA_DESCRIPTOR_ISO *)(buffer_descriptor->next_dd_pointer))->buffer_start_address = buffer_descriptor->ptrBufferStart;
        ((DMA_DESCRIPTOR_ISO *)(buffer_descriptor->next_dd_pointer))->dma_mode_status = (buffer_descriptor->dma_mode_status | ((((unsigned short)((ptrQueue->USB_queue.get + usLength) - ptrQueue->USB_queue.buffer_end) << 16))));
        ((DMA_DESCRIPTOR_ISO *)(buffer_descriptor->next_dd_pointer))->dd_mode_status = 0;
        buffer_descriptor->dma_mode_status |= ((((unsigned short)(ptrQueue->USB_queue.buffer_end - ptrQueue->USB_queue.get)) << 16) | NEXT_DD_VALID);        
    }
    USBEpDMAEn = ulEndpointFlag;
    USBDMARSet = ulEndpointFlag;                                         // trigger DMA transmission
    return usLength;
}
    #endif
#endif


// USB command 
//
extern void fnUSB_command(unsigned long ulUSB_CMD, unsigned long ulCommandData)
{
    USBCmdCode = ulUSB_CMD;
    while (!(USBDevIntSt & DEVICE_STATUS_CCEMPT)) {
#ifdef _WINDOWS
        USBDevIntSt |= DEVICE_STATUS_CCEMPT;
#endif
    }
    USBDevIntClr = (DEVICE_STATUS_CCEMPT);
    if (ulCommandData != 0) {                                            // optional data phase
        USBCmdCode = ulCommandData;
        while (!(USBDevIntSt & DEVICE_STATUS_CCEMPT)) {
    #ifdef _WINDOWS
            USBDevIntSt |= DEVICE_STATUS_CCEMPT;
    #endif
        }
        USBDevIntClr = (DEVICE_STATUS_CCEMPT);
    }
#ifdef _WINDOWS                                                          // interpret the command
    fnUSB_command_command(ulUSB_CMD, ulCommandData);
#endif
}


// USB status read 
//
static unsigned char fnUSB_status(unsigned long ulUSB_CMD, unsigned long ulCommandData)
{
    USBCmdCode = ulUSB_CMD;
    while (!(USBDevIntSt & DEVICE_STATUS_CCEMPT)) {
#ifdef _WINDOWS
        USBDevIntSt |= DEVICE_STATUS_CCEMPT;
#endif
    }
    USBDevIntClr = (DEVICE_STATUS_CCEMPT | DEVICE_STATUS_CDFULL);
    USBCmdCode = ulCommandData;
    while (!(USBDevIntSt & DEVICE_STATUS_CCEMPT)) {
#ifdef _WINDOWS
        USBDevIntSt |= DEVICE_STATUS_CCEMPT;
#endif
    }
    USBDevIntClr = (DEVICE_STATUS_CCEMPT);
    while (!(USBDevIntSt & DEVICE_STATUS_CDFULL)) {
#ifdef _WINDOWS
        USBDevIntSt |= DEVICE_STATUS_CDFULL;
#endif
    }
#ifdef _WINDOWS                                                          // interpret the command
    USBCmdData = fnUSB_command_interpreter(ulUSB_CMD, ulCommandData);
#endif
    return (unsigned char)USBCmdData;
}



//static USB_END_POINT *usb_endpoints;


// This routine handles all SETUP and OUT frames. It can send an empty data frame if required by control endpoints or stall on errors.
// It usually clears the handled input buffer when complete, unless the buffer is specified to remain owned by the processor.
//
static int fnProcessInput(int iEndpoint_ref, USB_HW *ptrUSB_HW, unsigned char ucFrameType)
{
    switch (fnUSB_handle_frame(ucFrameType, (unsigned char *)ptrUSB_HW->ptrDatBuffer, iEndpoint_ref, ptrUSB_HW)) { // generic handler routine
    case TERMINATE_ZERO_DATA:                                            // send zero data packet to complete status stage of control transfer
        FNSEND_ZERO_DATA(ptrUSB_HW, iEndpoint_ref);
        break;
    case MAINTAIN_OWNERSHIP:                                             // don't free the buffer - the application will do this later
        iInterruptLevel = 0;
        return MAINTAIN_OWNERSHIP;
    case STALL_ENDPOINT:                                                 // send stall
        if (iEndpoint_ref == 0) {                                        // check whether control 0 endpoint
            fnUSB_command((USB_CMD_SET_EP_STATUS | (1 << 16)), USB_CMD_SET_EP_STATUS_STALL); // stall the control endpoint - this will be automatically cleard by next SETUP token
        }
        else {                                                           // assume IN endpoint is always one higher than OUT endpoint
            iEndpoint_ref = fnGetPairedIN(iEndpoint_ref, 0);
            fnUSB_command((USB_CMD_SET_EP_STATUS | (((iEndpoint_ref * 2) + 1) << 16)), USB_CMD_SET_EP_STATUS_STALL); // stall the IN endpoint
            fnSetUSBEndpointState(iEndpoint_ref, USB_ENDPOINT_STALLED, 0); // mark that the endpoint is stalled
        }
        _SIM_USB(0, USB_SIM_STALL, iEndpoint_ref, ptrUSB_HW);
        break;
    case CRITICAL_OUT:
        ulEndpointPriorities |= (0x00000001 << (iEndpoint_ref * 2));
        USBEpIntPri = ulEndpointPriorities;                              // move the endpoint interrupt to fast priority, which is disabled
        break;
    }
    return 0;
}


static void fnUSB_reset(int iInitialise)
{
    _USBMaxPSize(0, ENDPOINT_0_SIZE);                                    // set the size of logical control endpoint 0
    _USBMaxPSize(1, ENDPOINT_0_SIZE);
    USBEpIntClr     = ALL_ENDPOINTS;                                     // clear all physical endpoint interrupts
    USBDevIntClr    = ALL_USED_USB_INTERRUPTS;                           // clear all device interrupts
#if (defined USB_DMA_RX || defined USB_DMA_TX) && defined USB_RAM_START  // {28} if the processor supports DMA activate it
    USBDMAIntEn     = 0;
    if (iInitialise != 0) {
        USBUDCAH = USB_RAM_START;                                        // set head to start of USB RAM, which is automatically aligned to 128 bytes
        uMallocUSB(32 * sizeof(unsigned long));                          // allocate DMA descriptors for each physical endpoint
    }
    USBEpDMADis     = DMA_ENDPOINTS;                                     // disable DMA operation on all DMA capable endpoints
    USBDMARClr      = DMA_ENDPOINTS;                                     // clear and pending DMA requests
    USBEoTIntClr    = ALL_ENDPOINTS;
    USBNDDRIntClr   = ALL_ENDPOINTS;
    USBSysErrIntClr = ALL_ENDPOINTS;
#endif
    USBEpIntEn      = (EP0RX | EP0TX);                                   // enable interrupts on the control endpoint
    USBDevIntEn     = (ALL_USED_USB_INTERRUPTS & ~DEVICE_STATUS_EP_FAST);// enable used device interrupts
}

// Read FIFO input to a buffer
//
static void fnReadUSB(unsigned char *ptrBuffer, unsigned short usLength)
{
    register unsigned long ulTemp;
    while (1) {
        ulTemp = fnGetUSB_from_FIFO();
        *ptrBuffer++ = (unsigned char)ulTemp;
        *ptrBuffer++ = (unsigned char)(ulTemp >> 8);
        *ptrBuffer++ = (unsigned char)(ulTemp >> 16);
        *ptrBuffer++ = (unsigned char)(ulTemp >> 24);
        if (usLength <= 4) {
            break;
        }
        usLength -= 4;
    }
}


// USB Device interrupt handler
//
static __interrupt void USB_Interrupt(void)
{
    static USB_HW usb_hardware = {0};
    iInterruptLevel = 1;                                                 // ensure interrupts remain blocked when putting message to queue
#if (defined USB_DMA_TX || defined USB_DMA_RX) && defined USB_RAM_START  // {28}
    while (USBDMAIntSt & USBDMAIntEn) {                                  // DMA interrupts given precedence 
        if (USBDMAIntSt & USB_DMA_EOT) {
            register unsigned long ulEndpoints = USBEoTIntSt;
            register unsigned long ulRequest = 0x00000004;               // first possible DMA reques
            register int iEndpoint = 2;
            unsigned long *ptrDMA_desc = (unsigned long *)(USB_RAM_START + 8);
    #if defined USB_DMA_RX
            DMA_DESCRIPTOR_ISO *buffer_descriptor;
            unsigned short usRxLength;
    #endif
            while (ulEndpoints != 0) {
    #if defined USB_DMA_RX
                if (ulRequest & ulEndpoints) {                           // OUT endpoints
                    USBEoTIntClr = ulRequest;                            // clear the request
        #ifdef _WINDOWS
                    USBEoTIntSt &= ~USBEoTIntClr; USBEoTIntClr = 0;
        #endif
                    ulEndpoints &= ~ulRequest;
                    buffer_descriptor = (DMA_DESCRIPTOR_ISO *)*(unsigned long *)_putUSB_RAM((unsigned char *)ptrDMA_desc);
                    usRxLength = (unsigned short)(buffer_descriptor->dd_mode_status >> 16);
                    fnEndpointData((iEndpoint/2), 0, usRxLength, OUT_DATA_RECEPTION);
                    buffer_descriptor->dma_mode_status &= ~DD_PRESENT_DMA_COUNT;
                    if (buffer_descriptor->ptrBufferEnd == buffer_descriptor->buffer_start_address) {
                        buffer_descriptor->buffer_start_address = buffer_descriptor->ptrBufferStart;
                    }
                    usRxLength = (unsigned short)(buffer_descriptor->ptrBufferEnd - buffer_descriptor->buffer_start_address);
                    buffer_descriptor->dma_mode_status |= (usRxLength << 16);
                    buffer_descriptor->dd_mode_status = 0;               // allow the DMA descriptor to be re-used
                }
    #endif
                ulRequest <<= 1;
                iEndpoint++;
                ptrDMA_desc++;
    #if defined USB_DMA_TX
                if (ulRequest & ulEndpoints) {                           // IN endpoints
                    USBEoTIntClr = ulRequest;                            // clear the request
        #ifdef _WINDOWS
                    USBEoTIntSt &= ~USBEoTIntClr; USBEoTIntClr = 0;
        #endif
                    ulEndpoints &= ~ulRequest;
                  //fnUSB_handle_frame(USB_TX_ACKED, 0, (iEndpoint/2), &usb_hardware);
                }
                ulRequest <<= 1;
                iEndpoint++;
                ptrDMA_desc++;
    #endif
            }
    #ifdef _WINDOWS
            USBDMAIntSt = 0;
    #endif
        }
    }
#endif
    while (USBDevIntSt & USBDevIntEn) {                                  // while enabled device interrupts pending
        if (DEVICE_STATUS_DEV_STAT & USBDevIntSt) {
            unsigned char ucDeviceStatus;
            USBDevIntClr = DEVICE_STATUS_DEV_STAT;
    #ifdef _WINDOWS
            USBDevIntSt &= ~USBDevIntClr; USBDevIntClr = 0;
    #endif
            ucDeviceStatus = fnUSB_status(USB_CMD_GET_DEVICE_STATUS, USB_CMD_GET_DEVICE_STATUS_DATA_PHASE);
            if (ucDeviceStatus & USB_STATUS_RST) {                       // reset detected
                fnUSB_reset(0);
                fnUSB_handle_frame(USB_RESET_DETECTED, 0, 0, &usb_hardware);// generic handler routine
                usb_hardware.ucUSBAddressValid = 0;
                usb_hardware.ucUSBAddress = 0;
            }
            else if (ucDeviceStatus & USB_STATUS_SUS_CH) {               // suspend state changed
                if (ucDeviceStatus & USB_STATUS_SUS) {                   // suspended -  - 3ms of idle USB bus detected (low speed D+ = 0, D- = 1 / high speed D+ = 1, D- = 0)
                    fnUSB_handle_frame(USB_SUSPEND_DETECTED, 0, 0, 0);   // generic handler routine
                }
                else {                                                   // resume - 10ms inverted idle USB bus state (low speed D+ = 1, D- = 0 / high speed D+ = 0, D- = 1)
                    fnUSB_handle_frame(USB_RESUME_DETECTED, 0, 0, 0);    // generic handler routine
                }
            }
            else if (ucDeviceStatus & USB_STATUS_COM_CH) {               // connection state changed
                if (ucDeviceStatus & USB_STATUS_COM) {                   // connected
                }
                else {                                                   // disconnected
                }
            }
        }
        else if ((/*DEVICE_STATUS_EP_FAST | */DEVICE_STATUS_EP_SLOW) & USBDevIntSt) {
            register unsigned long ulEndpoints = USBEpIntSt;
            register unsigned long ulEndpoint = 0x00000001;
            register unsigned long ulEndpointRef = 0x00000000;
            int iEndpointNumber = 0;
            unsigned char uctype;
            while (ulEndpoints != 0) {
                if (ulEndpoints & ulEndpoint) {                          // OUT endpoint
                    uctype = fnUSB_status((USB_CMD_SELECT_EP | ulEndpointRef), (USB_CMD_SELECT_EP_DATA_PHASE | ulEndpointRef));
                    USBEpIntClr = ulEndpoint;
#ifdef _WINDOWS
                    USBEpIntSt &= ~USBEpIntClr; USBEpIntClr = 0;
#endif
                    ulEndpoints &= ~ulEndpoint;
                    if (ulEndpointRef == 0) {                            // OUT on control endpoint 0
                        unsigned long ulLength;
                        unsigned char ucRxData[64];

                        USBCtrl = CTRL_RD_EN;// ((0/*EPNum*/ & 0x0f) << 2) | CTRL_RD_EN; // enable read on the endpoint input buffer
                        do {
                            ulLength = USBRxPLen;
                        } while ((ulLength & PKT_RDY) == 0);
                        ulLength &= (PKT_LENGTH_MASK);
                        fnReadUSB(ucRxData, (unsigned short)ulLength);
                        USBCtrl = 0;                                 // disable endpoint read
                        USBCmdCode = USB_CMD_CLEAR_EP_BUFFER;
                        while (!(USBDevIntSt & DEVICE_STATUS_CCEMPT)) {
#ifdef _WINDOWS
                            USBDevIntSt |= DEVICE_STATUS_CCEMPT;
#endif
                        }
                        USBDevIntClr = (DEVICE_STATUS_CCEMPT);
                        usb_hardware.ptrDatBuffer = ucRxData;
                        usb_hardware.usLength = (unsigned short)ulLength;
                        if (uctype & USB_EP_SETUP_PACKET_RECEIVE) {      // setup packet received
                            if (fnProcessInput(0, &usb_hardware, USB_SETUP_FRAME) != MAINTAIN_OWNERSHIP) {
//                                usb_endpoints[0].ulNextRxData0 |= (RX_DATA_TOGGLE);
                            }
                        }
                        else {
                            if (fnProcessInput(0, &usb_hardware, USB_OUT_FRAME) != MAINTAIN_OWNERSHIP) {
//                                usb_endpoints[0].ulNextRxData0 |= (RX_DATA_TOGGLE);
                            }
                        }
                    }
                    else {
                        unsigned long ulLength;
                        unsigned char ucRxData[64];

                        USBCtrl = ((iEndpointNumber << 2) | CTRL_RD_EN); // enable read on the endpoint input buffer
                        do {
                            ulLength = USBRxPLen;
                        } while ((ulLength & PKT_RDY) == 0);
                        ulLength &= (PKT_LENGTH_MASK);
                        fnReadUSB(ucRxData, (unsigned short)ulLength);   // read the data out of the FIFO to a temporary buffer
                        USBCtrl = 0;                                     // disable endpoint read
                        USBCmdCode = USB_CMD_CLEAR_EP_BUFFER;            // free the buffer for further use
                        while (!(USBDevIntSt & DEVICE_STATUS_CCEMPT)) {
#ifdef _WINDOWS
                            USBDevIntSt |= DEVICE_STATUS_CCEMPT;
#endif
                        }
                        USBDevIntClr = (DEVICE_STATUS_CCEMPT);
                        usb_hardware.ptrDatBuffer = ucRxData;
                        usb_hardware.usLength = (unsigned short)ulLength;

