sWahlinRhoades/uTaskerModified/Hardware/LPC2XXX/LPC23XX.c
                        if (fnProcessInput(iEndpointNumber, &usb_hardware, USB_OUT_FRAME) != MAINTAIN_OWNERSHIP) {
//                          usb_endpoints[0].ulNextRxData0 |= (RX_DATA_TOGGLE);
                        }
                    }
                }
                ulEndpoint <<= 1;                                        // move to IN endpoint
                ulEndpointRef += EP_INC;                                 // increment endpoint reference in command
                if (ulEndpoints & ulEndpoint) {                          // IN endpoint
                    uctype = fnUSB_status((USB_CMD_SELECT_EP | ulEndpointRef), (USB_CMD_SELECT_EP_DATA_PHASE | ulEndpointRef));
                    USBEpIntClr = ulEndpoint;
#ifdef _WINDOWS
                    USBEpIntSt &= ~USBEpIntClr; USBEpIntClr = 0;
#endif
                    ulEndpoints &= ~ulEndpoint;

#if defined USB_DMA_TX                                                   // {28}
                    if (iEndpointNumber == 0) {
                        fnUSB_handle_frame(USB_TX_ACKED, 0, iEndpointNumber, &usb_hardware); // handle ack event
                        if ((usb_hardware.ucUSBAddressValid == 0) && (usb_hardware.ucUSBAddress != 0)) { // if a new address is waiting program it now
                            fnUSB_command(USB_CMD_SET_ADDRESS, _USB_CMD_DATA((usb_hardware.ucUSBAddress | DEV_EN), USB_CMD_SET_ADDRESS_DATA_PHASE)); // set address
                            fnUSB_command(USB_CMD_SET_ADDRESS, _USB_CMD_DATA((usb_hardware.ucUSBAddress | DEV_EN), USB_CMD_SET_ADDRESS_DATA_PHASE)); // set address with immediate effect
                            usb_hardware.ucUSBAddressValid = 1;
                        }
                    }
                    else {
                        fnUSB_handle_frame(USB_TX_ACKED, 0, iEndpointNumber, &usb_hardware);
                    }
#else
                    fnUSB_handle_frame(USB_TX_ACKED, 0, iEndpointNumber, &usb_hardware); // handle ack event
                    if ((usb_hardware.ucUSBAddressValid == 0) && (usb_hardware.ucUSBAddress != 0)) { // if a new address is waiting program it now
                        fnUSB_command(USB_CMD_SET_ADDRESS, _USB_CMD_DATA((usb_hardware.ucUSBAddress | DEV_EN), USB_CMD_SET_ADDRESS_DATA_PHASE)); // set address
                        fnUSB_command(USB_CMD_SET_ADDRESS, _USB_CMD_DATA((usb_hardware.ucUSBAddress | DEV_EN), USB_CMD_SET_ADDRESS_DATA_PHASE)); // set address with immediate effect
                        usb_hardware.ucUSBAddressValid = 1;
                    }
#endif
                }
                ulEndpoint <<= 1;                                        // move to OUT endpoint
                ulEndpointRef += EP_INC;                                 // increment endpoint reference in command
                iEndpointNumber++;
            }
            USBDevIntClr = (/*DEVICE_STATUS_EP_FAST | */DEVICE_STATUS_EP_SLOW);
#ifdef _WINDOWS
            USBDevIntSt &= ~USBDevIntClr; USBDevIntClr = 0;
#endif
        }
    }
    iInterruptLevel = 0;
    acknowledge_irq();                                                   // required on exit of all irqs
}

// USB Configuration
//
extern void fnConfigUSB(QUEUE_HANDLE Channel, USBTABLE *pars)
{
    POWER_UP(PCUSB);                                                     // power up the USB controller module
#ifdef _LPC214X
    // Configure PLL1 for 48MHz
    //
    PLL1CFG = PLL_USB_FREQUENCY_CONFIGURATION;                           // PLL setting to generate required frequency
    PLL1FEED = 0xaa;PLL1FEED = 0x55;                                     // perform feed sequence so that register changes are accepted
    PLL1CON = PLLE;                                                      // enable the PLL to search for lock
    PLL1FEED = 0xaa;PLL1FEED = 0x55;                                     // perform feed sequence so that register changes are accepted
    while (!(PLL1STAT & PLLLOCKED)) {                                    // wait for lock to be achieved
    #ifdef _WINDOWS
        PLL1STAT |= PLLLOCKED;
    #endif
    }
    PLL1CON = (PLLE | PLLC);                                             // connect PLL to clock CPU
    PLL1FEED = 0xaa;PLL1FEED = 0x55;                                     // perform feed sequence so that register changes are accepted
    PINSEL1 |= (PINSEL1_P0_23_VBUS | PINSEL1_P0_31_CONNECT);             // select VBUS and soft connect functions
#else
    USBCLKCFG = USB_FREQUENCY_CONFIGURATION;                             // set 48MHz USB clock
    while (USBClkCtrl != (DEV_CLK_EN | AHB_CLK_EN)) {                    // enable device controller clocks
        USBClkCtrl = (DEV_CLK_EN | AHB_CLK_EN);
    }
    #if defined _LPC24XX || defined LPC2378FBD144
    USBClkCtrl |= PORTSEL_CLK_EN;                                        // enable selection of USB port
    if (pars->usConfig & USB_ALT_PORT_MAPPING) {                         // use USB 2 mapping instead of USB 1 mapping
        USBPortSel = PORT_SELECT_MAP_TO_2;
        #ifdef LPC23XX_REV_0
        PINSEL0 |= (PINSEL0_P0_13_USB_UP_LED2);
        #else
        PINSEL0 |= (PINSEL0_P0_13_USB_UP_LED2 | PINSEL0_P0_14_USB_CONNECT2);
        #endif
        PINSEL3 |= (PINSEL3_P1_30_VBUS);                                 // select VBUS, UP_LED and soft connect functions
        PINSEL1 |= (PINSEL1_P0_31_U2D_PLUS);                             // select USB pins (note that U2D- is a dedicated pin on the 144 pin package)
    }
    else {                                                               // use USB 1
        USBPortSel = PORT_SELECT_MAP_TO_1;
        PINSEL3 |= (PINSEL3_P1_30_VBUS | PINSEL3_P1_18_USB_UP_LED1);     // select VBUS, UP_LED and soft connect functions
        #ifndef LPC23XX_REV_0
        PINSEL4 |= (PINSEL4_P2_9_USB_CONNECT1);
        #endif
        PINSEL1 |= (PINSEL1_P0_29_U1D_PLUS | PINSEL1_P0_30_U1D_MINUS);   // select USB pins
    }
    PINMODE3 |= PINMODE_NO_PULLS_30;                                     // disable pull-up/downs on the VBUS pin
    USBClkCtrl &= ~PORTSEL_CLK_EN;
    #else
    PINSEL3 |= (PINSEL3_P1_30_VBUS | PINSEL3_P1_18_USB_UP_LED1);         // select VBUS, UP_LED and soft connect functions
    PINMODE3 |= PINMODE_NO_PULLS_30;                                     // disable pull-up/downs on the VBUS pin
        #ifndef LPC23XX_REV_0
    PINSEL4 |= (PINSEL4_P2_9_USB_CONNECT1);
        #endif
    PINSEL1 |= (PINSEL1_P0_29_U1D_PLUS | PINSEL1_P0_30_U1D_MINUS);       // select UDB pins
    #endif
#endif
    if (++pars->ucEndPoints > NUMBER_OF_USB_ENDPOINTS) {                 // add endpoint 0
        pars->ucEndPoints = NUMBER_OF_USB_ENDPOINTS;                     // limit to maximum available in device
    }
//  usb_endpoints = uMalloc((MAX_MALLOC)(sizeof(USB_END_POINT) * pars->ucEndPoints)); // get zeroed endpoint control structures
    fnUSB_reset(1);
    fnSetIntHandler(INTERRUPT_USB, USB_PRIORITY, (unsigned long)USB_Interrupt);
    USBDevIntClr = (DEVICE_STATUS_CCEMPT | DEVICE_STATUS_CDFULL);
    fnUSB_command(USB_CMD_SET_DEVICE_STATUS, _USB_CMD_DATA(USB_STATUS_COM, USB_CMD_SET_DEVICE_STATUS_DATA_PHASE)); // assert the SoftConnect pin
                                                                                                                   
                                                                         // if USB connect function doesn't work (eg. initial LPC23XX) control via port - or overwrite anything necessary
    if (pars->usConfig & USB_FULL_SPEED) {                               // the following is optional in case ports are used to control pull ups and pull downs
        ENABLE_DPLUS_PULLUP();                                           // enable pull up on D+ for full speed operation
    }
    else {
        ENABLE_DMINUS_PULLDOWN();                                        // enable pull up on D- for low speed operation
    }
}

// Set the transmit control and buffer to next active one and check whether it is free
//
extern int fnGetUSB_HW(int iEndpoint, USB_HW *ptr_usb_hardware)
{
    unsigned char ucEndpointState;
    unsigned long ulEndpointRef = (((iEndpoint * 2) + 1) << 16);         // set to physical IN endpoint   
    ucEndpointState = fnUSB_status((USB_CMD_SELECT_EP | ulEndpointRef), (USB_CMD_SELECT_EP_DATA_PHASE | ulEndpointRef));
    if (ucEndpointState & USB_EP_FULL_EMPTY) {
        return ENDPOINT_NOT_FREE;                                        // the endpoint buffer(s) are full so no more data can be added
    }
    ptr_usb_hardware->ptr_ulUSB_BDControl = 0;   //??                    // set the corresponding control address
    ptr_usb_hardware->ptrDatBuffer = 0; // ?? fnGetUSB_FIFOAdd((volatile unsigned char *)(ptrCtr + ((UDP_FDR0_ADD - (volatile unsigned char *)UDP_CSR0_ADD)/sizeof(unsigned long))), 1); // and the FIFO address
    return ENDPOINT_FREE;
}

// Copy the data to be transmitted to the FIFO. This may only be called when there is a buffer to accept the data
//
extern void fnSendUSB_FIFO(unsigned char *ptrData, unsigned short usLength, int iEndpoint, USB_HW *ptrUSB_HW)
{
    int n;
    unsigned long ulTemp;

    USBCtrl = ((iEndpoint & 0x0F) << 2) | CTRL_WR_EN;

