sWahlinRhoades/uTaskerModified/Hardware/LPC2XXX/LPC23XX.c
    USBTxPLen = usLength;

    for (n = 0; n < (usLength + 3) / 4; n++) {
        ulTemp = *ptrData++;
        ulTemp |= (*ptrData++ << 8);
        ulTemp |= (*ptrData++ << 16);
        ulTemp |= (*ptrData++ << 24);
        USBTxData = ulTemp;
    }

    USBCtrl = 0;

    iEndpoint *= 2;
    iEndpoint++;
    iEndpoint <<= 16;

    fnUSB_command((USB_CMD_SELECT_EP | iEndpoint), 0);                   // command with no data phase
    fnUSB_command(USB_CMD_VALID_EP_BUFFER, 0);                           // command with no data phase
}

// The hardware interface used to activate/deactivate USB endpoints
//
extern void fnActivateHWEndpoint(unsigned char ucEndpointType, unsigned char ucEndpointRef, unsigned short usEndpointLength, unsigned short usMaxEndpointLength)
{
    unsigned long ulEndpointInterrupt = (EP0RX << (2 * ucEndpointRef));
    if (ucEndpointType & IN_ENDPOINT) {
        ulEndpointInterrupt <<= 1;
    }
    if (ENDPOINT_DISABLE == ucEndpointType) {
#if (defined USB_DMA_TX || defined USB_DMA_RX) && defined USB_RAM_START  // {28}
        USBEpDMADis = ulEndpointInterrupt;                               // disable DMA operation on the endpoint
    #ifdef _WINDOWS
        USBEpDMASt &= ~USBEpDMADis; USBEpDMADis = 0;
    #endif
        if (USBEpDMASt == 0) {                                           // if no more DMA channels enabled
            USBDMAIntEn = 0;                                             // disable DMA interrupts
        }
#else
        USBEpIntEn &= ~ulEndpointInterrupt;                              // disable interrupts on the endpoint
        USBReEp &= ~ulEndpointInterrupt;
#endif
        fnUSB_command(USB_CMD_CONFIG_DEVICE, USB_CMD_CONFIG_DEVICE_DATA_PHASE_DIS);
        return;
    }
    else {
        unsigned long ulEndpoint = (2 * ucEndpointRef);
        USBReEp |= ulEndpointInterrupt;                                  // realise the endpoint
        if (ucEndpointType & IN_ENDPOINT) {
            ulEndpoint++;
        }
        _USBMaxPSize(ulEndpoint, usEndpointLength);                      // set the size of physical endpoints
        fnUSB_command((USB_CMD_SET_EP_STATUS | (ulEndpoint << 16)), USB_CMD_SET_EP_STATUS_DATA_PHASE); // clear status
#if defined USB_DMA_RX && defined USB_RAM_START                          // {28} DMA on reception
        if (!(ucEndpointType & IN_ENDPOINT)) {                           // OUT endpoint
            USBEpDMAEn = ulEndpointInterrupt;                            // enable DMA operation on the endpoint
    #ifdef _WINDOWS
            USBEpDMASt |= USBEpDMAEn; USBEpDMAEn = 0;
    #endif
            USBDMAIntEn = USB_DMA_EOT;                                   // enable interrupt when a DMA descriptor has been used
            _SIM_USB(0, USB_SIM_ENUMERATED, 0, 0);                       // inform the simulator that USB enumeration has completed
            return;
        }
#endif
#if defined USB_DMA_TX && defined USB_RAM_START                          // DMA on transmission
        if (ucEndpointType & IN_ENDPOINT) {                              // OUT endpoint
          //USBEpDMAEn = ulEndpointInterrupt;                            // enable DMA operation on the endpoint
    #ifdef _WINDOWS
          //USBEpDMASt |= USBEpDMAEn; USBEpDMAEn = 0;
    #endif
            USBDMAIntEn = USB_DMA_EOT;                                   // enable interrupt when a DMA descriptor has been used
          //_SIM_USB(0, USB_SIM_ENUMERATED, 0, 0);                       // inform the simulator that USB enumeration has completed
          //return;
        }
#endif
        USBEpIntClr = ulEndpointInterrupt;                               // clear pending interrupts when this endpoint i soperating in slave mode
        USBEpIntEn |= ulEndpointInterrupt;                               // enable interrupts on the endpoint
        _SIM_USB(0, USB_SIM_ENUMERATED, 0, 0);                           // inform the simulator that USB enumeration has completed
        return;
    }
}

// When the clear feature is received for a stalled endpoint it is cleared in the hardware by calling this routine
//
extern void fnUnhaltEndpoint(unsigned char ucEndpoint)                   // {42}
{
    unsigned long ulCommand;
    if (ucEndpoint & IN_ENDPOINT) {
        ucEndpoint <<= 1;                                                // multiply the endpoint number by 2 and also shift out the IN_ENDPOINT flag
        ulCommand = (USB_CMD_SET_EP_STATUS | ((ucEndpoint + 1) << 16));  // IN endpoint
    }
    else {
        ucEndpoint <<= 1;                                                // multiply the endpoint number by 2 and also shift out the IN_ENDPOINT flag
        ulCommand = (USB_CMD_SET_EP_STATUS | (ucEndpoint << 16));        // OUT endpoint
    }
    fnUSB_command(ulCommand, USB_CMD_SET_EP_STATUS_ENABLE_EP);           // uninstall the IN endpoint (control endpoints are automatically unstalled shen a SETUP token is received)
}



#ifdef _WINDOWS
// Request an endpoint buffer size
//
extern unsigned short fnGetEndpointInfo(int iEndpoint)
{
    return usEndpointSizes[iEndpoint * 2];
}
#endif

#endif


#ifdef SUPPORT_PORT_INTERRUPTS                                           // {4}
static void ( *gpio_handlers_0[32] )( void ) = {0};                      // a handler for each possible port 0 pin
#ifdef _LPC24XX
    static void ( *gpio_handlers_2[32] )( void ) = {0};                  // {19} a handler for each possible port 2 pin
#else
    static void ( *gpio_handlers_2[14] )( void ) = {0};                  // a handler for each possible port 2 pin
#endif

// This routine enters the user handler for a port interrupt. The handler can be assigned to multiple inputs
//
static void fnEnterHandler(unsigned long ulPortRef, unsigned long ulPortBits, void ( *int_handler )( void ))
{
    int port_bit = 0;
    unsigned long ulBit = 0x00000001;
    while (ulPortBits >= ulBit) {
        if (ulPortBits & ulBit) {
            if (ulPortRef == PORT_2) {
                gpio_handlers_2[port_bit] = int_handler;                 // enter the application handler
            }
            else {
                gpio_handlers_0[port_bit] = int_handler;                 // enter the application handler
            }
            ulPortBits &= ~ulBit;
        }
        ulBit <<= 1;
        port_bit++;
    }
}
#endif

#if (defined SUPPORT_EXTERNAL_INTERRUPTS && defined SUPPORT_EINT0)
static void ( *eint0_handler )( void ) = 0;                              // a handler for external interrupt 0
static __interrupt void EINT0_Interrupt(void)
{
    #ifdef _WINDOWS
    EXTINT &= ~EINT0;
    #else
    EXTINT = EINT0;                                                      // clear the interrupt flag so that further events are detected (only clears in edge mode)
    #endif
    iInterruptLevel = 1;
    eint0_handler();                                                     // call the user handler
    iInterruptLevel = 0;
    acknowledge_irq();                                                   // required on exit of all irqs
}
#endif

#if (defined SUPPORT_EXTERNAL_INTERRUPTS && defined SUPPORT_EINT1)
static void ( *eint1_handler )( void ) = 0;                              // a handler for external interrupt 0
static __interrupt void EINT1_Interrupt(void)
{
    #ifdef _WINDOWS
    EXTINT &= ~EINT1;
    #else
    EXTINT = EINT1;                                                      // clear the interrupt flag so that further events are detected (only clears in edge mode)
    #endif
    iInterruptLevel = 1;
    eint1_handler();                                                     // call the user handler
    iInterruptLevel = 0;
    acknowledge_irq();                                                   // required on exit of all irqs
}
#endif

