sWahlinRhoades/uTaskerModified/Hardware/LPC2XXX/LPC23XX.c
#if (defined SUPPORT_EXTERNAL_INTERRUPTS && defined SUPPORT_EINT2)
static void ( *eint2_handler )( void ) = 0;                              // a handler for external interrupt 0
static __interrupt void EINT2_Interrupt(void)
{
    #ifdef _WINDOWS
    EXTINT &= ~EINT2;
    #else
    EXTINT = EINT2;                                                      // clear the interrupt flag so that further events are detected (only clears in edge mode)
    #endif
    iInterruptLevel = 1;
    eint2_handler();                                                     // call the user handler
    iInterruptLevel = 0;
    acknowledge_irq();                                                   // required on exit of all irqs
}
#endif

#if (defined SUPPORT_EXTERNAL_INTERRUPTS && defined SUPPORT_EINT3) || defined SUPPORT_PORT_INTERRUPTS
    #if (defined SUPPORT_EXTERNAL_INTERRUPTS && defined SUPPORT_EINT3)
static void ( *eint3_handler )( void ) = 0;                              // a handler for external interrupt 0
    #endif
// GPIO and EINT3 interrupt routine
//
static __interrupt void EINT3_Interrupt(void)
{
    #if defined SUPPORT_PORT_INTERRUPTS
    unsigned long ulInterrupts;
    unsigned long ulBit;
    int iInterrupt;
    #endif
    #if (defined SUPPORT_EXTERNAL_INTERRUPTS && defined SUPPORT_EINT3)
        #if defined SUPPORT_PORT_INTERRUPTS
    if (EXTINT & EINT3) {
        #endif
        #ifdef _WINDOWS
        EXTINT &= ~EINT3;
        #else
        EXTINT = EINT3;                                                  // clear the interrupt flag so that further events are detected (only clears in edge mode)
        #endif
        if (eint3_handler != 0) {
            iInterruptLevel = 1;
            eint3_handler();                                             // call the user handler
            iInterruptLevel = 0;
        }
        #if defined SUPPORT_PORT_INTERRUPTS
    }
        #endif
    #endif
    #if defined SUPPORT_PORT_INTERRUPTS
    if (IOIntStatus & P0int) {                                           // an interrupt from port 0 is pending
        ulInterrupts = IO0IntStatR;                                      // get rising edge interrupts on port 0
        ulInterrupts |= IO0IntStatF;                                     // also falling edge interrupts
        IO0IntClr = ulInterrupts;                                        // clear the ones which will be handled
        #ifdef _WINDOWS
        IO0IntStatR &= ~IO0IntClr;
        IO0IntStatF &= ~IO0IntClr;
        IO0IntClr = 0;
        IOIntStatus &= ~P0int;
        #endif
        ulBit = 0x00000001;
        iInterrupt = 0;
        while (ulInterrupts >= ulBit) {                                  // for each input change that has been detected on port 0
            if (ulInterrupts & ulBit) {                                  // an enabled input has changed
                iInterruptLevel = 1;
                (gpio_handlers_0[iInterrupt])();                         // call the application handler
                iInterruptLevel = 0;
                ulInterrupts &= ~ulBit;
            }
            iInterrupt++;
            ulBit <<= 1;
        }
    }
    if (IOIntStatus & P2int) {                                           // an interrupt from port 2 is pending
        ulInterrupts = IO2IntStatR;                                      // get rising edge interrupts on port 2
        ulInterrupts |= IO2IntStatF;                                     // also falling edge interrupts
        IO2IntClr = ulInterrupts;                                        // clear the ones which will be handled
        #ifdef _WINDOWS
        IO2IntStatR &= ~IO2IntClr;
        IO2IntStatF &= ~IO2IntClr;
        IO2IntClr = 0;
        IOIntStatus &= ~P2int;
        #endif
        ulBit = 0x00000001;
        iInterrupt = 0;
        while (ulInterrupts >= ulBit) {                                  // for each input change that has been detected on port 0
            if (ulInterrupts & ulBit) {                                  // an enabled input has changed
                iInterruptLevel = 1;
                (gpio_handlers_2[iInterrupt])();                         // call the application handler
                iInterruptLevel = 0;
                ulInterrupts &= ~ulBit;
            }
            iInterrupt++;
            ulBit <<= 1;
        }
    }
    #endif
    acknowledge_irq();                                                   // required on exit of all irqs
}
#endif

#if defined SUPPORT_TIMER
static void ( *timer_int[TIMERS_AVAILABLE] )( void ) = {0};

static __interrupt void timer_0_int(void)
{
    #if defined TICK_TIMER_1 || defined TICK_TIMER_2 || defined TICK_TIMER_3
    T0IR = MR0_INTERRUPT;                                                // clear match interrupt
        #ifndef _HW_TIMER_MODE
    T0TCR = COUNTER_RESET;                                               // reset timer to achieve single shot function
        #endif
    if (timer_int[0] != 0) {
        iInterruptLevel = 1;
        timer_int[0]();                                                  // call the user handler
        iInterruptLevel = 0;
    }
    acknowledge_irq();                                                   // required on exit of all irqs
   #endif
}

static __interrupt void timer_1_int(void)
{
    #if !defined TICK_TIMER_1
    T1IR = MR0_INTERRUPT;                                                // clear match interrupt
        #ifndef _HW_TIMER_MODE
    T1TCR = COUNTER_RESET;                                               // reset timer to achieve single shot function
        #endif
    if (timer_int[1] != 0) {
        iInterruptLevel = 1;
        timer_int[1]();                                                  // call the user handler
        iInterruptLevel = 0;
    }
    acknowledge_irq();                                                   // required on exit of all irqs
    #endif
}

    #if TIMERS_AVAILABLE > 2                                             // {22}                                                         // {22} LPC2148 has only timers 0 and 1
static __interrupt void timer_2_int(void)
{
        #if !defined TICK_TIMER_2
    T2IR = MR0_INTERRUPT;                                                // clear match interrupt
            #ifndef _HW_TIMER_MODE                                       // {13} - automated with mode extension
    T2TCR = COUNTER_RESET;                                               // reset timer to achieve single shot function
            #endif
    if (timer_int[2] != 0) {
        iInterruptLevel = 1;
        timer_int[2]();                                                  // call the user handler
        iInterruptLevel = 0;
    }
    acknowledge_irq();                                                   // required on exit of all irqs
        #endif
}

static __interrupt void timer_3_int(void)
{
        #if !defined TICK_TIMER_1
    T3IR = MR0_INTERRUPT;                                                // clear match interrupt
            #ifndef _HW_TIMER_MODE
    T3TCR = COUNTER_RESET;                                               // reset timer to achieve single shot function
            #endif
    if (timer_int[3] != 0) {
        iInterruptLevel = 1;
        timer_int[3]();                                                  // call the user handler
        iInterruptLevel = 0;
    }
    acknowledge_irq();                                                   // required on exit of all irqs
        #endif
}
    #endif

