sWahlinRhoades/uTaskerModified/Hardware/LPC2XXX/LPC23XX.c
static void ( *_timer_int[TIMERS_AVAILABLE] )( void ) = {
    (void (*)(void))timer_0_int,
    (void (*)(void))timer_1_int,
    #if TIMERS_AVAILABLE > 2                                             // {22}
    (void (*)(void))timer_2_int,
    (void (*)(void))timer_3_int,
    #endif
};
#endif

#if defined SUPPORT_PWM_MODULE                                           // {37}
static void fnConfigPWM(int iModule, TIMER_INTERRUPT_SETUP *ptrTimInt)   // using PWM module instead of general purpose timers
{
    unsigned long ulChannel = (ptrTimInt->timer_mode & 0x07);            // the channel to be used
    unsigned long *ptrMatchRegister;
    if (iModule == 1) {                                                  // PWM1
        ptrMatchRegister = PWM1MR1_ADD;
        switch (ptrTimInt->timer_mode >> 3) {
        case 1:
            switch (ulChannel) {                                         // valid for LPC23XX
            case 1:
                PINSEL3 |= (PINSEL3_P1_18_PWM1_1);
                break;
            case 2:
                PINSEL3 |= (PINSEL3_P1_20_PWM1_2);
                break;
            case 3:
                PINSEL3 |= (PINSEL3_P1_21_PWM1_3);
                break;
            case 4:
                PINSEL3 |= (PINSEL3_P1_23_PWM1_4);
                break;
            case 5:
                PINSEL3 |= (PINSEL3_P1_24_PWM1_5);
                break;
            case 6:
                PINSEL3 |= (PINSEL3_P1_26_PWM1_6);
                break;
            default:
                return;
            }
            break;
        case 2:
            switch (ulChannel) {                                         // valid for LPC23XX
            case 1:
                PINSEL4 |= (PINSEL4_P2_0_PWM1_1);
                break;
            case 2:
                PINSEL4 |= (PINSEL4_P2_1_PWM1_2);
                break;
            case 3:
                PINSEL4 |= (PINSEL4_P2_2_PWM1_3);
                break;
            case 4:
                PINSEL4 |= (PINSEL4_P2_3_PWM1_4);
                break;
            case 5:
                PINSEL4 |= (PINSEL4_P2_4_PWM1_5);
                break;
            case 6:
                PINSEL4 |= (PINSEL4_P2_5_PWM1_6);
                break;
            default:
                return;
            }
            break;
        case 3:
            switch (ulChannel) {                                         // valid for LPC23XX
            case 2:
                PINSEL7|= (PINSEL7_P3_25_PWM1_2);
                break;
            case 3:
                PINSEL7 |= (PINSEL7_P3_26_PWM1_3);
                break;
            default:
                return;
            }
            break;
        default:
            return;
        }
        POWER_UP(PCPWM1);                                                // ensure that the PWM module is powered
        if (ulChannel >= 4) {
            ptrMatchRegister = (PWM1MR4_ADD - 3);
        }
        ulChannel--;
        ptrMatchRegister += ulChannel;
        PWM1MR0 = ptrTimInt->timer_value;                                // set the timer frequency
        *ptrMatchRegister = ptrTimInt->pwm_value;                        // set the PWM value
        PWM1MCR = (PWMMR0R);                                             // channel 0 (without an output) is used as base frequency
        PWM1PCR |= (PWMENA1 << ulChannel);                               // enable defined channel output for single edge operation
        PWM1TCR = (PWMTCR_PWMEnable | PWMTCR_CounterEnable);             // enable PCM operation on the channel
        PWM1LER = (PWMMATCH0LATCH | (PWMMATCH1LATCH << ulChannel));      // ensure that changes to PWM value and base frequency are synchronised on next latch
    }
    #ifdef _LPC24XX
    else {                                                               // assume PWM0
        POWER_UP(PCPWM0);                                                // ensure that the module is powered
    }
    #endif
}
#endif

#ifdef SUPPORT_ADC                                                       // {38}
static void ( *_adc0_handler )( void ) = 0;

static __interrupt void ADC0_Interrupt(void)
{
    acknowledge_irq();                                                   // required on exit of all irqs
}
#endif

// Configure a specific interrupt, including processor specific settings and enter a handler routine.
// Some specific peripheral control may be performed here.
//
extern void fnConfigureInterrupt(void *ptrSettings)
{
    switch (((INTERRUPT_SETUP *)ptrSettings)->int_type) {
    case PORT_INTERRUPT:
        {
#if defined SUPPORT_EXTERNAL_INTERRUPTS || defined SUPPORT_PORT_INTERRUPTS // {8}
            INTERRUPT_SETUP *port_interrupt = (INTERRUPT_SETUP *)ptrSettings;
            unsigned long ulPortInputs = port_interrupt->int_port_bits;
    #if defined SUPPORT_PORT_INTERRUPTS                                  // {4}
            unsigned long *pin_mode = (PINMODE0_ADD + (port_interrupt->int_port * 2));
            LPC23XX_PORT_INT *port_control = IOIntStatR_ADD;
    #endif
    #if defined SUPPORT_EXTERNAL_INTERRUPTS
            if (port_interrupt->int_port >= EXTERNALINT) {               // external interrupt rather than a GPIO interrupt
                unsigned long ulExternalInterrupts = ((ulPortInputs & (EINT0 | EINT1 | EINT2 | EINT3)) << 14);
                VICIntEnClr = ulExternalInterrupts;                      // disable interrupt in interrupt controller
        #ifdef _WINDOWS
                VICIntEnable &= ~VICIntEnClr; VICIntEnClr = 0;
        #endif
                if (port_interrupt->int_port_sense & IRQ_DISABLE_INT) {
                    return;                                              // interrupt disabled, so work done
                }
                if (port_interrupt->int_port_sense & (IRQ_FALLING_EDGE | IRQ_RISING_EDGE)) {
                    EXTMODE |= ulPortInputs;                             // edge sensitive
                }
                else {
                    EXTMODE &= ~ulPortInputs;                            // level sensitive
                }
                if (port_interrupt->int_port_sense & (IRQ_RISING_EDGE | IRQ_HIGH_LEVEL)) {
                    EXTPOLAR |= ulPortInputs;                            // high level or rising edge
                }
                else {
                    EXTPOLAR &= ~ulPortInputs;                           // low level or falling edge
                }
        #ifdef _WINDOWS
                EXTINT &= ~ulPortInputs;                                 // clear possible pending interrupts before enabling interrupts
        #else
                EXTINT = ulPortInputs;                                   // clear possible pending interrupts before enabling interrupts
        #endif
        #if (defined SUPPORT_EXTERNAL_INTERRUPTS && defined SUPPORT_EINT0)
                if (ulPortInputs & EINT0) {
            #ifdef _LPC21XX                                              // {21}
                    PINSEL1 &= ~PINSEL1_P0_16_RESET;
                    PINSEL1 |= PINSEL1_P0_16_EINT0;
            #else
                    PINSEL4 &= ~PINSEL4_P2_10_RESET;
                    PINSEL4 |= (PINSEL4_P2_10_EINT0);                    // configure EINT0 pin
            #endif
                    eint0_handler = port_interrupt->int_handler;
                    fnSetIntHandler(INTERRUPT_EINT0, port_interrupt->int_priority, (unsigned long)EINT0_Interrupt); // configure and enter the handling interrupt routine in the vector table
                }
        #endif
        #if (defined SUPPORT_EXTERNAL_INTERRUPTS && defined SUPPORT_EINT1)
                if (ulPortInputs & EINT1) {
            #ifdef _LPC21XX                                              // {21}
                    PINSEL0 &= ~PINSEL0_P0_14_RESET;
                    PINSEL0 |= PINSEL0_P0_14_EINT1;
            #else
                    PINSEL4 &= ~PINSEL4_P2_11_RESET;
                    PINSEL4 |= (PINSEL4_P2_11_EINT1);                    // configure EINT1 pin
            #endif
                    eint1_handler = port_interrupt->int_handler;
                    fnSetIntHandler(INTERRUPT_EINT1, port_interrupt->int_priority, (unsigned long)EINT1_Interrupt); // configure and enter the handling interrupt routine in the vector table
                }
        #endif
        #if (defined SUPPORT_EXTERNAL_INTERRUPTS && defined SUPPORT_EINT2)
                if (ulPortInputs & EINT2) {
            #ifdef _LPC21XX                                              // {21}
                    PINSEL0 &= ~PINSEL0_P0_15_RESET;
                    PINSEL0 |= PINSEL0_P0_15_EINT2;
            #else
                    PINSEL4 &= ~PINSEL4_P2_12_RESET;
                    PINSEL4 |= (PINSEL4_P2_12_EINT2);                    // configure EINT2 pin
            #endif
                    eint2_handler = port_interrupt->int_handler;
                    fnSetIntHandler(INTERRUPT_EINT2, port_interrupt->int_priority, (unsigned long)EINT2_Interrupt); // configure and enter the handling interrupt routine in the vector table
                }
        #endif
        #if (defined SUPPORT_EXTERNAL_INTERRUPTS && defined SUPPORT_EINT3 && !defined _LPC21XX) // {20}
                if (ulPortInputs & EINT3) {
            #ifdef _LPC21XX                                              // {21}
                    PINSEL0 &= ~PINSEL0_P0_15_RESET;
                    PINSEL0 |= PINSEL0_P0_15_EINT2;
            #else
                    PINSEL4 &= ~PINSEL4_P2_13_RESET;
                    PINSEL4 |= (PINSEL4_P2_13_EINT3);                    // configure EINT3 pin
            #endif
                    eint3_handler = port_interrupt->int_handler;
                    fnSetIntHandler(INTERRUPT_EINT3, port_interrupt->int_priority, (unsigned long)EINT3_Interrupt); // configure and enter the handling interrupt routine in the vector table
                }
        #endif
                return;
            }
    #endif
    #if defined SUPPORT_PORT_INTERRUPTS
            if (port_interrupt->int_port_sense & (PULLUP_ON | PULLDOWN_ON | PULLUP_DOWN_OFF)) { // change in pull-up/downs required
                unsigned long ulPullDownMask = 0x00000003;
                unsigned long ulNoMask = 0x00000002;
                unsigned long ulBit  = 0x00000001;
                while (ulPortInputs >= ulBit) {
                    if (ulBit & ulPortInputs) {                          // this bit is to be change
                        *pin_mode &= ~ulPullDownMask;                    // mask out and set internal pull up (avoid illegal state 0x01)
                        if (port_interrupt->int_port_sense & (PULLDOWN_ON | PULLUP_DOWN_OFF)) {
                            if (port_interrupt->int_port_sense & PULLDOWN_ON) {
                                *pin_mode |= ulPullDownMask;
                            }
                            else {
                                *pin_mode |= ulNoMask;
                            }
                        }
                    }
                    ulBit <<= 1;
                    if (ulBit & 0x00010000) {
                        pin_mode++;                                      // move to second mode register
                    }
                    ulPullDownMask <<= 2;
                    ulNoMask <<= 2;
                }
            }
            if (!(port_interrupt->int_port_sense & (IRQ_DISABLE_INT | IRQ_RISING_EDGE | IRQ_FALLING_EDGE))) {
                return;                                                  // no interrupt configuration required so quit
            }
            switch (port_interrupt->int_port) {
            case PORT_2:
        #if !defined _LPC24XX
                ulPortInputs &= 0x00003fff;                              // mask out available port bits on the chip
        #endif
                port_control++;                                          // move to the port 2 control block
            case PORT_0:
                port_control->IOIntClr = ulPortInputs;                   // clear possible interrupts on the defined port inputs
        #ifdef _WINDOWS
                port_control->IOIntClr = 0;
        #endif
                fnSetIntHandler(INTERRUPT_EINT3, port_interrupt->int_priority, (unsigned long)EINT3_Interrupt); // configure and enter the handling interrupt routine in the vector table (note that this is shared with EINT3)
                fnEnterHandler(port_interrupt->int_port, ulPortInputs, port_interrupt->int_handler);
                if (port_interrupt->int_port_sense & IRQ_RISING_EDGE) {
                    port_control->IOIntEnR |= ulPortInputs;              // enable rising edge interrupt on the defined bits
                }
                else {
                    port_control->IOIntEnR &= ~(ulPortInputs);           // disable rising edge interrupt on the defined bits
                }
                if (port_interrupt->int_port_sense & IRQ_FALLING_EDGE) {
                    port_control->IOIntEnF |= ulPortInputs;              // enable falling edge interrupt on the defined bits
                }
                else {
                    port_control->IOIntEnF &= ~(ulPortInputs);           // disable falling edge interrupt on the defined bits
                }
                break;
            default:
                return;                                                  // no interrupts on other ports
            }
    #endif
#endif
        }
        break;
#if defined SUPPORT_TIMER                                                // {5}
    case TIMER_INTERRUPT:
        {
            TIMER_INTERRUPT_SETUP *ptrTimInt = (TIMER_INTERRUPT_SETUP *)ptrSettings;
            TIMER_CONTROL *ptrTimerCtl;
            int iIntVector;
            switch (ptrTimInt->timer_reference) {
    #if defined TICK_TIMER_1 || defined TICK_TIMER_2 || defined TICK_TIMER_3 // don't allow TICK timer channel to be disturbed
            case 0:
                ptrTimerCtl = (TIMER_CONTROL *)TIMER_PERIPHERAL_BLOCK_0;
                POWER_UP(PCTIM0);                                        // {10} power up the timer for use
                iIntVector = INTERRUPT_TIMER0;
                break;
    #endif
    #if !defined TICK_TIMER_1                                            // don't allow TICK timer channel to be disturbed
            case 1:
                ptrTimerCtl = (TIMER_CONTROL *)TIMER_PERIPHERAL_BLOCK_1;
                POWER_UP(PCTIM1);                                        // {10} power up the timer for use
                iIntVector = INTERRUPT_TIMER1;
                break;
    #endif
    #if !defined TICK_TIMER_2 && TIMERS_AVAILABLE > 2                    // {22} don't allow TICK timer channel to be disturbed
            case 2:
                ptrTimerCtl = (TIMER_CONTROL *)TIMER_PERIPHERAL_BLOCK_2;
                POWER_UP(PCTIM2);                                        // {10} power up the timer for use
                iIntVector = INTERRUPT_TIMER2;
                break;
    #endif
    #if !defined TICK_TIMER_3 && TIMERS_AVAILABLE > 2                    // {22} don't allow TICK timer channel to be disturbed
            case 3:
                ptrTimerCtl = (TIMER_CONTROL *)TIMER_PERIPHERAL_BLOCK_3;
                POWER_UP(PCTIM3);                                        // {10} power up the timer for use
                iIntVector = INTERRUPT_TIMER3;
                break;
    #endif
    #if defined  SUPPORT_PWM_MODULE                                      // {37}
        #ifdef _LPC24XX
            case PWM0:
                fnConfigPWM(0, ptrTimInt);
                return;
        #endif
            case PWM1:                                                   // PWM module instead of general purpose timer
                fnConfigPWM(1, ptrTimInt);
                return;
    #endif
            default:
                return;
            }
    #if defined _HW_TIMER_MODE                                           // {13}
            if ((ptrTimInt->timer_mode & TIMER_DONT_DISTURB) == 0) {
                ptrTimerCtl->TTCR = COUNTER_RESET;                       // ensure timer stopped
                ptrTimerCtl->TPR  = 0;                                   // no prescaler
            }
            if (ptrTimInt->timer_mode & (TIMER_PWM_MAT0 | TIMER_PWM_MAT1 | TIMER_PWM_MAT2)) { // generate a PWM output on the specified MAT pin
        #if defined LPC2101 || defined LPC2102 || defined LPC2103
                unsigned long ulPWMMode = 0;
        #endif
                switch (ptrTimInt->timer_mode & (TIMER_PWM_MAT0 | TIMER_PWM_MAT1 | TIMER_PWM_MAT2)) {
                case TIMER_PWM_MAT0:
        #if defined LPC2101 || defined LPC2102 || defined LPC2103
                    switch (ptrTimInt->timer_reference) {
                    case 0:
                        PINSEL0 |= (PINSEL0_P0_3_MAT0_0);                // MAT 0.0 on P0.3
                        break;
                    case 1:
                        PINSEL0 |= (PINSEL0_P0_12_MAT1_0);               // MAT 1.0 on P0.12
                        break;
                    case 2:
                        PINSEL0 |= (PINSEL0_P0_7_MAT2_0);                // MAT 2.0 on P0.7
                        break;
                    case 3:
                        PINSEL1 |= (PINSEL1_P0_21_MAT3_0);               // MAT 3.0 on P0.21
                        break;
                    }
                    ptrTimerCtl->TMR0 = (ptrTimInt->timer_value - ptrTimInt->pwm_value); // set the PWM match value (the output goes high on match)
                    ulPWMMode = (PWM_MAT0_ENABLE | PWM_MAT3_ENABLE);
        #else
        #endif
                    break;
                case TIMER_PWM_MAT1:
        #if defined LPC2101 || defined LPC2102 || defined LPC2103
                    switch (ptrTimInt->timer_reference) {
                    case 0:
                        PINSEL0 |= (PINSEL0_P0_5_MAT0_1);                // MAT 0.1 on P0.5
                        break;
                    case 1:
                        PINSEL0 |= (PINSEL0_P0_13_MAT1_1);               // MAT 1.1 on P0.13
                        break;
                    case 2:
                        PINSEL0 |= (PINSEL0_P0_8_MAT2_1);                // MAT 2.1 on P0.8
                        break;
                    case 3:
                        PINSEL0 |= (PINSEL0_P0_0_MAT3_1);                // MAT 3.1 on P0.0
                        break;
                    }
                    ptrTimerCtl->TMR1 = (ptrTimInt->timer_value - ptrTimInt->pwm_value); // set the PWM match value (the output goes high on match)
                    ulPWMMode = (PWM_MAT1_ENABLE | PWM_MAT3_ENABLE);
        #else
        #endif
                    break;
                case TIMER_PWM_MAT2:
        #if defined LPC2101 || defined LPC2102 || defined LPC2103
                    switch (ptrTimInt->timer_reference) {
                    case 0:
                        PINSEL1 |= (PINSEL1_P0_16_MAT0_2);                // MAT 0.2 on P0.16
                        break;
                    case 1:
                        PINSEL1 |= (PINSEL1_P0_19_MAT1_2);                // MAT 1.2 on P0.19
                        break;
                    case 2:
                        PINSEL0 |= (PINSEL0_P0_9_MAT2_2);                 // MAT 2.2 on P0.9
                        break;
                    case 3:
                        PINSEL0 |= (PINSEL0_P0_1_MAT3_2);                 // MAT 3.2 on P0.1
                        break;
                    }
                    ptrTimerCtl->TMR2 = (ptrTimInt->timer_value - ptrTimInt->pwm_value); // set the PWM match value (the output goes high on match)
                    ulPWMMode = (PWM_MAT2_ENABLE | PWM_MAT3_ENABLE);
        #else
        #endif
                    break;
                }
        #if defined LPC2101 || defined LPC2102 || defined LPC2103
                if (ptrTimInt->timer_mode & TIMER_DONT_DISTURB) {
                    ulPWMMode |= ptrTimerCtl->PWMCON;
                }
                ptrTimerCtl->PWMCON = ulPWMMode;
                ptrTimerCtl->TMR3 = ptrTimInt->timer_value;              // cycle match value, determining the frequency
                ptrTimerCtl->TMCR = (MR3R);                              // use match 3 to generate the cycle time since it is not pinned out
                ptrTimerCtl->TTCR =  COUNTER_ENABLE;                     // enable timer operation
        #endif
                break;
            }
            else if (ptrTimInt->timer_mode & TIMER_PERIODIC) {
                ptrTimerCtl->TMCR = (MR0I | MR0R);                       // generate periodic interrupt with the count reset on each match
            }
            else {
                ptrTimerCtl->TMCR = (MR0I | MR0S);                       // generate single interrupt with the timer stopped on match
            }
            ptrTimerCtl->TMR0 = ptrTimInt->timer_value;
    #else                                                                // compatibility mode - only single-shot timer
            ptrTimerCtl->TTCR = COUNTER_RESET;                           // ensure timer stopped
            ptrTimerCtl->TPR  = 0;                                       // no prescaler
            ptrTimerCtl->TMCR = MR0I;                                    // interrupt on match
            if (ptrTimInt->timer_value) {                                // ms value
                ptrTimerCtl->TMR0 = ((PCLK/4000)*ptrTimInt->timer_value);// match value
            }
            else {                                                       // us value
                ptrTimerCtl->TMR0 = ((PCLK/4000000)*ptrTimInt->timer_us_value);// match value
            }
    #endif
            ptrTimerCtl->TIR  = 0xff;                                    // reset any waiting interrupt
            timer_int[ptrTimInt->timer_reference] = ptrTimInt->int_handler; // enter the user handler
            fnSetIntHandler(iIntVector, ptrTimInt->int_priority, (unsigned long)_timer_int[ptrTimInt->timer_reference]); // configure and enter the handling interrupt routine in the vector table
            ptrTimerCtl->TTCR =  COUNTER_ENABLE;                         // enable timer operation
        }
        break;
#elif defined SUPPORT_PWM_MODULE                                         // {37}
    case TIMER_INTERRUPT:
        {
            TIMER_INTERRUPT_SETUP *ptrTimInt = (TIMER_INTERRUPT_SETUP *)ptrSettings;
            if (ptrTimInt->timer_reference == PWM1) {
                fnConfigPWM(1, ptrTimInt);
            }
    #ifdef _LPC24XX
            else if (ptrTimInt->timer_reference == PWM0) {
                fnConfigPWM(0, ptrTimInt);
            }
    #endif
        }
        break;
#endif
#if defined SUPPORT_ADC                                                  // {38}
    case ADC_INTERRUPT:
        {
            ADC_SETUP *ptrADCSettings = (ADC_SETUP *)ptrSettings;
            unsigned long ulChannels = (ptrADCSettings->int_adc_single_ended_inputs & 0xff);
            POWER_UP(PCPCAD);                                            // ensure that the ADC module is powered
            PCLKSEL0 |= (PCLK_ADC_CCLK_8);                               // ADC clock is PCLK/8 since faster speeds don't make any sense
            AD0CR = (ulChannels | ADCR_PDN | ptrADCSettings->SamplingSpeed); // slowest possible conversion rate
            if (ptrADCSettings->int_adc_mode & ADC_CONTINUOUS) {
                AD0CR |= ADCR_BURST;                                     // burst mode for continuous operation
            }
            else {
                switch (ulChannels) {                                    // presently for LPC24xx
                case ADCR_SEL_CHAN0:
                    PINSEL1 |= PINSEL1_P0_23_AD0_0;                      // selecting the pin improves accuracy, although the AD in function also works when not specifically selected
                    break;
                case ADCR_SEL_CHAN1:
