sWahlinRhoades/uTaskerModified/Hardware/LPC2XXX/LPC23XX.c
                    PINSEL1 |= PINSEL1_P0_24_AD0_1;                      // selecting the pin improves accuracy, although the AD in function also works when not specifically selected
                    break;
                case ADCR_SEL_CHAN2:
                    PINSEL1 |= PINSEL1_P0_25_AD0_2;                      // selecting the pin improves accuracy, although the AD in function also works when not specifically selected
                    break;
                case ADCR_SEL_CHAN3:
                    PINSEL1 |= PINSEL1_P0_26_AD0_3;                      // selecting the pin improves accuracy, although the AD in function also works when not specifically selected
                    break;
                case ADCR_SEL_CHAN4:
                    PINSEL3 |= PINSEL3_P1_30_AD0_4;                      // selecting the pin improves accuracy, although the AD in function also works when not specifically selected
                    break;
                case ADCR_SEL_CHAN5:
                    PINSEL3 |= PINSEL3_P1_31_AD0_5;                      // selecting the pin improves accuracy, although the AD in function also works when not specifically selected
                    break;
                case ADCR_SEL_CHAN6:
                    PINSEL0 |= PINSEL0_P0_12_AD0_6;                      // selecting the pin improves accuracy, although the AD in function also works when not specifically selected
                    break;
                case ADCR_SEL_CHAN7:
                    PINSEL0 |= PINSEL0_P0_13_AD0_7;                      // selecting the pin improves accuracy, although the AD in function also works when not specifically selected                        
                    break;
                default:
                    _EXCEPTION("More that one channel is selected in software mode - not allowed! !!");
                    break;
                }
                if (ptrADCSettings->int_handler != 0) {
                    _adc0_handler = ptrADCSettings->int_handler;         // enter the user's interrup callback
                    fnSetIntHandler(INTERRUPT_ADC0, ptrADCSettings->int_priority, (unsigned long)ADC0_Interrupt); // enter the interrupt handler
                    AD0INTEN = (ulChannels);                             // interrupt on the single channel completion which will always take place after 11 clocks
                }
                else {
                    AD0INTEN = 0;                                        // no interrupt
                }
                AD0CR |= (ADCR_START_START_CONVERSION);                  // start conversion
            }
        }
        break;
#endif
    default:
        _EXCEPTION("Attempting configuration of interrupt interface without appropriate support enabled!!");
        break;
    }
}

#if defined SUPPORT_RTC

#define RTC_SOURCES 2

static void ( *_rtc_handler[RTC_SOURCES] )( void ) = {0};

static __interrupt void _rtc_interrupt_handler(void)
{
    if (RTC_ILR & RTCCIF) {                                              // increment interrupt
    #ifdef _WINDOWS
        RTC_ILR &= ~RTCCIF;
    #else
        RTC_ILR = RTCCIF;                                                // reset interrupt
    #endif
        if (RTC_CIIR & CIIR_IMSEC) {                                     // a second interrupt has occurred
            if (_rtc_handler[0] != 0) {
                iInterruptLevel = 1;
                _rtc_handler[0]();                                       // call the user handler
                iInterruptLevel = 0;
            }
        }
    }
    acknowledge_irq();                                                   // required on exit of all irqs
}

extern int fnConfigureRTC(void *ptrSettings)                             // {43}{48}
{
    int iSource = 0;
    RTC_SETUP *ptr_rtc_setup = (RTC_SETUP *)ptrSettings;

    if ((ptr_rtc_setup->command) & RTC_INITIALISATION) {                 // initialisation after reset
        RTC_AMR = 0;                                                     // no alarms
        RTC_CIIR = 0;                                                    // no interrupts
    #if !defined LPC2101 && !defined LPC2102 && !defined LPC2103
        RTC_ILR = (RTCCIF | RTCALF | RTSSF);                             // clear pending timer interrupts
    #else
        RTC_ILR = (RTCCIF | RTCALF);
    #endif
        if ((ptr_rtc_setup->command & RTC_PCLK) == 0) {                  // default is to run from 32kHz
            RTC_CCR = (CCR_CLKSRC_32K | CCR_CLKEN);                      // ensure that RTC is configured and running from 32kHz source
        }
        else {
            RTC_CCR = (CCR_CLKEN);                                       // run from PCLK
        }
    }
    switch ((ptr_rtc_setup->command) & ~(RTC_INITIALISATION | RTC_PCLK | RTC_DISABLE)) { // handle commands
    case RTC_TIME_SETTING:                                               // set time to RTC
        RTC_CCR &= ~(CCR_CLKEN);                                         // temporarily disable the RTC
        RTC_SEC = ptr_rtc_setup->ucSeconds;
        RTC_YEAR = ptr_rtc_setup->usYear;
        RTC_MONTH = ptr_rtc_setup->ucMonthOfYear;
        RTC_DOM = ptr_rtc_setup->ucDayOfMonth;
        RTC_DOW = ptr_rtc_setup->ucDayOfWeek;
        RTC_HOUR = ptr_rtc_setup->ucHours;
        RTC_MIN = ptr_rtc_setup->ucMinutes;
        RTC_CCR |= (CCR_CLKEN);                                          // enable the RTC again
        break;

    case RTC_GET_TIME:
        do {                                                             // repeat in case seconds increment while copying
            ptr_rtc_setup->ucSeconds = (unsigned char)RTC_SEC;
            ptr_rtc_setup->usYear = (unsigned short)RTC_YEAR;
            ptr_rtc_setup->ucMonthOfYear = (unsigned char)RTC_MONTH;
            ptr_rtc_setup->ucDayOfMonth = (unsigned char)RTC_DOM;
            ptr_rtc_setup->ucDayOfWeek = (unsigned char)RTC_DOW;
            ptr_rtc_setup->ucHours = (unsigned char)RTC_HOUR;
            ptr_rtc_setup->ucMinutes = (unsigned char)RTC_MIN;
        } while (ptr_rtc_setup->ucSeconds != (unsigned char)RTC_SEC);    // check that the seconds was not incremented while reading full time and date
        break;

    case RTC_TICK_HOUR:
        iSource++;
    case RTC_TICK_MIN:
        iSource++;
    case RTC_TICK_SEC:
        fnSetIntHandler(INTERRUPT_RTC, RTC_INTERRUPT_PRIORITY, (unsigned long)_rtc_interrupt_handler);
        _rtc_handler[iSource] = (ptr_rtc_setup->int_handler);            // enter specific event handler
        RTC_CIIR |= (0x00000001 << iSource);                             // an interrupt is required on each second increment
        break;


