sWahlinRhoades/uTaskerModified/Hardware/LPC2XXX/LPC23XX.c
    case RTC_TICK_DAY:
    case RTC_ALARM_TIME:
    case RTC_STOPWATCH_GO:
        break;
    }
    return 0;                                                            // {43}
}

    #if defined SDCARD_SUPPORT && defined SUPPORT_FILE_TIME_STAMP        // {27}
// This routine supports date and time stamping of files and directories. If the information is not available it could return 1
// so that a fixed stamp is set. It is assumed that the RTC in the LPC2XXX will be used if the support is activated
//
extern int fnGetLocalFileTime(unsigned short *ptr_usCreationTime, unsigned short *ptr_usCreationDate)
{
    unsigned long ulSec;
    unsigned long ulMinutes;
    unsigned long ulHours;
    unsigned long ulDayofMonth;
    unsigned long ulMonthofYear;
    unsigned long ulYear;

    do {
        ulSec = RTC_SEC;                                                 // get a snap shot from RTC
        ulMinutes = RTC_MIN;
        ulHours = RTC_HOUR;
        ulDayofMonth = RTC_DOM;
        ulMonthofYear = RTC_MONTH;
        ulYear = RTC_YEAR;
    } while (ulSec != RTC_SEC);                                          // if there was a second overflow while collecting the data repeat
    if (ulYear < 2010) {                                                 // if the year is invalid report that there is no valid time/data
        return 1;                                                        // utFAT should take fixed timestamp instead
    }
    *ptr_usCreationTime = (unsigned short)(ulSec | (ulMinutes << 5) | (ulHours << 11));
    *ptr_usCreationDate = (unsigned short)(ulDayofMonth | (ulMonthofYear << 5) | ((ulYear - 1980) << 9));
    return 0;                                                            // successful
}
    #endif
#endif

#if defined SDCARD_SUPPORT && defined SD_CONTROLLER_AVAILABLE

    #ifdef SD_CONTROLLER_DMA
static unsigned long *ulTempBuffer = 0;                                  // intermediate buffer used by DMA when the it can't work with the user's buffer directly
    #endif

// Initialise the SD controllers interface with low speed clock during initailiation sequence
//
extern void fnInitSDCardInterface(void (*int_handler)(void))
{
    #ifdef SD_CONTROLLER_DMA
    POWER_UP(PCSDC | PCGPDMA);                                           // power up the SD controller interface and general purpose DMA controller
    #else
    POWER_UP(PCSDC);                                                     // power up the SD controller interface
    #endif
    CONFIGURE_SDCARD_INTERFACE();                                        // configure the pins for the hardware
    MCICommand = 0;
    MCIDataCtrl = 0;
    MCIClear = (CmdCrcFailClr | DataCrcFailClr | CmdTimeOutClr | DataTimeOutClr | TxUnderrunClr | RxOverrunClr | CmdRespEndClr | CmdSentClr | DataEndClr | StartBitErrClr | DataBlockEndClr); // clear all status flags
    MCIPower = MCI_PWR_Ctrl_PowerUp;
    MCIClock = (MCI_CLK_PwrSave | MCI_CLK_Enable | ((PCLK/4/2/300000 - 1))); // 300kHz initial speed in 1-bit mode
    #ifdef SD_CONTROLLER_DMA
    if (ulTempBuffer == 0) {                                             // on first initialisation get working memory in the USB memory (memory that GPDMA controller can use)
        ulTempBuffer = (unsigned long *)_getUSB_RAM((unsigned char *)uMallocUSB(512));
    }
    #endif
}

// Send a command to the SD-card and return a result, plus optional returned arguments
//
extern int fnSendSD_command(const unsigned char ucCommand[6], unsigned char *ucResult, unsigned char *ptrReturnData)
{
    #define MAX_POLL_COUNT   10000
    static int iCommandYieldCount = 0;
    static int iCommandState = 0;
    int iRtn = 0;

    if (iCommandYieldCount > MAX_POLL_COUNT) {                           // the present access is taking too long - quit with SD card error
        fnDebugMsg("TIMEOUT!!!\r\n");
        iRtn = ERROR_CARD_TIMEOUT;
    }
    else {
        switch (iCommandState) {
        case 0:
            while (MCIStatus & CmdActive) {                              // clear any command activity
                MCICommand = 0;
                MCIClear = (CmdCrcFailClr | DataCrcFailClr | CmdTimeOutClr | DataTimeOutClr | TxUnderrunClr | RxOverrunClr | CmdRespEndClr | CmdSentClr | DataEndClr | StartBitErrClr | DataBlockEndClr);
    #ifdef _WINDOWS
                MCIStatus = 0;
    #endif
            }
            fnDelayLoop(10);                                             // to tune
            MCIArgument = ((ucCommand[1] << 24) | (ucCommand[2] << 16) | (ucCommand[3] << 8) | ucCommand[4]); // set the argument of the command
            switch (ucCommand[0]) {
            case GO_IDLE_STATE_CMD0:
                MCICommand  = (ucCommand[0] | MCICmd_Enable);            // launch the command (no response)
    #ifdef _WINDOWS
                MCIStatus = CmdSent;                                     // since there is no response, just set the sent flag
    #endif
                break;
            case SEND_CSD_CMD9:
            case SEND_CID_CMD2:
                MCICommand  = (ucCommand[0] | MCICmd_Response | MCICmd_LongRsp | MCICmd_Enable); // launch the command with long response
    #ifdef _WINDOWS
                MCIStatus = CmdRespEnd;                                  // set the successful response flag
                MCIRespCmd = ucCommand[0];
    #endif
                break;
            default:
                MCICommand  = (ucCommand[0] | MCICmd_Response | MCICmd_Enable); // launch the command (short response)
    #ifdef _WINDOWS
                if (SEND_OP_COND_ACMD_CMD41 == ucCommand[0]) {
                    MCIStatus = CmdCrcFail;
                }
                else {
                    MCIStatus = CmdRespEnd;                              // set the successful response flag
                }
                MCIRespCmd = ucCommand[0];
    #endif
                break;
            }
    #ifdef _WINDOWS
            _fnSimSD_write((unsigned char)(ucCommand[0] | 0x40));_fnSimSD_write(ucCommand[1]);_fnSimSD_write(ucCommand[2]);_fnSimSD_write(ucCommand[3]);_fnSimSD_write(ucCommand[4]);_fnSimSD_write(0);_fnSimSD_write(0xff);
    #endif
        case 6:
            do {
                if (MCIStatus & CmdTimeOut) {                            // timeout occurred while waiting for command to complete
                    MCIClear = (CmdCrcFailClr | DataCrcFailClr | CmdTimeOutClr | DataTimeOutClr | TxUnderrunClr | RxOverrunClr | CmdRespEndClr | CmdSentClr | DataEndClr | StartBitErrClr | DataBlockEndClr);
                    MCICommand = 0;
                    MCIArgument = 0xffffffff;
                    iCommandYieldCount++;                                // monitor the maximum number of timeouts
                    iCommandState = 0;                                   // allow resend of command
                    uTaskerStateChange(TASK_MASS_STORAGE, UTASKER_GO);   // switch to polling mode of operation
    #ifdef _WINDOWS
                    MCIStatus = CmdRespEnd;
    #endif
                    return CARD_BUSY_WAIT;
                }
                else if (MCIStatus & CmdCrcFail) {                       // CRC error detected
                    MCIClear = (CmdCrcFailClr | DataCrcFailClr | CmdTimeOutClr | DataTimeOutClr | TxUnderrunClr | RxOverrunClr | CmdRespEndClr | CmdSentClr | DataEndClr | StartBitErrClr | DataBlockEndClr);
                    switch (ucCommand[0]) {
                    case SEND_OP_COND_ACMD_CMD41:                        // this responds with command value 0x3f and CRC-7 0xff
                        MCICommand = 0;
                        MCIArgument = 0xffffffff;
                        break;
                    default:                                             // other cases could be real CRC error
                        break;
                    }
                    *ucResult = 0;                                       // for compatibility
                    break;
                }
                else if (MCIStatus & CmdRespEnd) {                       // command has successfully completed and response received
                    MCIClear = (CmdCrcFailClr | DataCrcFailClr | CmdTimeOutClr | DataTimeOutClr | TxUnderrunClr | RxOverrunClr | CmdRespEndClr | CmdSentClr | DataEndClr | StartBitErrClr | DataBlockEndClr);
                    if (ucCommand[0] == (unsigned char)MCIRespCmd) {     // if matching response
                        switch (ucCommand[0]) {
                        case SEND_IF_COND_CMD8:
                            *ucResult = SDC_CARD_VERSION_2PLUS;          // for compatibility
                            break;
                        case APP_CMD_CMD55:
                            *ucResult = R1_IN_IDLE_STATE;                // for compatibility
                            break;
                        default:
                            *ucResult = 0;                               // for compatibility
                            break;
                        }
                    }
                    break;
                }
                else if ((ucCommand[0] == GO_IDLE_STATE_CMD0) && (MCIStatus & CmdSent)) {
                    MCIClear = (CmdCrcFailClr | DataCrcFailClr | CmdTimeOutClr | DataTimeOutClr | TxUnderrunClr | RxOverrunClr | CmdRespEndClr | CmdSentClr | DataEndClr | StartBitErrClr | DataBlockEndClr);
                    *ucResult = R1_IN_IDLE_STATE;                        // dummy response for compatibility
                }
                else {                                                   // the command/response is still being executed
                    iCommandState = 6;
                    if (iCommandYieldCount == 0) {                       // just count once as timeout
                        uTaskerStateChange(TASK_MASS_STORAGE, UTASKER_GO); // switch to polling mode of operation
                        iCommandYieldCount = 1;
                    }
                    return CARD_BUSY_WAIT;                               // poll up to 20 times before yielding
                }
            } while (*ucResult & SD_CARD_BUSY);                          // poll the card until it is no longer indicating busy and returns the value
            if (ptrReturnData != 0) {                                    // if the caller requests data, read it here
    #ifdef _WINDOWS
                _fnSimSD_write(0xff);_fnSimSD_write(0xff);               // for compatibility
                MCIResponse0  = (_fnSimSD_write(0xff) << 24);
                MCIResponse0 |= (_fnSimSD_write(0xff) << 16);
                MCIResponse0 |= (_fnSimSD_write(0xff) << 8);
                MCIResponse0 |=  _fnSimSD_write(0xff);
    #endif
                *ptrReturnData++ = (unsigned char)(MCIResponse0 >> 24);
                *ptrReturnData++ = (unsigned char)(MCIResponse0 >> 16);
                *ptrReturnData++ = (unsigned char)(MCIResponse0 >> 8);
                *ptrReturnData   = (unsigned char)MCIResponse0;
                if ((ucCommand[0] == SEND_CSD_CMD9) || (ucCommand[0] == SEND_CID_CMD2)) { // exception requiring 16 bytes
    #ifdef _WINDOWS
                    MCIResponse1  = (_fnSimSD_write(0xff) << 24);
                    MCIResponse1 |= (_fnSimSD_write(0xff) << 16);
                    MCIResponse1 |= (_fnSimSD_write(0xff) << 8);
                    MCIResponse1 |=  _fnSimSD_write(0xff);
    #endif
                    ptrReturnData++;
                    *ptrReturnData++ = (unsigned char)(MCIResponse1 >> 24);
                    *ptrReturnData++ = (unsigned char)(MCIResponse1 >> 16);
                    *ptrReturnData++ = (unsigned char)(MCIResponse1 >> 8);
                    *ptrReturnData++ = (unsigned char)MCIResponse1;
    #ifdef _WINDOWS
                    MCIResponse2  = (_fnSimSD_write(0xff) << 24);
                    MCIResponse2 |= (_fnSimSD_write(0xff) << 16);
                    MCIResponse2 |= (_fnSimSD_write(0xff) << 8);
                    MCIResponse2 |=  _fnSimSD_write(0xff);
    #endif
                    *ptrReturnData++ = (unsigned char)(MCIResponse2 >> 24);
                    *ptrReturnData++ = (unsigned char)(MCIResponse2 >> 16);
                    *ptrReturnData++ = (unsigned char)(MCIResponse2 >> 8);
                    *ptrReturnData++ = (unsigned char)MCIResponse2;
    #ifdef _WINDOWS
                    MCIResponse3  = (_fnSimSD_write(0xff) << 24);
                    MCIResponse3 |= (_fnSimSD_write(0xff) << 16);
                    MCIResponse3 |= (_fnSimSD_write(0xff) << 8);
                    MCIResponse3 |=  _fnSimSD_write(0xff);
    #endif
                    *ptrReturnData++ = (unsigned char)(MCIResponse3 >> 24);
                    *ptrReturnData++ = (unsigned char)(MCIResponse3 >> 16);
                    *ptrReturnData++ = (unsigned char)(MCIResponse3 >> 8);
                    *ptrReturnData   = (unsigned char)MCIResponse3;
                }
            }
            break;
        }
    }
    if (iCommandYieldCount != 0) {
        uTaskerStateChange(TASK_MASS_STORAGE, UTASKER_STOP);             // switch to event mode of operation since write has completed
        iCommandYieldCount = 0;
    }
    iCommandState = 0;
    return iRtn;
}


// This local function is always fed with an aligned buffer to put data into, which will also be in DMA accessible RAM in case of DMA operation
//
static int _fnGetSector(unsigned char *ptrBuf)
{
    #define DATA_TIMEOUT_VALUE     0x20000
    MCIClear = (CmdCrcFailClr | DataCrcFailClr | CmdTimeOutClr | DataTimeOutClr | TxUnderrunClr | RxOverrunClr | CmdRespEndClr | CmdSentClr | DataEndClr | StartBitErrClr | DataBlockEndClr);
    MCIDataCtrl = 0;
    fnDelayLoop(10);                                                     // to tune
    MCIDataTimer = DATA_TIMEOUT_VALUE;
    MCIDataLength = 512;
    #ifdef SD_CONTROLLER_DMA                                             // if DMA is not used the data is received in the FIFO and should be copied to the input buffer
    DMACC1SrcAddr  = (unsigned long)MCIFIFO0_ADD;                        // DMA channel 1 transfer from FIFO to memory
    DMACC1DestAddr = (unsigned long)ptrBuf;                              // 
    DMACC1Control  = (512 | DMACCControl_SBSize_8 | DMACCControl_DBSize_32 | DMACCControl_SWidth_word | DMACCControl_DWidth_word | DMACCControl_DI);
    DMACConfiguration = DMACCConfiguration_E;                            // enable DMA controller in little-endian mode
    while (!(DMACConfiguration & DMACCConfiguration_E)) {}               // wait until it is enabled
	DMACC1Configuration = (DMACCConfiguration_L | DMACCConfiguration_E | DMACCConfiguration_SrcP_SD_MMC | DMACCConfiguration_P2MP);
	MCIDataCtrl = (MCIDataCnt_Enable | MCIDataCnt_Direction_from_card | MCIDataCnt_DMAEnable | MCIDataCnt_block_size_512);
    fnDelayLoop(1);                                                      // to tune
        #ifdef _WINDOWS
    _fnSimSD_write(0xff);                                                // dummy for simulation compatibility
    MCIStatus = 0;
        #endif
    while (!(MCIStatus & DataEnd)) {                                     // wait until the DMA has completed the transfer to the destination buffer
        #ifdef _WINDOWS
        if (MCIDataLength != 0) {
            MCIFIFO0 =   _fnSimSD_write(0xff);
            MCIFIFO0 |= (_fnSimSD_write(0xff) << 8);
            MCIFIFO0 |= (_fnSimSD_write(0xff) << 16);
            MCIFIFO0 |= (_fnSimSD_write(0xff) << 24);
            *(unsigned long *)ptrBuf = MCIFIFO0;                         // it is assumed that the buffer is long word aligned and the format is little-endian
            ptrBuf += sizeof(unsigned long);
            MCIDataLength -= 4;
        }
        if (MCIDataLength == 0) {
            MCIStatus = DataEnd;                                         // read complete
            _fnSimSD_write(0xff);_fnSimSD_write(0xff);                   // dummy for simulation compatibility
        }
        #endif
    }
    DMACConfiguration = 0;                                               // disable DMA on completion
    #else
	MCIDataCtrl = (MCIDataCnt_Enable | MCIDataCnt_Direction_from_card | MCIDataCnt_block_size_512);
    fnDelayLoop(1);                                                      // to tune  
        #ifdef _WINDOWS
    _fnSimSD_write(0xff);                                                // dummy for simulation compatibility
        #endif
    while ((MCIStatus & (DataEnd | RxDataAvailble)) != DataEnd) {        // while data is still being received
        #ifdef _WINDOWS
        if (MCIDataLength != 0) {
            MCIStatus = RxDataAvailble;
            MCIFIFO0 =   _fnSimSD_write(0xff);
            MCIFIFO0 |= (_fnSimSD_write(0xff) << 8);
            MCIFIFO0 |= (_fnSimSD_write(0xff) << 16);
            MCIFIFO0 |= (_fnSimSD_write(0xff) << 24);
            MCIDataLength -= 4;
        }
        #endif
        if (MCIStatus & RxDataAvailble) {                                // at least one word ready
            *(unsigned long *)ptrBuf = MCIFIFO0;                         // it is assumed that ptrBuf is long-word aligned and storage little-endian
            ptrBuf += sizeof(unsigned long);
        }
        #ifdef _WINDOWS
        if (MCIDataLength == 0) {
            MCIStatus = DataEnd;                                         // read complete
            _fnSimSD_write(0xff);_fnSimSD_write(0xff);                   // dummy for simulation compatibility
        }
        #endif
    }                                                                    // warning - FIFO mode of operation is not suitable for high clock rates since receive overruns can easily take place
    #endif
    return UTFAT_SUCCESS;                                                // read successfully terminated
}


// Read a sector from SD card into the specified data buffer
//
extern int fnGetSector(unsigned char *ptrBuf)
{
    #ifdef SD_CONTROLLER_DMA
    if (((CAST_POINTER_ARITHMETIC)ptrBuf & 0x03) || NOT_USB_RAM(ptrBuf)) { // DMA buffer must be aligned in USB RAM
        int iRtn = _fnGetSector(_putUSB_RAM((unsigned char *)ulTempBuffer)); // fill the temporary buffer with the sector data
        uMemcpy(ptrBuf, _putUSB_RAM((unsigned char *)ulTempBuffer), 512); // copy from aligned to non-aligned location
        return iRtn;
    }
    #else
    if ((CAST_POINTER_ARITHMETIC)ptrBuf & 0x03) {                        // when working with FIFO the buffer must be long word aligned. If it is not, a temporary intermediate buffer is used and then copied from
        unsigned long ulTempBuffer[512/sizeof(unsigned long)];
        int iRtn = _fnGetSector((unsigned char *)ulTempBuffer);          // fill the temporary buffer with the sector data
        uMemcpy(ptrBuf, ulTempBuffer, 512);                              // copy from aligned to non-aligned location
        return iRtn;
    }
    #endif
    else {
        return (_fnGetSector(ptrBuf));                                   // since the destination memory is long-word aligned and can hold a complete sector no intermediate buffer is required
    }
}

// Read a specified amount of data from present SD card sector into the specified data buffer (usStart and usStop are offset from start of sector and avoid other data outseide of thsi range being overwritted)
//
extern int fnReadPartialSector(unsigned char *ptrBuf, unsigned short usStart, unsigned short usStop)
{
    #ifdef SD_CONTROLLER_DMA
    _fnGetSector(_putUSB_RAM((unsigned char *)ulTempBuffer));            // fill the temporary buffer with the sector data
    uMemcpy(ptrBuf, (_putUSB_RAM((unsigned char *)ulTempBuffer) + usStart), (usStop - usStart)); // just copy the part required
    #else
    unsigned long ulTempBuffer[512/sizeof(unsigned long)];               // since the SD controller will always read a complete sector we use an intermediate buffer
    _fnGetSector((unsigned char *)ulTempBuffer);                         // fill the temporary buffer with the sector data
    uMemcpy(ptrBuf, (((unsigned char *)ulTempBuffer) + usStart), (usStop - usStart)); // just copy the part required
    #endif
    return UTFAT_SUCCESS;                                                // read terminated
}

// This local function is always fed with an aligned input buffer which will also be in DMA accessible RAM in case of DMA operation
//
static int _fnPutSector(unsigned char *ptrBuf)
{
    MCIDataTimer  = DATA_TIMEOUT_VALUE;
    MCIDataLength = 512;
    #ifdef SD_CONTROLLER_DMA
    DMACC1SrcAddr  = (unsigned long)ptrBuf;                              // DMA 1 channel copy from buffer to FIFO
    DMACC1DestAddr = (unsigned long)MCIFIFO0_ADD;
    DMACC1Control  = (DMACCControl_SBSize_32 | DMACCControl_DBSize_8 | DMACCControl_SWidth_word | DMACCControl_DWidth_word | DMACCControl_SI | 512);
    DMACConfiguration = DMACCConfiguration_E;                            // enable DMA controller in little-endian mode
    while (!(DMACConfiguration & DMACCConfiguration_E)) {}               // wait until it is enabled
    DMACC1Configuration = (DMACCConfiguration_L | DMACCConfiguration_E | DMACCConfiguration_DstP_SD_MMC | DMACCConfiguration_M2PP);
    MCIDataCtrl = (MCIDataCnt_Enable | MCIDataCnt_DMAEnable | MCIDataCnt_block_size_512 | MCIDataCnt_Direction_to_card);
    fnDelayLoop(1);                                                      // to tune  
        #ifdef _WINDOWS
    _fnSimSD_write(0xfe);                                                // for compatibility
    MCIStatus = 0;
        #endif
    while (!(MCIStatus & DataEnd)) {                                     // wait until the DMA has completed the transfer to the destination buffer
        #ifdef _WINDOWS
        MCIFIFO0 = *(unsigned long *)ptrBuf;                             // it is assumed that the buffer is long word aligned and the format is little-endian
        ptrBuf += sizeof(unsigned long);
        MCIDataLength -= 4;
        _fnSimSD_write((unsigned char)MCIFIFO0);
        _fnSimSD_write((unsigned char)(MCIFIFO0 >> 8));
        _fnSimSD_write((unsigned char)(MCIFIFO0 >> 16));
        _fnSimSD_write((unsigned char)(MCIFIFO0 >> 24));
        if (MCIDataLength == 0) {
            MCIStatus = DataEnd;
            _fnSimSD_write(0xff);_fnSimSD_write(0xff);_fnSimSD_write(0xff); // for compatibility
        }
        #endif
    }
    DMACConfiguration = 0;                                               // disable DMA on completion
    #else                                                                // copy the buffer to the FIFO area
	MCIDataCtrl = (MCIDataCnt_Enable | MCIDataCnt_block_size_512 | MCIDataCnt_Direction_to_card); // activate transmission
    fnDelayLoop(1);                                                      // to tune  
        #ifdef _WINDOWS
    _fnSimSD_write(0xfe);                                                // for compatibility
        #endif
    while ((MCIStatus & DataEnd) == 0) {                                 // while data has not been completely transmitted
        if ((MCIStatus & TxFifoFull) == 0) {                             // if there is space in the FIFO
            MCIFIFO0 = *(unsigned long *)ptrBuf;                         // it is assumed that the buffer is long word aligned and the format is little-endian
            ptrBuf += sizeof(unsigned long);
        #ifdef _WINDOWS
            MCIDataLength -= 4;
            _fnSimSD_write((unsigned char)MCIFIFO0);
            _fnSimSD_write((unsigned char)(MCIFIFO0 >> 8));
            _fnSimSD_write((unsigned char)(MCIFIFO0 >> 16));
            _fnSimSD_write((unsigned char)(MCIFIFO0 >> 24));
            if (MCIDataLength == 0) {
                MCIStatus = DataEnd;
                _fnSimSD_write(0xff);_fnSimSD_write(0xff);_fnSimSD_write(0xff); // for compatibility
            }
        #endif
        }
    }
    #endif
    return UTFAT_SUCCESS;                                                // write successfully completed
}

