sWahlinRhoades/uTaskerModified/Hardware/LPC2XXX/LPC23XX.c
// Write present sector with buffer data
//
extern int fnPutSector(unsigned char *ptrBuf)
{
    #ifdef SD_CONTROLLER_DMA
    if (((CAST_POINTER_ARITHMETIC)ptrBuf & 0x03) || NOT_USB_RAM(ptrBuf)) { // DMA buffer must be aligned in USB RAM
        uMemcpy(_putUSB_RAM((unsigned char *)ulTempBuffer), ptrBuf, 512); // copy from non-aligned to aligned location
        ptrBuf = _putUSB_RAM((unsigned char *)ulTempBuffer);             // feed the intermediate buffer to _fnPutSector() in this case
    }
    #else
    if ((CAST_POINTER_ARITHMETIC)ptrBuf & 0x03) {                        // when working with FIFO the buffer must be long word aligned. If it is not, a temporary intermediate buffer is used
        unsigned long ulTempBuffer[512/sizeof(unsigned long)];
        uMemcpy(ulTempBuffer, ptrBuf, 512);                              // copy from non-aligned to aligned location
        ptrBuf = (unsigned char *)ulTempBuffer;                          // feed the intermediate buffer to _fnPutSector() in this case
    }
    #endif
    return (_fnPutSector(ptrBuf));
}
#endif


// This routine switches to low power mode. It is always called with disabled interrupts
//
extern void fnDoLowPower(void)
{
    PCON = PCON_IDL;                                                     // switch to low power mode - the CPU will stop but peripherals still execute
                                                                         // any enabled peripheral or external interrupt causes the processor to continue execution
    uEnable_Interrupt();                                                 // enable interrupt so the waiting one will be handled
}

// This routine is called to reset the card
//
extern void fnResetBoard(void)
{
    uDisable_Interrupt();
    WDMOD  = (WDEN | WDRESET);                                           // ensure watchdog is enabled
    WDFEED = 0xaa;                                                       // command reset to core and peripherals
    WDFEED = 0x55;
    WDFEED = 0xaa;
    WDFEED = 0;                                                          // bad feed sequence causes immediate reset
#ifdef _WINDOWS
    WDTV   = 0;
#endif
}


static void _Default_IRQ_handler(void)
{
}

static void _Default_FIQ_handler(void)
{
}

#if defined (_GNU)
extern unsigned char __data_start__, __data_end__;
extern const unsigned char __data_load_start__;
extern unsigned char __text_start__, __text_end__;
extern const unsigned char __text_load_start__;
extern unsigned char __bss_start__, __bss_end__;

extern void __init_gnu_data(void)
{
    unsigned char *ptrData = &__data_start__;
    const unsigned char *ptrFlash = &__data_load_start__;
    unsigned long ulInitDataLength = (&__data_end__ - &__data_start__);
    while (ulInitDataLength--) {                                         // initialise data
        *ptrData++ = *ptrFlash++;
    }

    ptrData = &__text_start__;
    ptrFlash = &__text_load_start__;
    if (ptrFlash != ptrData) {                                           // if a move is required
        ulInitDataLength = (&__text_end__ - &__text_start__);
        while (ulInitDataLength--) {                                     // initialise text
            *ptrData++ = *ptrFlash++;
        }
    }

    ptrData = &__bss_start__;
    ulInitDataLength = (&__bss_end__ - &__bss_start__);
    while (ulInitDataLength--) {                                         // initialise bss
        *ptrData++ = 0;
    }
}
#endif

// Perform very low level initialisation - called by the start up code
//
#if defined COMPILE_IAR
void _LowLevelInit( void) @ "ICODE"
#else
void _LowLevelInit( void)
#endif
{
    unsigned long *ptrInt;
    int i;
#ifdef SUPPORT_RTC
    PCONP = PCRTC;                                                       // disable all peripheral power apart from RTC - the peripherals will be powered on later as used
#else
    PCONP = 0;                                                           // disable all peripheral power - the peripherals will be powered on later as used
#endif

    // Configure the PLL for the desired operating frequency - note the exact sequence is very important
    //
    if (PLLSTAT & PLLCONNECTED) {                                        // if PLL is already connected (can be connected by ISP)
        PLLCON  = PLLE;                                                  // disconnect PLL, but leave enabled
        PLLFEED = 0xaa;PLLFEED = 0x55;                                   // perform feed sequence so that register changes are accepted
    }
    PLLCON  = 0;                                                         // disable PLL and disconnect
    PLLFEED = 0xaa;PLLFEED = 0x55;                                       // perform feed sequence so that register changes are accepted

#ifndef _LPC21XX
    #if CRYSTAL_FREQ > 15000000
    SCS |= (GPIOM | OSCRANGE | OSCEN);                                   // enable the oscillator and high speed GPIO mode
    #else
    SCS |= (GPIOM | OSCEN);                                              // enable the oscillator and high speed GPIO mode
    #endif
    #ifndef _WINDOWS
    while (!(SCS & OSCSTAT)) {}                                          // wait for it to stabilise
    #endif
#else
    #if defined LPC2101 || defined LPC2102 || defined LPC2103
    SCS = (GPIOM);                                                       // enable high speed mode on GPIO port 0
    #elif defined _LPC214X
    SCS = (GPIO0M | GPIO1M);                                             // {22} enable high speed mode on GPIO ports 0 and 1
    #endif
#endif
#ifndef _LPC21XX
    #if defined USE_RC_OSCILLATOR
    CLKSRCSEL = PLL_SOURCE_4M_RC;                                        // ensure RC source
    #elif defined USE_32K_OSCILLATOR
    CLKSRCSEL = PLL_SOURCE_RTC;                                          // RTC crystal as sourcey
    #else
    CLKSRCSEL = PLL_SOURCE_OSCILLATOR;                                   // oscillator as PLL clock source
    #endif
#endif
#ifndef DISABLE_PLL
    #ifndef _LPC21XX
    PLLCFG = PLL_FREQUENCY_CONFIGURATION;                                // PLL setting to generate required frequency
    PLLFEED = 0xaa;PLLFEED = 0x55;                                       // perform feed sequence so that register changes are accepted
    PLLCON = PLLE;                                                       // enable the PLL to search for lock
    PLLFEED = 0xaa;PLLFEED = 0x55;                                       // perform feed sequence so that register changes are accepted
    CCLKCFG = CPU_CLOCK_CONFIGURATION;                                   // set CPU clock frequency from PLL output
    while (!(PLLSTAT & PLLLOCKED)) {                                     // wait for lock to be achieved
    #ifdef _WINDOWS
    PLLSTAT = (PLLLOCKED | PLL_FREQUENCY_CONFIGURATION);
    #endif
    }
    PLLCON = (PLLE | PLLC);                                              // connect PLL to clock CPU
    PLLFEED = 0xaa;PLLFEED = 0x55;                                       // perform feed sequence so that register changes are accepted
    #else
    PLLCFG = PLL_FREQUENCY_CONFIGURATION;                                // PLL setting to generate required frequency
    PLLCON = PLLE;                                                       // enable the PLL to search for lock
    PLLFEED = 0xaa;PLLFEED = 0x55;                                       // perform feed sequence so that register changes are accepted
    while (!(PLLSTAT & PLLLOCKED)) {                                     // wait for lock to be achieved
    #ifdef _WINDOWS
    PLLSTAT = (PLLLOCKED | PLL_FREQUENCY_CONFIGURATION);
    #endif
    }
    PLLCON = (PLLE | PLLC);                                              // connect PLL to clock CPU
    PLLFEED = 0xaa;PLLFEED = 0x55;                                       // perform feed sequence so that register changes are accepted
    #endif
#endif
#if MASTER_CLOCK > 40000000                                              // set suitable MAM Flash timing
    MAMTIM = MAM_FETCH_CLOCKS_3;
#elif MASTER_CLOCK >= 20000000
    MAMTIM = MAM_FETCH_CLOCKS_2;
#else
    MAMTIM = MAM_FETCH_CLOCKS_1;
#endif
#ifdef _ERRATA_MAM_1_SOLVED                                              // operation can fail in first chips if full memory acceleration is used from FLASH, therefore only partially enable
    MAMCR = MAM_FULLY_ENABLED;                                           // enable full memory acceleration
#else
    MAMCR = MAM_PARTIALLY_ENABLED;
#endif
#ifndef _LPC21XX
    PCLKSEL0 = 0;                                                        // peripheral clocks set to default 1/4 speed
    PCLKSEL1 = 0;
#endif
    PINSEL0  = 0x00000000;                                               // set all pin states and ports to default
    PINSEL1  = 0x00000000;
#ifndef _LPC21XX
    PINSEL2  = 0x00000000;
    PINSEL3  = 0x00000000;
    PINSEL4  = 0x00000000;
    PINSEL5  = 0x00000000;
    PINSEL6  = 0x00000000;
    PINSEL7  = 0x00000000;
    PINSEL8  = 0x00000000;
    PINSEL9  = 0x00000000;
    PINSEL10 = 0x00000000;
#endif
    IO0DIR   = 0x00000000;                                               // legacy registers
#if !defined _LPC21XX || defined _LPC214X || defined _LPC213X
    IO1DIR   = 0x00000000;
#endif
#if (!defined LPC2104 && !defined LPC2105 && !defined LPC2106 && !defined _LPC213X) || !defined LPC21XX_LEGACY_PART // {11}
    FIO0DIR  = 0x00000000;
    #if !defined _LPC21XX || defined _LPC214X                            // {22}
    FIO1DIR  = 0x00000000;
    #endif
    #ifndef _LPC21XX
    FIO2DIR  = 0x00000000;
    FIO3DIR  = 0x00000000;
    FIO4DIR  = 0x00000000;
    #endif
    FIO0MASK = 0x00000000;
    #if !defined _LPC21XX || defined _LPC214X                            // {22}
    FIO1MASK = 0x00000000;
    #endif
    #ifndef _LPC21XX
    FIO2MASK = 0x00000000;
    FIO3MASK = 0x00000000;
    FIO4MASK = 0x00000000;
    #endif
#endif
    ptrInt = VICVECT_ADD;                                                // set up the default interrupts handler vectors
    *ptrInt++ = (unsigned long)_Default_FIQ_handler;                     // enter fast interrupt
    for (i = 0; i < INTERRUPT_COUNT; i++) {
        *ptrInt++ = (unsigned long)_Default_IRQ_handler;                 // set defaults to rest
    }
#if !defined (_WINDOWS) && defined (COMPILE_IAR) && !defined COMPILE_IAR5 // {3}
    __segment_init();                                                    // initialise variables
#elif defined (_GNU)
    __init_gnu_data();
#endif
    #ifdef _RAM_CODE                                                     // code running in RAM
    MEMMAP = 2;                                                          // map lowest 64 bytes of memory space to the bottom of internal RAM
    #else
    MEMMAP = 1;                                                          // keep lower 64 bytes of memory space from FLASH (also not from boot ROM)
    #endif
#if (defined _LPC214X || defined _LPC213X) && defined APBCLOCK_DIVIDE
    APBDIV = APBCLOCK_DIVIDE;
#endif                                                                   // default is MASTER_CLOCK/4 but needs to be changed to respect USB requirements
}
#endif
